{"id":1031,"text":"Handmade by Beadlight in the UK, the Cirrus collection was originally designed for use in private jet aircraft, and first and business class cabins. The range has proved incredibly successful in hotels, private residences and mega yachts. Built to the exacting standards demanded by the aeropsace industry, each Beadlight reading light is made by hand and wrapped in English leather with hand stitching.- Ideal as a bedhead light, the luxurious fitting provides two brightness settings for reading.- Can be mounted to existing walls and bed heads.- Simple installation is required by an electrician.- Energy Efficient. These LED lights become the perfect solution to make substantial energy savings.- The wall lights use 1.4 watts of energy and require a 12v transformer, not included.- Previously available only to architects and interior designers, the Beadlight collection is now available to the public exclusively through Dunlin.","label":[[312,335,"PRODUCT"],[861,881,"PRODUCT"]],"Comments":[]}
{"id":1033,"text":"Gift CardShopping for someone else but not sure what to give them? Give them the gift of choice with a Donna's Home Furnishings gift card.Gift cards are delivered to you, the purchaser, by email and contain instructions to redeem them at checkout. To send a gift card to someone, just forward them the email. Our gift cards have no additional processing fees.","label":[[104,138,"PRODUCT"]],"Comments":[]}
{"id":1034,"text":"DescriptionDesigned with simplicity in mind, the Hoyt Chair is anything but basic. Keep conversations flowing by placing a pair of these chairs in a room. The square silhouette and smart lines look even better when two chairs sit together. Plush cushions, and padded bolsters (which are stitched in place to keep the arms looking crisp and comfortable) make this chair the perfect place to chat or just relax.SpecificationsWe worry about the details of your furniture so you don't have to.- Frame: Kiln-dried hardwood frame (never particle board or pine).- Joints: Corner-blocked, high-pressure stapled, and glued (screwed and doweled frames also available).- Suspension: Unidirectional webbing (interwoven strips of nylon webbing that create a very stable platform for cushions).- Cushions: Medium HR polyurethane foam. No flame retardants.- Glue: Low-VOC- 38\" L x 36\" D x 34\" H- Makes a great swivel chair. Call or email for details.Don't see the right color? We have 100s of fabrics and leathers available at the Perch shop, including that perfect grey.DescriptionDesigned with simplicity in mind, the Hoyt Chair is anything but basic. Keep conversations flowing by placing a pair of these chairs in a room. The square silhouette and smart lines look even better when two chairs sit together. Plush cushions, and padded bolsters (which are stitched in place to keep the arms looking crisp and comfortable) make this chair the perfect place to chat or just relax.SpecificationsWe worry about the details of your furniture so you don't have to.- Frame: Kiln-dried hardwood frame (never particle board or pine).- Joints: Corner-blocked, high-pressure stapled, and glued (screwed and doweled frames also available).- Suspension: Unidirectional webbing (interwoven strips of nylon webbing that create a very stable platform for cushions).- Cushions: Medium HR polyurethane foam. No flame retardants.- Glue: Low-VOC- 38\" L x 36\" D x 34\" H- Makes a great swivel chair. Call or email for details.Don't see the right color? We have 100s of fabrics and leathers available at the Perch shop, including that perfect grey.","label":[[50,60,"PRODUCT"]],"Comments":[]}
{"id":1035,"text":"Our Hudson String weave stool is made from native Sungkai wood. With its tapered legs, light colour and attractive grain, this handsome piece will set off your kitchen bench with style. The super comfy but lightweight weave for the seat, is a natural alternative to standard upholstery.Dimensions & Need to Know:Width 40cm Depth 37cm Height 66cm.Use collapsible tabs for more detailed information that will help customers make a purchasing decision.Ex: Shipping and return policies, size guides, and other common questions.","label":[[4,29,"PRODUCT"]],"Comments":[]}
{"id":1037,"text":"DescriptionIncorporating the cutting-edge technology, the lavish construction addresses all elements that will offer you a comfortable and luxurious experience - Euro top padding with high-density foam and an independent coil system - made to provide you with an undisturbed sleep all night long.Terms and conditions of Free Shipping PromotionsThe free shipping promotion excludes some postcodes.Where a postcode exclusion applies, the item will be undeliverable and the sale will be fully excluded from the free shipping campaign. Normal T&’s and C&’s will apply in this case.Additional freight charges will apply to postcode exclusion orders. We will contact you and advise of any additional charges. You are entitled to cancel the order if additional charges apply.For any further information, please contact our admin team on info@factorybuys.com.au and attention your email to the management team.Product Features5 zoned pocket springs - Different levels of supportIndependent coil system - Excellent support and sublime comfort6 working turn coil systemHigh-density foamMedium firmnessHypo-allergic materialLuxury knitted jacquard fabricSide handles for positioningVacuum packaging: The item will expand to its normal shape within 1 day after unpackingCare InstructionsDo not machine washDo not bleachDo not ironDo not dry cleanDo not saturate with water or other cleaning liquidsTreat spills with a cloth and dry with a blow dryerIt May be spot cleaned with water or soapRotate mattress regularlyVacuum using low suctionDimensions & Specs| Dimensions | Width | Height | Depth ||---|---|---|---|| Product | 183cm | 32cm | 203cm || Package | 30cm | 30cm | 188cm |SpecificationsSize: KingNumber of coils: 928Firmness: 5. 0 \/ MediumThickness: 32cmDimensions: 203cm x 183cm x 32cmWhat’s IncludedWarranty InformationSome items come with a 12 month warranty which you may seek a refund or replacement for the item.Extended warranties for your peace of mind may also be available for some items. Please refer to the item listing for warranty period.The warranty periods apply from the date of purchase of the product and any claim under this warranty must be made within 12 monthsSubject to the terms and conditions of this warranty, where your goods are defective within 12 months of your purchase, Factory Buys agrees to repair the goods, provide you with a replacement or provide you with store credit or a refund for the full amount of the purchase price (in the event that it is not possible to repair the goods or a replacement is unavailable).Frequently Bought TogetherChloe Bed Frame Metal Platform Bed Base Mattress - Black KingSave $94!Save $94!Azalea LED Bed Frame PU Leather Gas Lift Storage - Black KingSave $482!Save $482!Florence Metal Bed Frame Base Platform - Black KingSave $259!Save $259!Savannah Bed Frame Fabric Gas Lift With Storage - White KingSave $491!Save $491!King Royal Comfort 1200 TC Damask Stripe Cotton Blend Sheet Sets MistSave $165!Save $165!King DreamZ Mattress Protector Topper PolyesterSave $32!Save $32!King Dreamz Mattress Protector Luxury TopperSave $27!Save $27!- Choosing a selection results in a full page refresh.","label":[[2618,2679,"PRODUCT"],[2700,2761,"PRODUCT"],[2784,2835,"PRODUCT"],[2858,2918,"PRODUCT"],[2941,3010,"PRODUCT"],[3033,3080,"PRODUCT"],[3101,3145,"PRODUCT"]],"Comments":[]}
{"id":1038,"text":"Samson Daybed Frame - SingleSizeNote: This is a frame only. Does not come with mattress or cover. Mattress and cover can be purchased separately.A Vast Icon, the Samson Daybed is a simple design, beautifully executed.Crafted from solid mango hardwood, and hand finished with 4 coats of hard wearing NC lacquer, this daybed is designed to last for decades. While we sell many of these for inside use, it is also perfectly suited for a covered veranda.The timber used in this piece is sustainably sourced Mango Wood. Each plank is individually treated in a computer controlled kiln to reduce the chance of any cracks or warping in its long future as a furniture component.This piece has been handcrafted by one of our Vast Masters, these individual cabinet makers have been manufacturing Vast products for over a decade. Using traditional joinery techniques to maximise the timber's natural beauty is a big part of the unique look of each Vast product. We call this \"working with the grain\". After the joinery is complete it is then hand sanded and hand polished with several coats of high grade German lacquer so it will last for generations!Country of Origin: IndiaHardwood is a natural material which reacts to its environment and although our manufacturing process allows for normal expansion and contraction, extreme high or low humidity may cause more swelling than normal. To minimise movement and ensure longevity of your purchase we recommend taking good care of your piece as outlined below:- Dust regularly with a clean cotton cloth;- Use tablecloths, table runners and coasters to help prevent scratches to the surface and wipe up any spills immediately;- To nourish and protect your furniture we recommend waxing with a natural beeswax every 6-12 months.- Only use natural wax, oil or water based cleaning products. Do not use solvent based cleaning products that may contain silicone or alcohol, as this may react and permanently damage the lacquer.- Do not expose to fragrant oils, insect repellent lotion, or nail polish remover as these are often solvent based and will damage the lacquer- Avoid placing your furniture near fireplaces, in direct sunlight or under heating\/cooling vents.- Do not leave hot items or ice cold items directly on the surface of the table as water marking may occur.- Any metal work featuring on your product has been powder coated. Any damage to the surface should be contained as soon as possible to prevent rusting.Matches perfectly with:Product SpecsBox 1 (top) 220 x 90 x 13cm. Box 2 (Legs): 89 x 95 x 15cmTotal Weight:49kgPACK TYPE: Flat PackASSEMBLY: Partially Assembled, Easy BuildMATERIALS: Mango TimberPLEASE NOTE: This is a naturally hand crafted product so slight variations in sizing will occur. All measurements are in cm.","label":[[0,19,"PRODUCT"]],"Comments":[]}
{"id":1040,"text":"More from Christmas Gift Guide - FurnitureAutumn Sale | 20%* Off FurnitureAutumn Sale | 20%* Off FurnitureSign up for exclusive offers and first looks at our newest arrivals.The Hamar Plant Stand is a wonderful accessory that holds at least three pot plants or other objects such as vases, sculptural objects or lamps. Use it to fill a corner or that tricky spot, bring height and greenery to your room.Dimensions: 65cm at widest point x 60cm (D) x 92cm (H)Each platform has 28cm (W) x 28cm (D) of useable space.Materials: Solid Ash, Clear LacquerSign up for exclusive offers and first looks at our newest arrivals.","label":[[182,199,"PRODUCT"]],"Comments":[]}
{"id":1041,"text":"Coco Ruffle MirrorCoco Ruffle MirrorRegular price$2,119.00Regular priceSale price$2,119.00Unit price\/perMaterialsCoco Wood and Beads; Beveled MirrorDimensions37\" Diameter x 7\" DeepDetailsPalecek presents the Coco Ruffle Mirror made of a beveled mirror with a ruffle shaped metal frame embellished with coco wood and beads is finished in a natural finish.*Please note that many Palecek items are made to order and require additional construction time. The specific production time will be confirmed after you place your order. Inquire below for current availability.Shipping & ReturnsIn stock and ready to ship. Order now and enjoy Free shipping.Contact us here.Returns must be made within 14 days. See details.- Choosing a selection results in a full page refresh.- Opens in a new window.","label":[[0,18,"PRODUCT"],[19,37,"PRODUCT"]],"Comments":[]}
{"id":1042,"text":"DescriptionDimensionsDimension drawingMaterials and finishesBlack American walnutBlack walnut is a hardwood with a rich and straight-grained timber, it can display many unique characteristics, such as knots and variations in depth of tone. The walnut we source is native to North America. We use a protective lacquer finish which enables the timber to age gracefully without heavy discolouration and withstand daily spillage.European oakEuropean oak is a temperate white oak hardwood native to Europe. It presents a golden to light brown hue with a minimal grain pattern. We use a protective white oil finish to allow the timber to age gracefully without heavy discolouration and withstand daily spillage.Dark brown house leatherOur house leather is a dark brown aniline leather. As such, it may reveal natural markings such as scarring, growth marks and variation in tone and colour. These markings are a part of the beauty of the leather which has been selected for its natural materiality, high quality and comfort. As a natural material it will age according to its environment, creating a beautiful patina over time.Care guideOiled woodAn oiled finish is a durable natural looking finish that can be revitalised (and if necessary, more easily repaired). Oiled finishes require some low level maintenance to keep the wood protected and looking its best.Day to day cleaning:• Wipe clean with a damp non-abrasive cloth, then using a dry cloth remove any excess moisture.• Wipe up wine, oil and any liquids that might stain as quickly as possible.• To ensure the finish remains as resilient as possible to staining we recommend Osmo Wash & Care (8016) as it contains soaps and oils to both nourish and prevent the wood from drying out.6 monthly replenishment \/ more stubborn stains:• As the table is used it can dry out as the oil can thin with wear and washing with water alone. If the table looks dry or you have a more stubborn stain we recommend using a revitalising Osmo Liquid Wax Cleaner (white 3087) for oak pieces and (clear 3029) for walnut piecesDo not:• Leave any water, wine, oil or liquids that might stain – wipe up as quickly as possible. (Oil provides a semi-permeable finish, which means some liquids can penetrate the surface if left)• Use ANY chemical cleaning products or bleach as this will remove the protective layer of oil and it will then stain.Lacquered woodA lacquered finish requires very little maintenance and is durable and resistant to spills.Day to day cleaning:• Wipe clean with a damp cloth then buff off with a clean, dry cloth.Do not:• Leave any wine, oil or liquids that might stain – wipe up as quickly as possible.• Use any abrasive cleaning products or bleach as this could damage the protective layer of lacquer.House leatherOur house leather is a pure aniline leather. As such, it may reveal natural markings such as scarring, growth marks and variation in tone and colour. These markings are a part of the beauty of the leather which has been selected for its natural materiality, high quality and comfort. As a natural material it will age according to its environment, creating a beautiful patina over time. We recommend you avoid placing furniture in direct sunlight or next to strong heat sources as this can cause aniline leather to discolour or dry out prematurely.Day to day cleaning:• As an untreated material, the leather is naturally absorbent. If cleaning is essential for small marks, carefully dab with a clean, lint-free cloth, and vacuum gently using the small brush attachment. For more pronounced marks, please refer to a professional leather cleaner.Do not:• Use any abrasive or chemical cleaning products or bleach, as this will damage the leather.OriginYves desk£3,900£4,510£4,510£4,510£4,510£4,510£4,250£5,150£5,150£5,150£5,150£5,150Includes VAT. Excludes shipping or overseas crating.DescriptionDimensionsDimension drawingMaterials and finishesBlack American walnutBlack walnut is a hardwood with a rich and straight-grained timber, it can display many unique characteristics, such as knots and variations in depth of tone. The walnut we source is native to North America. We use a protective lacquer finish which enables the timber to age gracefully without heavy discolouration and withstand daily spillage.European oakEuropean oak is a temperate white oak hardwood native to Europe. It presents a golden to light brown hue with a minimal grain pattern. We use a protective white oil finish to allow the timber to age gracefully without heavy discolouration and withstand daily spillage.Dark brown house leatherOur house leather is a dark brown aniline leather. As such, it may reveal natural markings such as scarring, growth marks and variation in tone and colour. These markings are a part of the beauty of the leather which has been selected for its natural materiality, high quality and comfort. As a natural material it will age according to its environment, creating a beautiful patina over time.Care guideOiled woodAn oiled finish is a durable natural looking finish that can be revitalised (and if necessary, more easily repaired). Oiled finishes require some low level maintenance to keep the wood protected and looking its best.Day to day cleaning:• Wipe clean with a damp non-abrasive cloth, then using a dry cloth remove any excess moisture.• Wipe up wine, oil and any liquids that might stain as quickly as possible.• To ensure the finish remains as resilient as possible to staining we recommend Osmo Wash & Care (8016) as it contains soaps and oils to both nourish and prevent the wood from drying out.6 monthly replenishment \/ more stubborn stains:• As the table is used it can dry out as the oil can thin with wear and washing with water alone. If the table looks dry or you have a more stubborn stain we recommend using a revitalising Osmo Liquid Wax Cleaner (white 3087) for oak pieces and (clear 3029) for walnut piecesDo not:• Leave any water, wine, oil or liquids that might stain – wipe up as quickly as possible. (Oil provides a semi-permeable finish, which means some liquids can penetrate the surface if left)• Use ANY chemical cleaning products or bleach as this will remove the protective layer of oil and it will then stain.Lacquered woodA lacquered finish requires very little maintenance and is durable and resistant to spills.Day to day cleaning:• Wipe clean with a damp cloth then buff off with a clean, dry cloth.Do not:• Leave any wine, oil or liquids that might stain – wipe up as quickly as possible.• Use any abrasive cleaning products or bleach as this could damage the protective layer of lacquer.House leatherOur house leather is a pure aniline leather. As such, it may reveal natural markings such as scarring, growth marks and variation in tone and colour. These markings are a part of the beauty of the leather which has been selected for its natural materiality, high quality and comfort. As a natural material it will age according to its environment, creating a beautiful patina over time. We recommend you avoid placing furniture in direct sunlight or next to strong heat sources as this can cause aniline leather to discolour or dry out prematurely.Day to day cleaning:• As an untreated material, the leather is naturally absorbent. If cleaning is essential for small marks, carefully dab with a clean, lint-free cloth, and vacuum gently using the small brush attachment. For more pronounced marks, please refer to a professional leather cleaner.Do not:• Use any abrasive or chemical cleaning products or bleach, as this will damage the leather.Origin","label":[[3755,3764,"PRODUCT"]],"Comments":[]}
{"id":1044,"text":"Gift Voucherby Do Shop£10.00( \/ )UnavailablePlease select all options.Shopping for someone else but not sure what to give them? Give them the gift of choice with a Do Gift Voucher.Gift vouchers are delivered by email and contain instructions to redeem them at checkout. Our gift vouchers have no additional processing fees and can be used over multiple transactions.","label":[[0,23,"PRODUCT"]],"Comments":[]}
{"id":1047,"text":"Alf (tall) and Bud (short) are a friendly pair of side tables, different in size and shape but sharing in characteristic material and form. Silhouette hand turned pedestals in solid ebonised oak with natural oak finished tops.Ready to ship: 5-10 working daysShipping guide: UK for £32Dimensions: Alf: ø400 x 570h mmBud: ø500 x 420h mmCustomise: This piece is made to order which allows us to give some ﬂexibilty to you if you need to specify alternative dimensions or a different timber\/ finish. We work closely with the trade to develop bespoke and exclusive commissions for larger schemes.","label":[[0,26,"PRODUCT"]],"Comments":[]}
{"id":1052,"text":"Thank you for all your help and great service. I love my new pine wardrobes, they fit perfectly and my bedroom ...Many thanks for supplying my made to measure solid pine bookcases. They add loads of character to my office and...I was very impressed with the service and the item I ordered from Good Wood Furniture in Bondi Junction, through Kate...I just love this store. I always find what I want, I have bought many pieces of furniture over the last 20 years ...Thank you sooo much Katerina at Good Wood Furniture for the Great Service & also I'm sooo happ...Australian Made Colonial RobeThis lovely piece will just add so much charm to any bedroom. Large drawers which run smoothly on metal runners and hanging space deep enough for adults hangers.Is available in bigger sizes and made to measure. Fully assembled and made to last.Features:Measurements:Height 1900mm x Width 960mm x Depth 530mmCustomize Your Product© 2021 Good Wood Furniture All Rights Reserved.Designed & Developed by Eclick Softwares & Solutions Pvt. Ltd.","label":[[566,595,"PRODUCT"]],"Comments":[]}
{"id":1055,"text":"Enso Platform Bed Frame and Headboard - Solid Wood Modern Bed FrameDescriptionThe Enso Platform Bed invites you to peaceful slumber with its gentle curves that are reminiscent of the Myojin torii, the Japanese gates guarding Shinto shrines. A higher headboard with the slightest incline offers comfort for reading and watching TV. Crafted with traditional joinery from solid wood, this bed frame offers a sturdy and lasting foundation for rest. Enjoy stable support as you sleep every night knowing your bed frame can serve you for years.Bed SpecificationsSizesAll Enso Beds Have a 12\" Tall Platform and a 44\" tall headboard with 10.25\" clearance under the bed. This bed frame is designed to accommodate mattresses 10-14” thick. If your mattress is different, we can customize a frame to fit your needs at no added cost.- Twin - 42 x 79- Full - 58 x 79- Queen - 66 x 84- King - 82 x 84- Cal King - 78 x 89MattressesThis platform bed is built to accommodate all mattress types. This frame will protect your mattress from all latex to coil and even memory foam.If you have not purchased a mattress yet, contact us about our Organic Mattress lines; you will be glad you did!Wood Finish OptionsWood OptionsWe never stain our wood. It is all 100% natural solid wood in cherry, walnut, oak, and maple. Each wood option is the actual wood species your item will be built using. This gives you a prettier wood grain and a better quality piece of furniture.FinishEvery piece is meticulously and sumptuously finished with our signature finishes formulated from non-toxic, all-natural ingredients with zero VOC emissions. This makes our pieces a great option for those looking for organic furniture.ShippingWe know buying furniture from TY Fine Furniture is a long term investment and that our customers want their items on time and in perfect condition.We want the best experience for all our customers. Because of this, we have developed a shipping process that results in consistently excellent results.Currently, all items are designed to be lightly disassembled for shipping. This means that there is some light assembly involved with most items. Most items it means attaching the legs, on beds its a little more complex, but still very simple.By lightly disassembling every item, it also means that you can easily and quickly move the individually boxed parts into your room with ease, our target for each box is a maximum weight of 75 lbs. Every individual box is sized to go through smallest elevator and around tightest corners.Our average bed frame takes 30-45 minutes to assemble, our customers are always elated about how easy it is, and how sturdy and durable the resulting furniture becomes.Documentation","label":[[0,37,"PRODUCT"],[84,101,"PRODUCT"]],"Comments":[]}
{"id":1060,"text":"Handmade solid Oak bench. Beautifully simple with a gently curved seat, softened edges and tapered legs.W86cm x D30cm x H47cmAlso available as a stool.Regular priceSale price£520.00Unit price\/ perTax included.FURNITURE DELIVERY TIMES: For items made to order our lead time is 6 - 12 weeks.Items marked 'In stock for quicker delivery' are usually delivered within 2 - 6 weeks. We will contact you to confirm the details of your order, including colour and finish, and discuss delivery dates.HOMEWARES AND GIFTS: All items in our Homewares and Gifts Collection are in stock and will be delivered within 3-7 days.If for any reason there is a delay in sending these items out we will contact you to let you know.","label":[[0,24,"PRODUCT"]],"Comments":[]}
{"id":1061,"text":"Esme Natural Rattan Day Bed 1 IN STOCK- Regular price- $1,399.00- Regular price-- Sale price- $1,399.001 IN STOCK NOWEsme rattan day bedEsme measures approximately 198cm long x 76cm high x 96cm deep.Mattress measures 92cm wide x 188cm long x 10cm thick and has a removable cover.This is a natural rattan product and colour variation will occur.Your Shopping Cart is EmptyBrowse our latest collection or check your saved favorites to add more items to your cart.Manage your profile, track your orders, and enjoy a seamless shopping journey with us.","label":[[125,144,"PRODUCT"]],"Comments":[]}
{"id":1068,"text":"SUBMIT ORDERS AND PRODUCT ISSUES WITH PICTURE VIA EMAIL: support@allwoodfurn.com5600\/5601Rustic Two Tone Gathering Table and BarstoolsTable: 5600 * 42”W x 60\/78”D x 36”H * Rustic Two-Tone Rectangular Gathering Table w\/Self-Storing Butterfly LeafBarstool: 5601 * 24”W x 24”D x 42”H * Rustic Two-Tone Barstool","label":[[175,218,"PRODUCT"]],"Comments":[]}
{"id":1073,"text":"Search for:HomeCategoriesBedroomMaster BedroomKids BedroomLiving RoomsSeatingTV Stands & Ent. CentersOccasionalFutonsDining RoomLightingFloor LampsTable LampsAccentsAccent ChairsPayment OptionsAbout UsContact UsBrowse by BrandMenuHomeBrowse by BrandBrowse by CategoryBedroomMaster BedroomKids BedroomLiving RoomSeatingTV Stands & Ent. CentersOccasionalFutonsDining RoomLightingFloor LampsTable LampsAccentsAccent ChairsPayment OptionsAbout UsContact Us","label":[[149,160,"PRODUCT"],[161,172,"PRODUCT"],[181,194,"PRODUCT"],[412,423,"PRODUCT"],[424,435,"PRODUCT"],[444,457,"PRODUCT"]],"Comments":[]}
{"id":1074,"text":"tip table lamp- free UK delivery in 2-4 weeksDesigned by Jens Fager for Danish brand Muuto, the Tip Lamp is a unique and beautifully minimal table lamp. Created from the idea of stripping a design down to its essentials, the Tip Lamp is an example of simple, functional design with careful attention to detail. Offering direct as well as ambient light, the lamps adjustable head and arm feature an opal diffuser and dimmer function that effortlessly alters the volume of light. Display on your desk, shelf or sideboard.Also available as a Wall Lamp and Floor Lamp.| As featured in Living Etc |Dimensions: H40 x W16cmMaterials & Bulb: view product fact sheetWE OFFER FREE UK DELIVERY ON ALL ORDERS OVER £50We process orders Monday - Friday between 9.30am and 5pm. Please contact us with any order enquiries during these hours at hello@somedaydesigns.co.uk or give us a call on 07730 112792.DELIVERYFor items we carry in stock, you should receive your order within 3-5 working days, depending on where you are based in the UK.Due to the bespoke nature and wide choice of our lighting and furniture items, most are not held in stock. We will specifically order these in for you as per the finish, size or colour you have selected at the point of order. Delivery times vary by product and design partner, so please find the relevant lead time information on the product page. Once orders have been received into our warehouse we will arrange final delivery with you.We offer a simple and competitive delivery rate:| Delivery details UK | Price || Orders up to the value of £50 | £4.99 || Orders over £50 | Free |Please note, Highlands and Islands deliveries are not included in the UK charges above and may be charged an additional fee so please check prices with us prior to ordering.There are rare occasions where factors out of our control can delay a delivery, so we ask for your patience in these circumstances and we promise to keep you up to date should this apply to your order.Overseas deliveryWe can deliver overseas and will need to offer a quotation. Please contact us for a quote, with the details of your order and its destination hello@somedaydesigns.co.uk | 07730 112792.Delivery PartnersWe use Royal Mail, UPS or APC to deliver accessories, small furniture & lighting. Delivery is Monday to Friday, we will notify you once the item has been sent and provide tracking details where applicable.For large furniture orders such as sofas, we use a specialist furniture home delivery team, who are experts in handling furniture to make sure your delivery goes as smoothly as possible. This service is a 'white glove' service and includes the following:Confirmation of your two-hour delivery window the working day before your agreed delivery dateAn estimated time of arrival on the day of delivery (this is a guide not a guarantee due to traffic and possible difficulties in earlier deliveries which are out of our control)Two man delivery teamUnpack and position the furniture in the room of your choiceRemove and recycle packagingWe ask that you check the dimensions at the delivery address for access (including doors, corridors and stairs) as well as the area of intended use, before you order to ensure that the product is the right size for you and to enable us to deliver your order successfully. You must provide a clear route to the room of choice removing any obstacles from the exterior and communal areas. Goods that fail to fit into your property at the point of delivery are your responsibility as we have no control over this. Please also advise us of any parking restrictions, red routes or width restrictions ahead of the delivery.Access ChecksIf you are looking to buy a sofa but concerned that it might not fit through your doorway or stairwell then it's worth considering using our access check service. For an additional fee a trained member of our team will visit your home to measure up, giving you piece of mind before you buy. Get in touch to find out pricing and further details.Removal of existing furnitureAs part of the white glove service we can also remove your old furniture for an extra fee, which must be arranged with us prior to delivery. We reserve the right to refuse collection of unhygienic furniture for health and safety reasons. Please get in touch to find out further details.RETURNSWe offer a no quibble returns policy* - so you are fully entitled to a refund within 14 working days of delivery.*except for the products described below referred to as made-to-order or those in our Outlet\/Clearance collection.Please get in touch with us if you wish to return an item and we will advise how best to proceed hello@somedaydesigns.co.uk | 07730 112792.We ask that the product you return is in new, unused, condition with all the original packaging and product tags still attached. For small accessory items being returned by post or courier, we advise you use an insured, signed for service in case the parcel fails to reach us. Unfortunately we cannot cover the cost of return postage, unless the item is faulty.Someday Designs reserve the right to refuse a refund on any item if we find that the product has not been returned to us in fully resalable condition.All accurately returned products will be credited to the original purchaser’s credit or debit card, excluding delivery costs, within 7 working days once received and checked. We will email you confirmation once the refund has been made.Damaged or faulty itemsWe make every effort to deliver your items to you in perfect condition. We recommend that you check your delivery as soon as it is received. If there is a problem with your order please contact hello@somedaydesigns.co.uk | 07730 112792 as soon as possible so that we can resolve it for you promptly. We may ask you to send images of the fault and it is advisable to keep the original packaging in which the item arrived.Returns Procedure for Furniture Orders OnlyShould you wish to return a furniture item we will arrange to collect this item from you and will apply an appropriate collection charge, which will be deducted from the refund value when processed. To arrange a collection please contact our team hello@somedaydesigns.co.uk | 07730 112792.Products, which fall into the following categories, will not be refunded unless they are proven to be faulty;- Any goods made to order or not normally kept in stock at Someday Designs (see more information below)- Self assembly furniture cannot be returned once assembly is part or fully completedMade-to-order productsDue to the bespoke nature of the products we supply and the diverse choice of finishes and materials, goods are often made-to-order by our design partners and imported from overseas. Therefore it is not possible to return these items.We will contact you via email to confirm your made-to-order details to ensure all specifications are completely correct before we place the order with the supplier. Following delivery, made-to-order goods are non-returnable unless we have not supplied the correct item or specification as per the order confirmation email.Made-to-order pieces are sofas, furniture and lighting items whereby you select a fabric, colour, material finish or size at point of order.","label":[[0,14,"PRODUCT"],[98,106,"PRODUCT"],[227,235,"PRODUCT"]],"Comments":[]}
{"id":1075,"text":"Skip to contentLIVINGLIVINGSOFASACCENT CHAIRSCOFFEE TABLESEND TABLESSIDE TABLESTV STANDSDININGDININGDINING TABLESDINING CHAIRSBAR STOOLSSIDEBOARDS & BUFFETSBEDROOMBEDROOMBEDSDRESSEROUTDOORARTDECORDECORALL ACCESSORIESBOWLSTRAYSSHELVESVASESMIRRORSSCULPTURESSALEDESIGN SERVICEDESIGN SERVICETURNKEY FURNISHINGINTERIOR DESIGNCONTACTLog inX (Twitter)FacebookPinterestInstagramYouTubeLIVINGSOFASACCENT CHAIRSCOFFEE TABLESEND TABLESSIDE TABLESTV STANDSDININGDINING TABLESDINING CHAIRSBAR STOOLSSIDEBOARDS & BUFFETSBEDROOMBEDSDRESSEROUTDOORARTDECORALL ACCESSORIESBOWLSTRAYSSHELVESVASESMIRRORSSCULPTURESSALEDESIGN SERVICETURNKEY FURNISHINGINTERIOR DESIGNCONTACTSearchLog inCartItem added to your cartView cartCheck outContinue shoppingHomeCollectionsCollectionsSOFASSOFASDINING TABLESDINING TABLESOUTDOOROUTDOORBEDROOMBEDROOMDINING CHAIRSDINING CHAIRSACCENT CHAIRSACCENT CHAIRSBAR STOOLSBAR STOOLSSIDEBOARDS & BUFFETSSIDEBOARDS & BUFFETSCOFFEE TABLESCOFFEE TABLESACCESSORIESACCESSORIESARTARTChoosing a selection results in a full page refresh.Opens in a new window.","label":[[36,49,"PRODUCT"],[87,96,"PRODUCT"],[111,124,"PRODUCT"],[125,138,"PRODUCT"],[139,149,"PRODUCT"],[150,170,"PRODUCT"],[187,191,"PRODUCT"],[240,245,"PRODUCT"],[246,251,"PRODUCT"],[252,259,"PRODUCT"],[260,265,"PRODUCT"],[266,273,"PRODUCT"],[274,284,"PRODUCT"],[446,459,"PRODUCT"],[460,470,"PRODUCT"],[471,482,"PRODUCT"],[483,492,"PRODUCT"],[500,513,"PRODUCT"],[514,527,"PRODUCT"],[528,538,"PRODUCT"],[539,559,"PRODUCT"],[573,580,"PRODUCT"],[615,620,"PRODUCT"],[621,626,"PRODUCT"],[627,634,"PRODUCT"],[635,640,"PRODUCT"],[641,647,"PRODUCT"],[649,658,"PRODUCT"]],"Comments":[]}
{"id":1077,"text":"Big Cay DeskWhite Glove DeliveryFree Design ServicesExcellent Customer ServiceCommitted to SustainabilityORDER PAINT & FABRIC SAMPLES.Sometimes it helps to see a color in person or get a feel for the fabric before you commit. We get it! That's why we offer sample cards for our 30 paint colors and 100+ fabric offerings. SHOP SAMPLES >.","label":[[0,12,"PRODUCT"]],"Comments":[]}
{"id":1079,"text":"Painted Furniture Collections- Berkshire - Navy Blue & Brass- Baroque Painted Collection- Cross Country Grey and Oak- Chester Dove Grey & Solid Oak- Capri Solid Pine & White Painted- Mabel Taupe Bedroom- Marseille Grey Painted- Parisian White- Parisian Grey- Stowe Grey Painted- St.Ives French Grey & Oak- St.Ives White Painted & Oak- Sunbury Grey & Oak- Winchester Oak & Painted- Gaia Childrens Bedroom Furniture- See more","label":[[32,61,"PRODUCT"],[64,90,"PRODUCT"],[93,119,"PRODUCT"],[122,151,"PRODUCT"],[154,186,"PRODUCT"],[189,208,"PRODUCT"],[211,233,"PRODUCT"],[236,250,"PRODUCT"],[252,266,"PRODUCT"],[269,287,"PRODUCT"],[290,315,"PRODUCT"],[318,345,"PRODUCT"],[348,366,"PRODUCT"],[369,393,"PRODUCT"],[396,428,"PRODUCT"]],"Comments":[]}
{"id":1081,"text":"Gift CardHAUSShopping for someone but not sure what to give them? Give them the gift of choice with a haus® Gift Card.Gift cards are delivered by email, they feature a unique code to redeem them on our website or in our London shop. The value of credit can be spent in one or more transaction towards goods of any value.Simply select the value required. If the amount you want is not shown you can add multiple amounts to checkout to create the total value you would like. See Terms for details and conditions.In StockIn stock and ready to despatch! UK delivery usually 1-2 days. Larger items and non mainland addresses will take a little longer.Quick Ship false weeksGood news! This popular item is usually available on a quick lead time in the finish you selected (other options may have different lead time).Default two man delivery noticeDefault two man delivery informationBespoke terms & Conditions TitleThis item is made specially for you and special terms apply (see Terms and Conditions). Lead times are provided as an estimate and can vary. Read MoreMade to Order false weeksThis item is made specially for you in the options you choose and special terms apply. Lead times are provided as an estimate only and can vary.Contact UsLead times are provided as a general guide to what is typical for this product but can vary depending on the specific variant and quantity you choose as well as current availability. Read MoreOrder In Store \/ Contact UsThis product is available to order in store. Contact us for details.Added to your basket","label":[[104,119,"PRODUCT"]],"Comments":[]}
{"id":1082,"text":"The handsome Costa stool collection features substantial wraparound upholstered backs, clad in rich walnut veneer, to coordinate with our popular Costa dining chair. Choose between stationary bar and counter stools, or the hydraulic swivel stool for superb comfort and a stylish, modern look. You can select any Elite powder-coat and wood finish to customize Costa to exactly fit your design scheme. All stools feature polished chrome footrests for sparkle and durability, and the hydraulic stool easily adjusts from counter to bar height. Costa stools will easily coordinate with any of our popular bars or pub tables to create a sleek, contemporary ensemble.Special Order Only.Dimensions:22d x 21w x 40h","label":[[13,24,"PRODUCT"],[146,164,"PRODUCT"],[540,552,"PRODUCT"]],"Comments":[]}
{"id":1083,"text":"Designed by Paul Scharer and Fritz HallerMade in Switzerland by USM HallerThis Side Table O118 is part of the USM modular furniture collection created to combine elegance with architectural functionality. This system features a storage system with chrome-plated brass ball joints attached to steel tubes and metal panels. This rectangular storage media stand features one drop down door. Available in 6 different colors.Specifications: 31\" W | 15\" D | 23\" HVendor: USMSign up to get the latest on sales, new releases and more.© 2016 SoftSquare - All Rights Reserved941.554.4068Please Wait...","label":[[76,96,"PRODUCT"],[112,144,"PRODUCT"]],"Comments":[]}
{"id":1087,"text":"QW Amish McKee 6pc Dining Set115T-MTT-821Y-LOGAN-SET-R.QS\/BM-2-TONE- $199 Nationwide Curbside Delivery- $399 Nationwide In-Home Delivery- Amish Hand CraftedUnsure which wood species will look and function the best in your home? Check out our Wood Guide and Stain Colors. Or, order Finish Samples.Shipping OptionsAt QW Furniture, we offer four different options for getting your new furniture to you:- Free In-Store Pickup: Pick up your purchase at our store, free of charge.- Local Delivery: Enjoy a two-man, white glove delivery service if you reside within our local delivery radius.- Long-Distance Curbside Delivery: Available for a flat rate of $199, this service is for customers living outside our local delivery radius. This includes unloading your furniture onto your curb or driveway.- Long-Distance In-Home Delivery: For a flat rate of $399, this white-glove, in-home delivery experience is available for customers outside our local delivery radius. This includes complete in-home delivery and removal of waste packaging materials. Please note that our delivery teams will not remove old furniture. Please have the room ready and prepared for your new furniture to arrive.Depending on your delivery location, long distance delivery will take an additional 2-4 weeks.Please note, your delivery location must be accessible by semi-trailer and be clear of snow. Also, please ensure that your order will fit through your doorways and stairways to avoid restocking fees. For any shipment delays, storage and\/or transfer fees may apply. Our delivery teams are unable to deliver via ferries. Customer will be responsible for coordinating with ferry transportation and fees associated. Please contact us for more details regarding ferry transportation.Apartment\/Condo Deliveries: Please contact us directly if your building needs a Certificate of Insurance (COI) and\/or proof of Workman's Comp. We will need an example of the COI to provide the necessary documentation. There is a $100 fee for processing fees for each piece of documentation. Please contact us if you have questions regarding a COI\/Workman's Comp for your building.Furniture InspectionWe work only with experienced drivers and ensure our Amish Furniture is heavily wrapped during the shipping and delivery process. We also carefully inspect each item prior to delivery. It is your responsibility to inspect the furniture upon delivery and report any damage while the delivery is taking place. QW Furniture will not be held liable for any damage to personal property, not including the furniture being delivered, that is alleged to have occurred during the delivery process.Return RequestsGiven our furniture is custom-built, a 30% restocking fee applies for returns. Requests must be submitted within 7 days of receipt. Shipping charges are non-refundable and customers are responsible for return shipping costs. Certain items, such as gift cards, stains, and mattresses, cannot be returned.RefundsOnce your return is received and inspected, you will be notified of the approval or rejection of your refund. If approved, the refund will be processed to your original payment method within a certain number of days. For late or missing refunds, please contact us at sales@qualitywoods.com.Return ShippingTo return your product, ship your item to: 1231 Hwy 52 North, Rochester Minnesota 55901. Please note that return shipping costs are non-refundable and will be deducted from your refund.- Payment & Financing: We understand that investing in hand-crafted furniture is significant. We offer the flexibility of starting your order with a deposit of just 30% of the order value. When you start your order with a 30% deposit, the remaining balance is due when your furniture is out of production. The remaining balance may be automatically charged to the card information on file. To place an order with a 30% deposit, call us at 507-289-6866 or checkout online and select '30% Deposit' under Purchase Options when you add an item to cart. Some products that ship within 8 weeks do not qualify for our deposit payment program.- Build Times: Once your purchase is finalized with QW Furniture, your order goes directly into production. See individual product pages for detailed estimates of build times. Our posted build times are estimates and are not guaranteed. Remember, our furniture is handcrafted and must pass rigorous quality checks. Build time delays do not permit cancellation. Note that our build time may be extended over holidays due to our craftsmen and women taking time to be with their families.- Order Changes: You can make changes to your order up to 48 hours from order placement without a fee. Changes after this time frame will incur a $100 change fee, plus any stoppage fees related to parts already ordered or cut, and hardware ordered.- Cancellations: You may cancel your order up to 48 hours after placing it for a full refund. Cancellation requests after 48 hours may not be accepted, and a 30% restocking fee may apply.- Shipping & Delivery: Please refer to our Shipping & Returns page for complete information.- Furniture Inspection: All of our furniture is securely wrapped in blankets during shipping and delivery. It is your responsibility to inspect your furniture upon delivery to ensure there is no damage.- Hand Crafted Furniture: Each piece of our furniture is handcrafted, with unique grain patterns and characteristics. No two pieces of furniture are exactly alike. We offer stain samples to visualize the finish in your home, understanding that finish colors will vary. For other product questions, please visit our FAQ Page or Contact Us.- Return Requests: Given our furniture is custom-built, a 30% restocking fee applies to all returns. We accept return requests within 7 days of receiving your furniture. Shipping charges are non-refundable and you will be responsible for return shipping charges. Certain items, such as gift cards, stain, and mattresses cannot be returned.- Refunds: Upon receiving and inspecting your returned item, we will notify you of the approval or rejection of your refund. If approved, a refund will be issued to your original payment method within a certain number of days.- Product Protection: We offer a comprehensive Furniture Protection Program in partnership with Guardsman. Learn more on our Guardsman Protection Plan page.- Warranty: All our products come with a one-year warranty covering manufacturing defects and workmanship errors. This warranty does not cover commercial use, normal wear and tear, or wood expansion and contraction caused by uncontrolled humidity conditions.For any further questions, feel free to reach us at 507-289-6866 or sales@qualitywoods.com","label":[[0,29,"PRODUCT"]],"Comments":[]}
{"id":1088,"text":"LightingA lamp is more than an aesthetic piece of design. The light you choose has a significant effect on the ambience and character of your room, and make a big difference in making it a functional and comfortable space.Creating the perfect light in a room is far from an easy task. Combine various light sources and use wall lamps, pendants, floor and table lamps to create layered lighting and make a functional light scape that adds beauty to overall design schemes. The perfect living room lighting provides an overall warming illumination while also adding a functional light for reading and a discreet soothing light for relaxation. Invite floor and table lamps into your décor for where extra light is needed and let pendants add sculptural expressions to your living room, hallway or dining room.Our collection of lamps range from sculptural eye-catching pendants, classic and timeless ceiling lamps, to playful wall lamps and table lamps with nostalgic expressions. We strive to create inviting and edifying lighting atmospheres that make you feel at home and at ease, wherever you are.Creating the perfect light in a room is far from an easy task. Combine various light sources and use wall lamps, pendants, floor and table lamps to create layered lighting and make a functional light scape that adds beauty to overall design schemes. The perfect living room lighting provides an overall warming illumination while also adding a functional light for reading and a discreet soothing light for relaxation. Invite floor and table lamps into your décor for where extra light is needed and let pendants add sculptural expressions to your living room, hallway or dining room.Our collection of lamps range from sculptural eye-catching pendants, classic and timeless ceiling lamps, to playful wall lamps and table lamps with nostalgic expressions. We strive to create inviting and edifying lighting atmospheres that make you feel at home and at ease, wherever you are.Read MoreRead LessSort by:-26.50 EUR-Reb Lamp Fixing Rings (5 pcs.)21.50 EUR-Reb Lamp 8 White590.00 EUR-Reb Lamp 5 White430.00 EUR-Act Lamp Ø80 EU White525.00 EUR-Yo Lamp Small115.00 EUR-Yo Lamp Large300.00 EUR-LED Bulb Globe 7W Ø125 - E27 EU Clear12.00 EUR-LED Bulb 8W Ø60 E27 EU White8.00 EUR-LED Bulb 6W Ø60 E27 EU White8.00 EUR-LED Bulb 3W - G9 EU White6.50 EUR-Porta Table Lamp Bright Red115.00 EUR-Porta Table Lamp Brown115.00 EUR-Porta Table Lamp Dark Green115.00 EUR-Amp Wall Lamp Glass Gold60.00 EUR-Amp Wall Lamp Glass Smoke60.00 EUR-Phantom Lamp EU Small White770.00 EUR-Illu Mirror 160 x 55 cm EU White1075.00 EUR-Illu Mirror 80 x 80 cm EU White805.00 EUR-Illu Mirror 65 x 50 cm EU White535.00 EUR-Cellu Floor Lamp EU Grey405.00 EUR-Cellu Floor Lamp EU Sand405.00 EUR-Cellu Floor Lamp EU White405.00 EUR-Cellu Table Lamp EU Light Green200.00 EUR-Cellu Table Lamp EU Light Blue200.00 EUR-Cellu Table Lamp EU Cream200.00 EUR-Cellu Table Lamp EU White200.00 EUR-Phantom Lamp EU Medium White1375.00 EUR-Tub Wall Lamp EU White310.00 EUR-Tub Wall Lamp EU Black310.00 EUR-Tub Lamp Ø44 EU White525.00 EUR-Tub Lamp Ø44 EU Black525.00 EUR-Tub Lamp Ø44 EU Aluminum525.00 EUR-Tub Lamp Ø30 EU White350.00 EUR-Tub Lamp Ø30 EU Aluminum350.00 EUR-Tub Lamp Ø13 EU White230.00 EUR","label":[[10,15,"PRODUCT"],[330,336,"PRODUCT"],[337,344,"PRODUCT"],[347,367,"PRODUCT"],[379,395,"PRODUCT"],[2020,2050,"PRODUCT"],[2062,2078,"PRODUCT"],[2091,2107,"PRODUCT"],[2120,2141,"PRODUCT"],[2154,2167,"PRODUCT"],[2180,2193,"PRODUCT"],[2206,2228,"PRODUCT"],[2255,2283,"PRODUCT"],[2294,2322,"PRODUCT"],[2333,2358,"PRODUCT"],[2369,2396,"PRODUCT"],[2409,2431,"PRODUCT"],[2444,2471,"PRODUCT"],[2484,2508,"PRODUCT"],[2520,2545,"PRODUCT"],[2557,2584,"PRODUCT"],[2597,2629,"PRODUCT"],[2643,2674,"PRODUCT"],[2687,2718,"PRODUCT"],[2731,2755,"PRODUCT"],[2768,2792,"PRODUCT"],[2805,2830,"PRODUCT"],[2843,2874,"PRODUCT"],[2887,2917,"PRODUCT"],[2930,2955,"PRODUCT"],[2968,2993,"PRODUCT"],[3006,3034,"PRODUCT"],[3048,3070,"PRODUCT"],[3083,3105,"PRODUCT"],[3118,3139,"PRODUCT"],[3152,3173,"PRODUCT"],[3186,3210,"PRODUCT"],[3223,3244,"PRODUCT"],[3257,3281,"PRODUCT"],[3294,3315,"PRODUCT"]],"Comments":[]}
{"id":1089,"text":"Canadian Modern Lounge Chairs - 1519This piece ships free in the continental United States! Price includes FREE white glove shipping. *There may be an additional charge on pieces shipped to the West Coast* Contact us for designer\/trade pricing. Canadian Modern Lounge Chairs - 1519 These Canadian modern lounge chairs for Craft Associates® Furniture are expertly crafted and upholstered. Each chair boasts...This piece ships free in the continental United States! Price includes FREE white glove shipping. *There may be an additional charge on pieces shipped to the West Coast* Contact us for designer\/trade pricing.Canadian Modern Lounge Chairs - 1519These Canadian modern lounge chairs for Craft Associates® Furniture are expertly crafted and upholstered. Each chair boasts hand cut foam and high grade commercial fabric. The chair's frame and base are constructed by hand from premium walnut and not machine. The legs are then hand turned by artisans and finished with a hand applied oil.Craft Associates® Furniture is proud each piece is made in the US. We strive to craft a product that will stand the test of time. We use the best materials and have the best craftsman and upholstery in the business. We stand 100% behind our product.\"I haven't changed my mind about modernism from the first day I ever did it... it means integrity; it means honesty; it means the absence of sentimentality and the absence of nostalgia; it means simplicity; it means clarity. That's what modernism means to me.\" - Paul Randdesigner: Vintage Catalogue (Craft Associates, Inc.)Manufacturer: Craft Associates® Modern FurniturePeriod\/Model: Mid Century ModernSpecs: Walnut, Hardwood Frame, Plush VelvetYardage: 5 Yards, 4.75 Meters**Please note, if the fabric has a repeating pattern, extra fabric is required**dimensionsChairH: 27.5 (69.85cm)W: 32 (81.28cm)D: 32 (81.28cm)Arm Height: 21.5 (54.61cm)Seat Height: 15 (38.1cm)Seat Width: 24 (60.96cm)Seat Depth: 21.5 (54.61cm)pricingPricing to trade: YesInternational Shipping: Yes (please leave your address and phone number)representationWe are very proud to have partnered with theSwankyAbode.com and Carter, Inc. to bring these products to market.**photography compliments of addisonjonesphotography.com**","label":[[0,29,"PRODUCT"],[262,282,"PRODUCT"],[305,319,"PRODUCT"],[619,655,"PRODUCT"],[1820,1825,"PRODUCT"]],"Comments":[]}
{"id":1095,"text":"This console is perfect for the avid record collector. A sleek design with clean lines. Made with solid Walnut. The top cubbies are 7” high and the bottom cubbies are 14” with sliding doors.• 48 W x 27.5 H x 16 D• 60 W x 27.5 H x 16 D• 72 W x 27.5 H x 16 D• 84 W x 27.5 H x 16 D• Sliding Mixed Panel Doors• Materials: Solid WalnutPlease be sure to carefully read our Policies before submitting your order.Success! Feel free to continue shopping or head to your cart .","label":[[282,307,"PRODUCT"]],"Comments":[]}
{"id":1096,"text":"The Bayswater ArmchairUltimate comfort in a compact size, the Bayswater’s enduring appeal is testament to the wonderful design that has been popular for drawing rooms to cottages for nearly 150 years. Soft yet supportive, this is a chair for every occasion.Height: 90cmWidth: 76cmDepth: 102cmSeat height: 50cmSeat depth: 58cmSeat width: 46cmSeat back height: 47cmAmount of plain fabric required: 8mThe price excludes fabric. For patterned fabric meterage and custom sizes, contact us for advise on quantities and lead times.Leg design: Tapered oak leg front, curved leg backExtra charges:Skirt: From £200 + VATPiping or other finishing details: From £100 + VATPrice of model shown is inclusive of VAT.We build our armchairs up from a hardwood beech frame, using traditional methods and materials. With hand-tied coil-sprung seat, arms and back.Where cushions are used, what makes them so comfortable is the high down content (50% down, 50% feather in seat, and 70% down, 30% feather in back). The down gives the cushions lovely softness, while the feathers provide loft and spring.Where castors are used, they have been individually hand-cast by traditional English metal crafters to a very high standard, and a variety of finishes can be achieved. We use the antique brass finish as standard.Where legs are used, they can be either tapered or turned and come in a variety of woods and finishes (see 'Leg Options' tab for more details). We use medium oak as standard.All of our furniture can be made completely bespoke. We want this to be your perfect armchair, so if you want it a bit bigger or smaller, softer or firmer, or anything else just ask we will do our best to accommodate.The price excludes fabric. If you need some help finding the perfect fabric, let us know. Fabric quantities for standard models in plain fabric are shown in the product description. For patterns, and bespoke sizes, get in touch and we can advise on fabric quantity.","label":[[0,22,"PRODUCT"],[233,239,"PRODUCT"],[730,740,"PRODUCT"]],"Comments":[]}
{"id":1098,"text":"Fermob1900 BENCHSizeBrand1900 BENCH01-COTTON WHITE \/ L:106 W:53 H:90 \/ Fermob731 HIGH ST731 HIGH STARMADALE VIC 3143AustraliaA romantic love seat for two, with intricate heart shaped hand forged scrollwork on the seat back and arms and perforated decorative seat. Perfect for sharing a conversation with a friend or alongside an outdoor table, the 1900 bench is a delightful pretty addition to your outdoor space. Inspired by the famous romantic gardens in France, and made using hand-forged traditional techniques, this bench is both elegant and ultra-comfortable.Available in a stunning array of colours to compliment your own unique garden or terrace.Dimensions: L:106 W:53 H:90cm Wt:12.8KGTechnical Specifications:Steel rod frame and backrestPerforated steel sheet seatHand forged steel scrolls, armrests and ringsAnti - UV resistant powder coatingStackable for easy storageFoot pads to protect surfacesMade in FranceAccessories;Outdoor cushions 43cm - BasicsEnvironment: an environmentally friendly choice 98% of all iron is now recycled worldwide. Fermob is committed to manufacturing furniture that is fully recyclable and recycled. In addition, they use ecological paint that protects both the environment and your health. The powder paints used by Fermob contain no solvents and are applied in a zero-waste facility","label":[[0,17,"PRODUCT"]],"Comments":[]}
{"id":1100,"text":"CH24 Wishbone Chair - Beech - Soft coloursThe CH24 Soft from Carl Hansen is a gentle variation on Hans J. Wegner’s Wishbone Chair from 1950.Just like the original, the special edition is timelessly elegant with its clean and characteristic expression.The new finish has an inviting quality that tempts your hand to stroke the backrest, and Furthermore, the coating makes it easier to maintain the chair, keeping the timeless design looking even cleaner.Think of CH24 Soft as a gentle counterpart to a Wishbone Chair with a brighter finish. Or maybe as a subtle contrast to Hans J. Wegner’s CH327 dining table in soap-treated beech.Made to orders items are not returnable, unless faulty or damaged upon arrival - please see our returns page for more details","label":[[0,19,"PRODUCT"],[505,519,"PRODUCT"],[577,612,"PRODUCT"]],"Comments":[]}
{"id":1102,"text":"Milan Side TableThe Milan side table is manufactured in high-grade oak with a simple, natural, lacquered finish. This stylish, contemporary, light oak piece will be the perfect addition to any sitting room. A handy place to keep lamps, ornaments or place drinks and the shelf provides extra storage for books or magazines.Dimension 45cm w x 45cm d x 50cm h","label":[[0,16,"PRODUCT"],[21,37,"PRODUCT"]],"Comments":[]}
{"id":1103,"text":"Shopping for someone else but not sure what to give them? Give them the gift of choice with a The Banyan Tree Furniture gift card.Gift cards are delivered by email and contain instructions to redeem them at checkout. Our gift cards have no additional processing fees.The Banyan Tree requires a street address for all deliveries, unfortunately we do not deliver to PO boxes. Deliveries are ONLY door to door and not brought into the premise unless stated otherwise.Please note that rubbish removal, assembly, placement or unpacking of goods are not included in your shipping quote unless stated otherwise.PLEASE NOTE THIS IS FOR FULL PRICE ITEMS ONLY.For sale items, we will contact you directly and provide a quote at competitive prices, however this only applies to metro areas within Australia. We want to ensure your goods arrive safely and with the least chance of damage, so in most cases we will use specialised furniture couriers which may come at a higher price.If for any reason you cannot be present to accept delivery or if you wish for goods to be left in a safe place unattended, you must clearly make note of this when placing your order. Note: Authority to leave goods unattended will void all transit insurance claims. The Banyan Tree is not liable for theft, damages or loss resulting from your goods being left unattended.*In the occurrence of a faulty item please report it to us within 48 hours of receiving the item.Pick up from our Camberwell Showroom is always an option, and it’s free! Customer pickups on large pieces are done so at the bearer's responsibility and damage claims will not be accepted.Lead times can vary depending on the item, from as little as 1 week or as long as 16 weeks depending on manufacturing and shipping times. An order confirmation will be sent to your email immediately after you place your order, and you will be further advised within 2-5 business days on an estimated time of arrival for your item(s).We will strive to deliver your items within the specified timeframe, however please note that lead times are an estimate only and they may change due to circumstances beyond our control.We hope you love your Banyan Tree purchase, however, we understand if you change your mind when it arrives or if the piece doesn't quite fit as you hoped!If you are unhappy with the product you have purchased (exclusions apply) you may return the item(s) and are entitled to a full refund, minus shipping, handling charges, and insurance costs, from and to The Banyan Tree, within 14 days.Please note: a restocking fee of 30% will be applicable on change of mind returns for bulky items. This amount will cover the reasonable costs of ordering stock in for you, as ordered items unfortunately cannot be returned to the manufacturer.Returned items must be in their original packaging and condition, with all hardware, fixtures and accessories, and must not be used or altered in any way.Unfortunately, there is no refund, exchange, or cancellation available on custom, made to order and special order items.All return requests must be raised within 14 days of the date you received your order, please check the exclusions list to see if your item is eligible, and then see the below articles for the returns process for change of mind, or faulty\/damaged returns.Return postage will be at the buyers expense unless stated otherwise.In the occurrence of a faulty item please report it to us within 48 hours of receiving your order. We will always endeavour to offer a replacement however in the rare occasion that we are unable to supply a replacement, a store credit (in some cases a refund) will be issued.Sale items (if applicable): Unfortunately sale items cannot be returned, exchanged or refunded.Subscribe to our newsletter and get 10% off your first purchase! Stay updated with the latest products and exclusive deals. Don’t miss out on this fantastic opportunity to save!*Exclusions apply.","label":[[94,129,"PRODUCT"]],"Comments":[]}
{"id":1104,"text":"Enjoy Free Shipping on Rugs Across CanadaEnjoy FREE Shipping on Rugs and Lighting Across CanadaThe Glen oversized round mirror is made of metal with a raw iron finish.To confirm stock availability or to ask questions about this product please contact us.This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply.","label":[[97,128,"PRODUCT"]],"Comments":[]}
{"id":1105,"text":"PonyPony is a friendly and characterful addition to any room, but as always, it was designed first and foremost to provide a comfortable seat. Pony has a moulded foam body, feet and ears which are all connected by a tube frame and upholstered in a stretch fabric. Pony chair was designed in 1973 by Eero Aarnio.We are happy to provide you fabric samples to help you decide the perfect colour for your Pony. You can find our contact information here.Choose optionsPonySale price2.550€","label":[[0,4,"PRODUCT"],[5,9,"PRODUCT"],[264,276,"PRODUCT"],[467,471,"PRODUCT"]],"Comments":[]}
{"id":1106,"text":"SORENSEN TEAK BENCH | 100CMAlso available inOur signature solid teak bench is exclusive to Living by Design in Australia, as featured on the front cover of Country Style Magazine and in House and Garden editorials. A perfect blend of modern country, meets simple nordic functionality. The clean solid lines complement the organic natural curve of the seat, ensuring no two are the same.The hardwood teak is very lightly oiled and sustainably sourced. While the wood is of superior quality, teak naturally allows for knots or slight discolouration. Our design partners hand cut and re-fill knots in the bench top according to Living by Design's specifications. Each of our teak tops vary in this process, and we do not consider these variations to be faults.An ideal bench for the narrow hallway, simple nook, or end of bed. Our extensive size range will ensure a perfect size is available. Our exclusive Sorensen Teak bench with its slender silhouette, is the ideal addition to large or small spaces... indoor or outdoor.Material: Solid TeakWarranty: 2 years structural - for more details refer \"WARRANTY\" page belowProducts Available: 3 x sizes; 100cm + 120cm + 150cm + package price for all 3 benchesIndoor\/Outdoor: Recommended indoor lightly oiled, for outdoor natural greying would occurExtra Care Recommendations: Product has been lightly oiled, for extra sealing we recommend Cabot's Cabothane Clear Water BasedInterstate Delivery: Yes, delivered assembledDelivery Schedule: 3-7 business days dispatchWarranty: Refer to the 'WARRANTY POLICY' page on our websiteThere are three sizes available in the Sorensen teak bench - approximate sizes are :length | 100cm | 120cm | 150cmdepth | 37cmheight | 46cmFurniture shipping:For further details view our shipping policy hereDelivery times:In-stock items will be dispatched within 3-7 business days from order via one of our third-party freight partners, tracking details will be supplied where applicable. Please note, we are unable to hold any orders in our warehouse. If your order includes pre order items, your order will be dispatched altogether when the final item is in stock.Delivery details:Customers are not able to request a specific delivery date, our freight partners will advise when the items are scheduled to be delivered. Fragile, medium and large items will be delivered to the front door ground-floor or front-door location only. In some instances goods will arrive on a pallet to ensure they arrive in optimum condition. It is the customer’s responsibility to dispose of all packing materials, including pallets.It is the customer's responsibility to move delivered items from the ground-floor or front-door location into an appropriate location. Prior to placing your order please ensure adequate external + internal access [ doorways, staircases, gateways, lifts] is available for the arrival of your furniture.Freight charges:To check freight charges for your location before placing an order, use the Estimate Shipping tool on the individual product pages or at checkout for a total quote. Depending on the item\/s and the delivery location, in some circumstances an unexpected freight charge may be incurred in which our customer experience team will make contact.Furniture returns + damages:For further details view our return policy hereBefore the item has been dispatched:If you cancel your order before it’s been dispatched, we offer a refund to the same value as the purchase price. Please email our Customer Experience Team on info@livingbydesign.net.au as soon as possible to cancel your order.After the item has been dispatched:Please choose carefully as refunds are not provided where you have simply changed your mind or made a wrong selection. We recommend you carefully preview any orders before adding them to your shopping cart and proceeding with your order. Clearance + Bundled products are not able to be returned or exchanged.Colours shown on the website are indicative only. Please ensure you review the item’s details online and if you require a swatch\/sample, contact us - we do carry samples of most fabrics in our range. Timber is a natural product with variations from product to product, please refer to each listing for more information.Please contact our Customer Experience Team on info@livingbydesign.net.au if you feel there is a fault with the good\/s that you have received, within 5 days of receiving your order. Our Customer Experience Team will arrange a replacement or alternative solution.Estimate ShippingTo check freight charges for your location before ordering this item, enter your postcode below.","label":[[0,19,"PRODUCT"],[60,76,"PRODUCT"],[770,775,"PRODUCT"]],"Comments":[]}
{"id":1108,"text":"Plume WallpaperThe Plume Wallpaper has an ageless and everlasting design in its fun neutral print. Comes in different subtle colors to best fit your home. Whether on an accent wall in the powder bath or covering an entire great room, this wallpaper is noteworthy.- 20.5\"W- 11 Yard Roll- Sold Per Single Roll- Will Cover 56.38 Sq. Ft.- 100% Paper","label":[[0,15,"PRODUCT"],[20,35,"PRODUCT"]],"Comments":[]}
{"id":1110,"text":"Dimensions: 42 in. W x 22 in. D x 35 in. HProduct Spec Sheet: Click HereAssembly Guide: Click HereElevate your bathroom's elegance with the stunning Tennant Brand Beatrice Series tailored exclusively for modern, sophisticated homeowners where style and functionality merge to create a masterpiece that exceeds expectations. This single sink vanity showcases a perfect blend of style, functionality, and versatility, becoming the focal point of your bathroom oasis. Its transitional design, infused with clean lines and a timeless Navy Blue finish, complements any décor seamlessly.Crafted from the finest select birch wood and built with solid, high-end furniture-grade construction, this vanity is not only stylish but also incredibly durable. The Beatrice comes with a stunning White Quartz countertop that will add a touch of sophistication to your bathroom.With soft-close doors and high-quality construction using 100% solid wood and plywood, the Beatrice offers a smooth and quiet operation, making it a pleasure to use. The white ceramic sink is packaged separately for easy installation, and the pre-cut back panel opening allows for easy plumbing access.This modern contemporary style bathroom vanity features an eye-catching Navy Blue finish that will make your bathroom stand out. The Beatrice is not just stylish, but also practical, offering ample storage space for your bathroom essentials. Here are some more features that make the Beatrice stand out:Product Features:- Effortless Assembly: Partial assembly required with sink & metal base installation; free-standing configuration for easy placement.- High-quality Materials: Constructed from solid wood, CARB Ph2 certified panels, and birch veneer for durability and longevity.- Elegant White Quartz Countertop: 28mm thick, refined countertop offers ample space for bathroom essentials and pairs perfectly with an 8-inches widespread 3 holes faucet set (not included).- Optional 3.5\" backsplash: Add even more elegance and style to your bathroom with the optional 3.5\" backsplash, which is available for an additional cost.- Spacious Storage: Features 2 drawers and 1 side compartment for ample storage; soft-closing doors with pre-cut openings ensure easy plumbing access.- Smooth Functionality: 2 solid rubberwood drawers with natural color finishes and full-extension metal sliders for effortless opening.- Striking Accents: Trendy brushed gold finish door\/drawer pulls and cabinet base enhance the vanity's visual appeal.- Top-quality Ceramic Sink: White rectangle ceramic under-mounted sink with overflow (16.7 x 11.6\" opening measurement) for a sleek, modern look.- Comprehensive Package: Includes base cabinet, countertop, sinks, and hardware for a hassle-free setup- Faucet Compatibility: Designed for use with an 8-inches widespread 3 holes faucet set.Tennant Brand productResidential Curbside delivery only","label":[[152,181,"PRODUCT"],[749,761,"PRODUCT"],[784,807,"PRODUCT"],[871,887,"PRODUCT"],[953,965,"PRODUCT"],[1298,1310,"PRODUCT"],[2521,2533,"PRODUCT"]],"Comments":[]}
{"id":1111,"text":"Gift CardGift Card- Delivery across the US- Secure paymentsShopping for someone else but not sure what to give them? Give them the gift of choice with a Oak For Less® Furniture gift card.Gift cards are delivered by email and contain instructions to redeem them at checkout. Our gift cards have no additional processing fees.How quickly will I get my order? (production or lead time)At Oak For Less® furniture, we offer furniture from many different builders. Some are right here in Phoenix, AZ, while others are in California, or the midwest like Illinois or Indiana. Many of our domestic items are made-to-order and are built when the order is placed, so their production time is a little longer than others. We also offer a selection of items that are imported, so they often have quicker production times since those items are already made.Since lead times can vary, we give an estimated range. These lead times are APPROXIMATE, they are NOT EXACT. Items may arrive early or unexpected delays can occur with builders and\/or shippers. These situations are beyond our control. By placing an order, the customer agrees that they understand the production time is our best estimate. When the order is ready for In-Store Pick Up or Local Delivery, you will receive a call to schedule it.Current estimated lead time is per builder item # prefix.For example, item FD-3051T has an \"FD-\" at the beginning of its item #. On our list below, FD- items have a lead time of 10 - 14 weeks. So item FD-3051T has a lead time of 10 - 14 weeks. Please remember this is an ESTIMATE and many factors can affect it.If your delivery location is outside of Arizona please add at least 2 weeks extra to these estimates to allow for the shipper's scheduling and routing delivery arrangements. Also, if the delivery location is in a remote location or an area not easily reached by the delivery service, it may take an extended delivery time.| Prefix: | Approximate lead time: || FA \/ FUS | * Call for current production time * || FD | 10 - 14 weeks || HM | contact us for stock availability || IFD | contact us for stock availability || OD | 6 - 8 weeks || SA | 12 - 16 weeks || SD | contact us for stock availability || TM | 8 - 12 weeks |If you don't see the prefix of your item # here, please call us at 480-962-9930 to ask about the current production time.Need to expedite your order?We're here to help. Call 480-962-9930 and we'll let you know if it is possible to get your order sooner. A few builders offer expediting for an extra charge.Good news! We now offer nation-wide delivery for most products (we have shipped all over the U.S. We do not currently have a shipper to do Alaska nor Hawaii, and do not have international shipping (sorry!). We work with different shippers and they each have their own designated delivery areas of the U.S. - some areas may not be available, so please contact us to inquire about delivery to your area.The shopping cart will automatically calculate the type of delivery depending on the item(s) and delivery location. Or, if you would like a delivery quote, please email us at info@oakforless.com or call our store at phone number 480-962-9930 and include the items that you are interested in as well as the delivery city, state, and zip code and we will get you a delivery quote.Delivery services are made by experienced independent contractors. Delivery is available if the customer is located within designated delivery areas. Delivery contractors do their best to be careful when delivering furniture, but in the event damage occurs to walls, flooring, etc., the customer will take up any issues solely with the independent contractor.Customers must have the room ready for the delivery when it is scheduled. Delivery does NOT include moving old furniture or electronic devices such as TVs or audio\/video components. If you ask them to do extra work, they will charge extra.With any delivery method, the customer is responsible for making sure that the items will fit through their hallways and into the room of choice. If the driver cannot easily deliver it to the room of choice (narrow hallways\/tight turns\/low ceilings\/is asked to move other furniture) there will be additional cost that must be paid to the delivery service at the time of the delivery. Regardless if the furniture fits into the room of choice or does not, the customer is still responsible for paying the delivery fee, it is not refundable.If the delivery location is in a remote location or an area not easily reached by the delivery service, it may take an extended delivery time.Blanket Wrap delivery (states outside of Arizona):Blanket Wrap delivery starts at $395 and goes up depending on the item(s) and delivery area. To be sure of the delivery cost for your area, please contact our store and ask for a precise delivery quote. Different blanket wrap delivery services serve different areas, so this delivery includes bringing the item(s) inside and either putting them in the first dry area (threshold delivery) or depending on the shipper for your area into the room of choice (1st floor only) - it depends on the service for your area.If your delivery requires stairs or steps or an elevator, we need to know in advance at the time of order because some shippers will not do stairs. Stairs or elevators may require an additional charge, it all depends upon which shipper it is.If you order a platform bed, Blanket Wrap delivery includes putting it in the room of choice, first floor, and also includes up to 30 minutes of assembling the platform bed.If you order a table, Blanket Wrap delivery includes putting it in the room of choice, first floor, but it does not include assembly of the table. If you require table assembly, please contact us at the time of order because some shippers will not do assembly. This may require an additional charge, depending on the shipper.Please note that Blanket Wrap delivery does NOT include attaching or reversing hardware or installing and arranging adjustable shelves inside of a bookcase or cabinet as this can be time consuming. It also does NOT include attaching a headboard to a customer's existing bedframe as the hole locations that need to be drilled into the headboard can vary depending on the existing bedframe.Blanket Wrap delivery outside of Arizona is a one or two person delivery. An adult must be at the residence to sign for and accept the item(s) in good condition.Basic delivery (within Arizona only):Basic delivery covers areas within Arizona only. Basic delivery within Arizona starts at $95 and goes up depending on the item(s), if set up is needed, and the delivery area. Basic delivery includes the following: Placement inside the home - first floor, no stairs. This is usually a one-person delivery - the customer may be asked to assist the driver. This delivery does not include unpacking, debris removal, assembly, nor set up. For delivery upstairs or downstairs or if you need set-up, please contact our store at phone number 480-962-9930 to ask for those delivery\/set-up costs. An adult must be at the residence to sign for and accept the item(s) in good condition.","label":[[0,9,"PRODUCT"],[157,190,"PRODUCT"],[283,293,"PRODUCT"]],"Comments":[]}
{"id":1112,"text":"The Windsor headboard and footboard are constructed with mortise and tenon joinery. Disassembles for shipping.Dimensions:Headboard Height: 36-3\/4\"H (from floor to top of headboard)Clearance: 8-3\/8\"HMattress will sit at a height of 12-3\/4\" off the floorSlat size: 3\" tall x 3\/4\" thickSpace between slats: 3\"Twin: 42\"W x 80\"LFull: 57\"W x 80\"LQueen: 63\"W x 85\"LKing: 79\"W x 85\"LCal King: 75\"W x 89\"L","label":[[0,21,"PRODUCT"],[26,35,"PRODUCT"]],"Comments":[]}
{"id":1114,"text":"MooMoo is a full scale wall–mounted Norwegian moose head light. Moo may be used for both indoor and outdoor decoration. The figuratively shaped lamp body is made of poly–resin material, that gives a smooth and transparent flow of light. The bulbs placed inside the horns add extra elements of soft, sparkling and translucent light effects to the lamp.The inspiration behind the Moo lamp was found in northern Norway, –in the breathtaking scenery of Hamarøy, where both designers have summer houses. Here the moose is frequently seen passing close to the houses and even on the lawns. The designers hope Moo will stand out as a post–modern kitch trophy, making the viewer smile happily as they recognize this “King of the Norwegian forest”.-Wall lamp-Shade material: Polyresin and glass fibre-Shade colour: White-Base material: Steel-Wire: White, 190 cm-Bulbs main body: 2 x E27 energy saving bulb. Max. 20 W-Bulbs horns: 2 x E14 energy saving bulb. Max. 7 W-220V - 240V ~ 50Hz-Net weight: 11.4 kg-Indoor and outdoor (IP 44)-CE","label":[[0,3,"PRODUCT"],[4,7,"PRODUCT"],[37,63,"PRODUCT"],[145,149,"PRODUCT"],[380,388,"PRODUCT"],[605,608,"PRODUCT"],[744,753,"PRODUCT"]],"Comments":[]}
{"id":1115,"text":"Sorry, we no longer sell this productDue to popular demand 'Forna Plant Stand Small' is no longer available.But fear not; a range of other great items are still available including these below:You might also likeJoin The VIP ClubBecome an insider to be the first to hear about the latest news, offers and early access product releases.Read our privacy policy here.","label":[[61,84,"PRODUCT"]],"Comments":[]}
{"id":1116,"text":"The Spensley is a part of our original range and designed to suit any lifestyle.Buy as a full set or mix and match with the Fenwick and Tanner to fit any space and style.Product SpecificationsProduct DetailsShipping DetailsSolid Wood100% Genuine LeatherH860mm x W500mm x D520mmGround to seat 470mmStretched cowhide leatherBrass stud rear detailingPlease note that as our leather is cow skin and a completely natural product that blemishes, markings and imperfections may be present within each piece of leather, which in our humble opinion adds to the beauty of the product.As our leather is batch-dyed by hand, the colour and texture of every piece is unique and unrepeatable and may vary slightly from chair to chair.Sustainable sourcing is important to us to ensure the proper management and protection of forests, as well as the indigenous flora and fauna for generations to come.Delivery availability will be listed above the add to cart button. We try our best to insure that these time framesare as accurate as possible at all times however if you need this item by a specific date pleaseget in touch.","label":[[0,12,"PRODUCT"]],"Comments":[]}
{"id":1118,"text":"Scandinavian Lamp Table TWS889LT-000-TA-LPSave 66%Original Price$499.00Current Price$169.00Scandinavian Teak Lamp Table TWS889LT-000-TA-LPFeatures:- light pecan color- Hand-crafted by highly skilled and seasoned craftsmen- Kiln-dried solid timberDimensions:- Overall: 40cm H x 40cm W x 40cm D- Overall Product Weight: 7 Kilogram","label":[[0,23,"PRODUCT"],[97,125,"PRODUCT"]],"Comments":[]}
{"id":1119,"text":"Sweden Teak Side Coffee Table 60 x 60 cmSave 67%Original price$899.00Current price$299.00Sweden Teak Side Coffee Table 60 x 60 cmProduct Code:TFS668 LT-60-60-TAName:Sweden Side TableSize:60W 60D 50HDescription:Handcrafted by highly skilled and seasoned carpenter craftsmen, our solid wood timber products spec base on SVLK certificate, this is to ensure it was obtained and sourced from environmentally friendly and sustainable plantations farm and using processing technique in compliance with government regulations and rules","label":[[0,29,"PRODUCT"],[95,124,"PRODUCT"],[175,192,"PRODUCT"]],"Comments":[]}
{"id":1120,"text":"Bali Teak Furniture CollectionScandinavian Bali Teak Bench ATF388Scandinavian Bali Teak Bench ATF388Regular price$249.00 SGDRegular price$599.00 SGDSale price$249.00 SGDUnit price\/perBali Teak Bench ATF388Features:- Solid wood timber- Lasting and fashionable- Handmade by craftman- Available in Mahogany or Chocolate or White or White Wash or Light Pecan ColorDimensions:45cm H x 90cm W x 35cm D","label":[[0,30,"PRODUCT"],[31,59,"PRODUCT"],[67,95,"PRODUCT"],[195,210,"PRODUCT"]],"Comments":[]}
{"id":1122,"text":"Product Code:BE-150-35-TAName:Amsterdam Bench 150 x 35Size:150 W 35D 45HDescription:Handcrafted by highly skilled and seasoned craftsmen, our timber products are SVLK certified, ensuring that it was sourced from environmentally sustainable plantations and processed in compliance with government regulations.","label":[[33,48,"PRODUCT"]],"Comments":[]}
{"id":1123,"text":"MP - Amsterdam 2 Drawer Bedside Table TEK168 BS 002 TA Side TableSave 56%Original price$809.00Current price$359.00Amsterdam 2 Drawer Bedside Table TEK168BS 002 TA55x40x60( lamp stand side table \/ night stand)Measurements60cm H x 55cm W x 40cm DWeight: 16 KilogramFlash Sale Item cannot applied to the Discount Gift Voucher. Sold As It Is. New Item. Cannot apply voucher","label":[[120,152,"PRODUCT"]],"Comments":[]}
{"id":1124,"text":"When it comes to choosing the most perfect dining set for sale in the Philippines, look no further than MODLiving Furnishing. We have a wide range of furniture pieces which carries the creativity and ingenuity of every Filipino in the country. We take pride in providing top-quality products that is both unique and functional in their own nature.Over the last five years, we make it our mission to help every home and business owner to meet all their demands when it comes to finding the most perfect chairs and tables for their dining area. Our company is committed in creating high-quality and contemporary dining furniture that allows you to live comfortably.If you want to know more about what we can offer to you, feel free to browse through our website. You may also contact us through email or via phone if you have any inquiries about our products.","label":[[43,53,"PRODUCT"]],"Comments":[]}
{"id":1125,"text":"The Upton MattressIN STOCK- 10\" memory foam mattress that adapts to your body and reduces motion transfer- Gel infused to provide a cooling effect and regulate temperature- Choose your firmness level for ultimate comfort and support- Compressed and roll packaged in a box- Composition:- 2\" high viscosity 4 lbs gel memory foam mattress- 8\" quality foam base for exceptional comfort- Bamboo fabric cover with enhanced features- Stretch knit fabric with heavy decking for ensured durability10 Year Limited Manufacturer's Warranty IncludedWe leverage a carefully selected network of delivery partners, including our dedicated in-house local delivery team, to efficiently serve our valued customers from coast to coast. All orders are delivered within 1-2 weeks of receipt or completion (for made-to-order items).Shipping- We offer free standard delivery within our local area*. Delivery charges may apply at checkout (before purchase) to orders outside this zone.- You will be notified via email prior to delivery to coordinate a date or will be provided tracking information (depending on the item and delivery area).- The option to upgrade to white glove delivery is available at checkout.Returns- In order to qualify for a return, contact us within 30 days of delivery. The item(s) must be unused, unassembled, in original condition and all contents packaged back into the original packaging.- Return shipping charges may apply to orders outside of our local area*.- All made to order items, custom items, display items, open box items, pillows, duvets, bedding and mattresses are non-refundable and are final sale.*Local area includes the Greater Toronto Area and surroundings (all “M” and most “L”, “N” & \"K\" postal codes).Manufacturer's Limited WarrantyThis Limited Warranty applies to physical goods, and only for physical goods, purchased from Candace & Basil.A 365 day manufacturer's warranty applies to all products unless otherwise specified. The term begins from the date of delivery.What does this limited warranty cover?This limited warranty covers any defects in material or workmanship under normal use during the Warranty Period.During the Warranty Period, Candace & Basil will repair or replace, at no charge, products or parts of a product that proves defective because of improper material or workmanship, under normal residential use and maintenance. Items that arrive visibly damaged or defective, must be reported prior to use and\/or assembly within 3 days of receipt.A replacement Physical Good or part assumes the remaining warranty of the original Physical Good.What will we do to correct problems?Candace & Basil will either repair the product at no charge, ship new replacement parts, or replace the entire unit at our discretion.What does the limited warranty not cover?The Limited Warranty does not cover any problem that is caused by:- conditions, malfunctions or damage not resulting from defects in material or workmanship (ie. irregular use, wear and tear or accidental damage)What do you have to do?To obtain warranty service, you must first contact us to determine the problem and the most appropriate solution for you.Service areasWarranty claims must be associated with the original address on file at the time of order. In the case of a move please check with us to ensure coverage eligibility for the new address. Although we service and ship to most of Canada, some remote regions are outside of our reach and excluded from our shipping and service regions.","label":[[0,18,"PRODUCT"]],"Comments":[]}
{"id":1126,"text":"Skip to contentPause slideshowPlay slideshow48 HOUR DISPATCH AUSTRALIA WIDE30 DAY RETURNSicon-XClose menuBest SellersFurnitureThe Cloud SofaView All3 Seater Sofa2 Seater SofaSingle Seater SofaOttomanSlipcoversBedheadsView AllKing Single BedheadsDouble BedheadsQueen BedheadsKing BedheadsSlipcoversBenches & OttomansView AllBenchesOttomansChairsView AllAccent ChairsCounter StoolsDining ChairsRecliner ChairsRocking ChairsTables & StorageView AllBedside TablesCoffee TablesDining TablesShelvesSide TablesSideboardsHomewaresView AllMirrorsCushion CoversLightingView AllTable LampsFloor LampsSwatchesTradeTrade LoginBecome a Trade MemberFAQs08 7084 18489.30am - 3.30pm (AEDT) Monday to FridayLog ininstagramInstagramFacebookPinterestTikTokCarticon-XClose cartOrder noteYour cart is currently empty.08 7084 18489.30am - 3.30pm (AEDT) Monday to FridayinstagramInstagramFacebookPinterestTikTokicon-hamburgerSite navigation0accountLog inCartSearchSearchicon-searchClose (esc)icon-chevronBlack Mango Gift CardAmountAmount$50.00$75.00$100.00$150.00$200.00$250.00$300.00$400.00$500.00$750.00$1000.00Add to cart$50.00 - $50.00 AUD$75.00 - $75.00 AUD$100.00 - $100.00 AUD$150.00 - $150.00 AUD$200.00 - $200.00 AUD$250.00 - $250.00 AUD$300.00 - $300.00 AUD$400.00 - $400.00 AUD$500.00 - $500.00 AUD$750.00 - $750.00 AUD$1000.00 - $1,000.00 AUDShareShare on FacebookPin itPin on Pinterest[{\"id\":31532783796333,\"title\":\"$50.00\",\"option1\":\"$50.00\",\"option2\":null,\"option3\":null,\"sku\":\"BMGC01\",\"requires_shipping\":false,\"taxable\":false,\"featured_image\":{\"id\":30548977221741,\"product_id\":4421814780013,\"position\":1,\"created_at\":\"2023-10-10T08:58:25+10:30\",\"updated_at\":\"2025-01-13T13:21:02+10:30\",\"alt\":\"$50.00 Black Mango Gift Card By Black Mango\",\"width\":900,\"height\":900,\"src\":\"\\\/\\\/www.blackmango.com.au\\\/cdn\\\/shop\\\/files\\\/50-00-black-mango-gift-card-bmgc01-black-mango-13768791851117.png?v=1736736662\",\"variant_ids\":[31532783796333]},\"available\":true,\"name\":\"Black Mango Gift Card - $50.00\",\"public_title\":\"$50.00\",\"options\":[\"$50.00\"],\"price\":5000,\"weight\":0,\"compare_at_price\":null,\"inventory_quantity\":-14,\"inventory_management\":null,\"inventory_policy\":\"deny\",\"barcode\":\"\",\"featured_media\":{\"alt\":\"$50.00 Black Mango Gift Card By Black Mango\",\"id\":22856482947181,\"position\":1,\"preview_image\":{\"aspect_ratio\":1.0,\"height\":900,\"width\":900,\"src\":\"\\\/\\\/www.blackmango.com.au\\\/cdn\\\/shop\\\/files\\\/50-00-black-mango-gift-card-bmgc01-black-mango-13768791851117.png?v=1736736662\"}},\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":31532783829101,\"title\":\"$75.00\",\"option1\":\"$75.00\",\"option2\":null,\"option3\":null,\"sku\":\"BMGC02\",\"requires_shipping\":false,\"taxable\":false,\"featured_image\":null,\"available\":true,\"name\":\"Black Mango Gift Card - $75.00\",\"public_title\":\"$75.00\",\"options\":[\"$75.00\"],\"price\":7500,\"weight\":0,\"compare_at_price\":null,\"inventory_quantity\":-2,\"inventory_management\":null,\"inventory_policy\":\"deny\",\"barcode\":null,\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":31532783861869,\"title\":\"$100.00\",\"option1\":\"$100.00\",\"option2\":null,\"option3\":null,\"sku\":\"BMGC03\",\"requires_shipping\":false,\"taxable\":false,\"featured_image\":null,\"available\":true,\"name\":\"Black Mango Gift Card - $100.00\",\"public_title\":\"$100.00\",\"options\":[\"$100.00\"],\"price\":10000,\"weight\":0,\"compare_at_price\":null,\"inventory_quantity\":-20,\"inventory_management\":null,\"inventory_policy\":\"deny\",\"barcode\":null,\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":40471535976557,\"title\":\"$150.00\",\"option1\":\"$150.00\",\"option2\":null,\"option3\":null,\"sku\":\"BMGC04\",\"requires_shipping\":false,\"taxable\":false,\"featured_image\":null,\"available\":true,\"name\":\"Black Mango Gift Card - $150.00\",\"public_title\":\"$150.00\",\"options\":[\"$150.00\"],\"price\":15000,\"weight\":0,\"compare_at_price\":null,\"inventory_quantity\":-2,\"inventory_management\":null,\"inventory_policy\":\"deny\",\"barcode\":\"\",\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":31532783894637,\"title\":\"$200.00\",\"option1\":\"$200.00\",\"option2\":null,\"option3\":null,\"sku\":\"BMGC05\",\"requires_shipping\":false,\"taxable\":false,\"featured_image\":null,\"available\":true,\"name\":\"Black Mango Gift Card - $200.00\",\"public_title\":\"$200.00\",\"options\":[\"$200.00\"],\"price\":20000,\"weight\":0,\"compare_at_price\":null,\"inventory_quantity\":-6,\"inventory_management\":null,\"inventory_policy\":\"deny\",\"barcode\":null,\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":31532783927405,\"title\":\"$250.00\",\"option1\":\"$250.00\",\"option2\":null,\"option3\":null,\"sku\":\"BMGC06\",\"requires_shipping\":false,\"taxable\":false,\"featured_image\":null,\"available\":true,\"name\":\"Black Mango Gift Card - $250.00\",\"public_title\":\"$250.00\",\"options\":[\"$250.00\"],\"price\":25000,\"weight\":0,\"compare_at_price\":null,\"inventory_quantity\":-8,\"inventory_management\":null,\"inventory_policy\":\"deny\",\"barcode\":null,\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":31532783960173,\"title\":\"$300.00\",\"option1\":\"$300.00\",\"option2\":null,\"option3\":null,\"sku\":\"BMGC07\",\"requires_shipping\":false,\"taxable\":false,\"featured_image\":null,\"available\":true,\"name\":\"Black Mango Gift Card - $300.00\",\"public_title\":\"$300.00\",\"options\":[\"$300.00\"],\"price\":30000,\"weight\":0,\"compare_at_price\":null,\"inventory_quantity\":-6,\"inventory_management\":null,\"inventory_policy\":\"deny\",\"barcode\":null,\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":40467213189229,\"title\":\"$400.00\",\"option1\":\"$400.00\",\"option2\":null,\"option3\":null,\"sku\":\"BMGC08\",\"requires_shipping\":false,\"taxable\":false,\"featured_image\":null,\"available\":true,\"name\":\"Black Mango Gift Card - $400.00\",\"public_title\":\"$400.00\",\"options\":[\"$400.00\"],\"price\":40000,\"weight\":0,\"compare_at_price\":null,\"inventory_quantity\":0,\"inventory_management\":null,\"inventory_policy\":\"deny\",\"barcode\":\"\",\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":40467213221997,\"title\":\"$500.00\",\"option1\":\"$500.00\",\"option2\":null,\"option3\":null,\"sku\":\"BMGC09\",\"requires_shipping\":false,\"taxable\":false,\"featured_image\":null,\"available\":true,\"name\":\"Black Mango Gift Card - $500.00\",\"public_title\":\"$500.00\",\"options\":[\"$500.00\"],\"price\":50000,\"weight\":0,\"compare_at_price\":null,\"inventory_quantity\":-3,\"inventory_management\":null,\"inventory_policy\":\"deny\",\"barcode\":\"\",\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":40467213254765,\"title\":\"$750.00\",\"option1\":\"$750.00\",\"option2\":null,\"option3\":null,\"sku\":\"BMGC10\",\"requires_shipping\":false,\"taxable\":false,\"featured_image\":null,\"available\":true,\"name\":\"Black Mango Gift Card - $750.00\",\"public_title\":\"$750.00\",\"options\":[\"$750.00\"],\"price\":75000,\"weight\":0,\"compare_at_price\":null,\"inventory_quantity\":0,\"inventory_management\":null,\"inventory_policy\":\"deny\",\"barcode\":\"\",\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}},{\"id\":40467281608813,\"title\":\"$1000.00\",\"option1\":\"$1000.00\",\"option2\":null,\"option3\":null,\"sku\":\"BMGC11\",\"requires_shipping\":false,\"taxable\":false,\"featured_image\":null,\"available\":true,\"name\":\"Black Mango Gift Card - $1000.00\",\"public_title\":\"$1000.00\",\"options\":[\"$1000.00\"],\"price\":100000,\"weight\":0,\"compare_at_price\":null,\"inventory_quantity\":0,\"inventory_management\":null,\"inventory_policy\":\"deny\",\"barcode\":\"\",\"requires_selling_plan\":false,\"selling_plan_allocations\":[],\"quantity_rule\":{\"min\":1,\"max\":null,\"increment\":1}}]Shopping for someone else but not sure what to get them? Why not a Black Mango Gift Card!Gift cards are delivered by email and contain instructions to redeem them at checkout. Our gift cards have no additional processing fees.icon-X\"Close (esc)\"icon-Xicon-chevronicon-XGift Card | Black MangoSPECIFICATIONSSKUBMGC01BMGC02BMGC03BMGC04BMGC05BMGC06BMGC07BMGC08BMGC09BMGC10BMGC11FULL WIDTHFULL DEPTHFULL HEIGHTWEIGHTSEAT CUSHION DIMENSIONSSEAT CUSHION FILLING\/PADDINGSEAT CUSHION REMOVABLEBACK CUSHION DIMENSIONSBACK CUSHION FILLING\/PADDINGOTHER MEASUREMENTSINSIDE STORAGEFILLING\/PADDINGFABRIC COLOURFABRIC COMPOSITIONFRAME COLOURFRAME MATERIALLEG COLOURLEG MATERIALSHADE COLOURSHADE MATERIALBASE COLOURBASE MATERIALWEIGHT\/SEATING CAPACITYVOLTAGEWATTAGEGLOBE TYPECORD LENGTHSWITCH LOCATIONASSEMBLYASSEMBLY INSTRUCTIONSWARRANTY12 MonthsSAA APPROVEDPLEASE NOTE","label":[[159,172,"PRODUCT"],[173,186,"PRODUCT"],[187,205,"PRODUCT"],[225,233,"PRODUCT"],[243,263,"PRODUCT"],[264,279,"PRODUCT"],[280,294,"PRODUCT"],[295,308,"PRODUCT"],[348,355,"PRODUCT"],[365,371,"PRODUCT"],[381,394,"PRODUCT"],[395,409,"PRODUCT"],[410,423,"PRODUCT"],[424,439,"PRODUCT"],[440,454,"PRODUCT"],[455,471,"PRODUCT"],[481,495,"PRODUCT"],[496,509,"PRODUCT"],[510,523,"PRODUCT"],[524,531,"PRODUCT"],[532,543,"PRODUCT"],[544,554,"PRODUCT"],[574,581,"PRODUCT"],[582,596,"PRODUCT"],[597,605,"PRODUCT"],[615,626,"PRODUCT"],[627,638,"PRODUCT"],[639,647,"PRODUCT"]],"Comments":[]}
{"id":1127,"text":"Two's Company Sunburst Antiqued Gold Wall MirrorTwo's Company Sunburst Antiqued Gold Wall MirrorTwo's Company Sunburst Antiqued Gold Wall MirrorTwo's Company | SKU: 2137DescriptionDescriptionSunburst Antiqued Gold Wall Mirror - Steel\/MDF\/GlassThis beautiful Sunburst Antiqued Gold Wall Mirror is a perfect depiction of the sun in that it has the power to transform a room by reflecting and multiplying light. This mirror is both functional and artistic.SpecificationSpecificationProduct Dimensions: 39 3\/4\" DiaMaterial: MetalPlease Note: Plain Box\/ Dimensional WeightSKU: 2137Brand: Two's CompanyAdditional Information:Material: Glass, Mdf, Metal, SteelColor: GoldStyle: Contemporary, ModernType: Wall Mirrors, Decorative MirrorsShape: SunburstHanging Orientation: Dual OrientationReturns & ExchangesReturns & ExchangesCustomer ReviewsCustomer ReviewsQuestion & AnswerQuestion & AnswerDescriptionDescriptionSunburst Antiqued Gold Wall Mirror - Steel\/MDF\/GlassThis beautiful Sunburst Antiqued Gold Wall Mirror is a perfect depiction of the sun in that it has the power to transform a room by reflecting and multiplying light. This mirror is both functional and artistic.SpecificationSpecificationProduct Dimensions: 39 3\/4\" DiaMaterial: MetalPlease Note: Plain Box\/ Dimensional WeightSKU: 2137Brand: Two's CompanyAdditional Information:Material: Glass, Mdf, Metal, SteelColor: GoldStyle: Contemporary, ModernType: Wall Mirrors, Decorative MirrorsShape: SunburstHanging Orientation: Dual OrientationReturns & ExchangesReturns & ExchangesCustomer ReviewsCustomer ReviewsQuestion & AnswerQuestion & AnswerRelated ProductsReviewsRelated ProductsMore by Two's Company-Two's Company Queen Anne's Set Of 18 Silver Vases Two's Company Queen Anne's Set Of 18 Silver VasesRegular price $522.00Regular priceUnit price \/ perSale price $522.00 -Two's Company Artisan Carvings Set of 14 Bud Vases Two's Company Artisan Carvings Set of 14 Bud VasesRegular price $278.00Regular priceUnit price \/ perSale price $278.00 -Two's Company Sleek & Chic Vase Trio Set Of 12 Two's Company Sleek & Chic Vase Trio Set Of 12Regular price $640.00Regular priceUnit price \/ perSale price $640.00 -Two's Company Sleek & Chic Glass Bubbles Vases,... Two's Company Sleek & Chic Glass Bubbles Vases, Set Of 12Regular price $360.00Regular priceUnit price \/ perSale price $360.00 -Two's Company S\/5 Natural Rattan Mirrors Two's Company S\/5 Natural Rattan MirrorsRegular price $480.00Regular priceUnit price \/ perSale price $480.00Sold out","label":[[0,48,"PRODUCT"],[49,97,"PRODUCT"],[98,146,"PRODUCT"],[197,231,"PRODUCT"],[265,299,"PRODUCT"],[937,971,"PRODUCT"],[1005,1039,"PRODUCT"],[1733,1768,"PRODUCT"],[1769,1818,"PRODUCT"],[1890,1940,"PRODUCT"],[1941,1991,"PRODUCT"],[2063,2109,"PRODUCT"],[2110,2156,"PRODUCT"],[2228,2274,"PRODUCT"],[2279,2336,"PRODUCT"],[2408,2448,"PRODUCT"],[2449,2489,"PRODUCT"]],"Comments":[]}
{"id":1128,"text":"Chouteau 2-Drawer Media StandThis media stand offers more than mere storage; with glass cabinet doors and traditionally tapered feet, this entertainment center scores style points, galore.Chouteau TV StandAmish woodworkers build the Chouteau TV Stand with a mix of solid cabinet doors and those sporting glass fronts, providing versatile entertainment storage.Southlake Reclaimed TV ConsoleAdd traditional farmhouse warmth to your living room with the TV console, made from upcycled barn wood to provide a sturdy, stylish entertainment center.Ruth Rustic TV CabinetThe Ruth Rustic TV Cabinet combines rough sawn maple with smoked glass and moveable shelving for a living room staple that is both practical and handsome.Cerro Gordo Media CabinetThe multi-sized Cerro Gordo Media Cabinet is rich with decorative touches that accommodate both traditional and modern living room themes.Mauckport Living Room ConsoleThe Mauckport Living Room Console leverages traditional wood-crafting for a modern look, yielding an undeniably chic and sturdy entertainment center.Mauckport 1-Drawer TV ConsoleSatisfy your entertainment center needs with the Mauckport 1-Drawer TV Console, complete with adjustable shelves. This entertainment center comes in 3 sizes.Mauckport TV StandThe Mauckport TV Stand, made to order in 3 sizes and numerous wood options, brings a chicly contemporary silhouette and traditional sturdiness.Richmond 1-Drawer TV ConsoleThis wooden TV console displays elements of traditional Shaker design while fulfilling entertainment storage needs with a dovetail drawer and moveable shelves.West Point Entertainment ConsoleThe West Point Entertainment Console leverages traditional wood crafting with modern design for this stylish media storage solution.West Point 1-Drawer Media StandThis entertainment center displays beautifully carved elements, from the traditional paneled cabinet doors to the ridged posts. Choose from 3 different sizes.West Point 3-Door TV ConsoleA petite entertainment center, this solid wood console can come in three different widths complete with moveable shelves for highly adaptable storage.Two Rivers TV ConsoleOffered in 3 sizes, the Two Rivers TV Console celebrates traditional Arts and Crafts woodworking along with practical console features like adjustable shelves.Two Rivers 1-Drawer Media StandFrom the curved posts to the delicate hardware, this Amish media cabinet can accommodate storage needs with its modifiable shelving and a dovetailed drawer.Two Rivers 3-Door TV StandThis Arts & Crafts entertainment center can be ordered with lengths of 50”, 60”, and 70” in whichever wood and stain best aligns with your living room decor.Manero Media StandThe wooden Manero Media Stand combines an open shelf with spacious storage cabinets, complete with moveable shelving and Amish-carved flourishes.Manero 1-Drawer TV ConsoleThe classic character of this solid wood entertainment cabinet will provide traditional warmth to your living room. Available in three sizes, made by Amish.","label":[[0,29,"PRODUCT"],[190,207,"PRODUCT"],[236,253,"PRODUCT"],[364,394,"PRODUCT"],[457,467,"PRODUCT"],[549,571,"PRODUCT"],[572,598,"PRODUCT"],[727,752,"PRODUCT"],[757,794,"PRODUCT"],[892,921,"PRODUCT"],[922,955,"PRODUCT"],[1072,1101,"PRODUCT"],[1151,1180,"PRODUCT"],[1260,1278,"PRODUCT"],[1279,1301,"PRODUCT"],[1423,1451,"PRODUCT"],[1464,1474,"PRODUCT"],[1612,1644,"PRODUCT"],[1645,1681,"PRODUCT"],[1778,1809,"PRODUCT"],[1969,1997,"PRODUCT"],[2149,2170,"PRODUCT"],[2191,2216,"PRODUCT"],[2331,2362,"PRODUCT"],[2520,2546,"PRODUCT"],[2705,2723,"PRODUCT"],[2735,2753,"PRODUCT"],[2870,2896,"PRODUCT"]],"Comments":[]}
{"id":1132,"text":"Skip to main contentThonetHomeShopProductsBy Product CategoryChairsBarstoolsSofasLounge ChairsNZ MadeBanquette & Bench SeatingTables and Bar LeanersCoffee TablesCafe TablesJoineryOutdoor FurnitureRugsLightingGlasswareBy BrandAlma DesignAnibouArmadillo&CoArtekEmecoFermobFjordfiestaKMSLK HjelleMaxdesignNardiPly CollectionThonetTomahawkVery WoodVitraAll ProductsShop PricesProjectsNewSpecialsAboutContactShortlistShortlistAll ProductsBrand- All brands -Alma DesignAnibouArmadillo&CoArtekEmecoFermobFjordfiestaKMSLK HjelleMaxdesignNardiPly CollectionThonetTomahawkVery Wood Italian Chair MakersVitraCategory- All categories -ChairsCafe ChairsBarstoolsCafe TablesBanquette and Bench SeatingTables and Bar LeanersNZ MadeSofasCoffee TablesLounge ChairsHotel Restaurant ChairsJoineryOutdoor FurnitureRugsLightingGlasswareNo.18 Bentwood Cafe ChairThonetNo.18 BST .ThonetHoffmann Cane ChairThonetHoffmann Arm ChairThonetOtto ChairThonetOtto Upholstered ChairThonetOtto Low Back BarstoolThonetOtto Upholstered Low Back BarstoolThonetOtto BarstoolThonetPlanar Stacking ChairThonetNo.B9 Le Corbusier Arm ChairThonetLido ChairThonetMelnikov ChairThonetLof 101 ChairThonetDaensen Folding ChairThonetErinna Cafe ChairThonetJosef Cane ChairThonetLinea Stacking Cafe ChairThonetLa Verna Cafe ChairThonetPlica ChairThonetRombus Cafe ChairThonetRombus Arm ChairThonetNo.10 ChairThonetBistro Cafe ChairThonetLeiter Cafe ChairThonetNo.16 Cafe ChairThonetBoullee Cafe ChairThonetBST46 Cafe StoolThonetDuchamp BarstoolThonetBST 74 BarstoolThonetBST 75 BarstoolThonetBST76 BarstoolThonetPlanar BarstoolThonetLinz BarstoolThonetErinna BarstoolThonetUpholstered Bentwood Chairs and BarstoolsThonetWardley ChairThonetHoffmann BarstoolThonetRombus BarstoolThonetCafe Daum ChairThonetCafe Daum CoathooksThonetCafe Daum Coat StandThonetBentwood Rocking ChairThonetFalcon 200 Cafe TableThonetEuropean Cafe TableThonetFrench 3ft Cafe TableThonetFrench 4ft Cafe TableThonetEcho Arm ChairKMSNewCaswell Tub ChairKMSCharles Lounge ChairKMSPages1234next ›last »","label":[[856,873,"PRODUCT"],[898,923,"PRODUCT"],[950,969,"PRODUCT"],[977,995,"PRODUCT"],[1003,1013,"PRODUCT"],[1021,1043,"PRODUCT"],[1051,1073,"PRODUCT"],[1081,1115,"PRODUCT"],[1123,1136,"PRODUCT"],[1144,1165,"PRODUCT"],[1173,1201,"PRODUCT"],[1209,1219,"PRODUCT"],[1227,1241,"PRODUCT"],[1249,1262,"PRODUCT"],[1270,1291,"PRODUCT"],[1299,1316,"PRODUCT"],[1324,1340,"PRODUCT"],[1348,1373,"PRODUCT"],[1382,1399,"PRODUCT"],[1408,1419,"PRODUCT"],[1427,1444,"PRODUCT"],[1452,1468,"PRODUCT"],[1476,1487,"PRODUCT"],[1495,1512,"PRODUCT"],[1520,1537,"PRODUCT"],[1545,1561,"PRODUCT"],[1569,1587,"PRODUCT"],[1595,1611,"PRODUCT"],[1619,1635,"PRODUCT"],[1643,1658,"PRODUCT"],[1666,1681,"PRODUCT"],[1689,1703,"PRODUCT"],[1711,1726,"PRODUCT"],[1734,1747,"PRODUCT"],[1755,1770,"PRODUCT"],[1778,1819,"PRODUCT"],[1827,1840,"PRODUCT"],[1848,1865,"PRODUCT"],[1873,1888,"PRODUCT"],[1896,1911,"PRODUCT"],[1919,1938,"PRODUCT"],[1946,1966,"PRODUCT"],[1974,1996,"PRODUCT"],[2004,2025,"PRODUCT"],[2033,2052,"PRODUCT"],[2060,2081,"PRODUCT"],[2089,2110,"PRODUCT"],[2118,2132,"PRODUCT"],[2141,2158,"PRODUCT"],[2163,2183,"PRODUCT"]],"Comments":[]}
{"id":1133,"text":"Hamac très beau en vert plaine et profonde, 100% coton. Très large et donne place facilement à deux personnes.| Couleur |Vert || Capacité |180 kg || Grandeur |Famille || Dimensions |220 X 160 cm || Longueur totale |380 cm || Distance suspendus |min. 4 mètres || Matériel |100% coton |","label":[[0,6,"PRODUCT"]],"Comments":[]}
{"id":1135,"text":"Praise from the pressThe Cross Chair is quickly becoming a contemporary classic.We designers have a role to challenge the materials, production, processes, and people so that we can help develop and maintain modern craftsmanship.Thomas BentzenThe Cross Chair is quickly becoming a contemporary classic.We designers have a role to challenge the materials, production, processes, and people so that we can help develop and maintain modern craftsmanship.Thomas Bentzen","label":[[26,37,"PRODUCT"],[251,262,"PRODUCT"]],"Comments":[]}
{"id":1138,"text":"HomeOur ProductsAboutLeadershipFAQContactAccountHome\/Collections\/Cupholders\/CUP HOLDER 2 TIER 33136CUP HOLDER 2 TIER 33136International Furniture SupplyContact Us For More InformationCUP HOLDER 2 TIER 33136","label":[[89,107,"PRODUCT"],[113,130,"PRODUCT"],[200,217,"PRODUCT"]],"Comments":[]}
{"id":1139,"text":"Based in Walker, Newcastle upon Tyne, Walter Cox Ltd has been a family business for 106 years. It was Walter Cox himself who started the business as a watch maker in 1918 after he'd served in the First World War, the shop was originally based in Church Street then moved to the current site on Welbeck Road in 1935. Douglas Cox took over from him followed by David Cox, Walter's sons. David and his wife, Kathleen, retired 16 years ago and now Samantha, their daughter, and her husband John, run the shop. Over the years the shop has sold many different products including paint, prams, clothes and shoes. Long before Netflix and Firesticks, you could forget about Blockbusters, Walter Cox was the place to go for all your rental videos.Through the years the shop has changed what it sells to keep up with current trends and fashions, one thing that has not changed is the pride we take in our customer service to all our existing and new customers.Today the shop sells a wide range of household furniture, beds, carpets and household electricals from leading brands such as Hotpoint, Indesit, Whirlpool, Lifestyle Floors, Dura Beds and Julian Bowen.","label":[[1009,1013,"PRODUCT"],[1015,1022,"PRODUCT"]],"Comments":[]}
{"id":1141,"text":"MDM Wardrobe Storage Organiser€129,00Fabric Wardrobe, Foldable Closet with Hanging Rail, Clothes Rack, Storage Organiser for Bags, Toys, Shoes, Living Room, Bedroom, Cloakroom, 150 x 45 x 175 cm.- INVITE YOUR CLOTHES IN: Hang your clothes on the 2 rods of the fabric wardrobe in neat rows. Place your folded clothes on the shelves. When you need to pick your outfits for a big day, everything you have is just at your fingertips.- IT HAS THE STRENGTH: The hanging rail has a load capacity of 15 kg and the fabric layer holds 5 kg because it’s supported by 16 mm dia. metal tubes and quality non-woven fabric; the sturdiness and durability of the foldable closet are both assured.- AWAY FROM DUST: Your favorite new garment needs better protection. The fabric cover, equipped with a zipper and hook-and-loop fasteners, was handpicked to store your clothes properly. This clothes rack has you covered!- EASY TO ASSEMBLE: No more spending hours putting a fabric wardrobe together; the assembly here is all about attaching the tubes into the plastic connectors, no tools required. All that’s left to do is display your shirts and dresses on the hanging rail.FREE DELIVERY | SECURE PAYMENT","label":[[0,30,"PRODUCT"],[39,54,"PRODUCT"],[55,71,"PRODUCT"],[91,103,"PRODUCT"],[105,122,"PRODUCT"]],"Comments":[]}
{"id":1142,"text":"Amazing Luxury Furniture in the Philippines with Muebles’ Brightness CollectionLooking for luxury furniture in the Philippines has been made easy by Muebles Italiano’s Brightness collection. Experience opulence with this expertly crafted, handmade collection filled with gilded pieces and silver lined vases. Take your lamps and lighting to a whole new level and try out the pinnacle of Italian furniture. Each piece in this collection can transform your room with the various masterfully crafted designs that can perfectly match a multitude of interiors. Brightness is a collection that aims to show the class and caliber of Italian craftsmanship. Unleash your inner interior design and decorate your shelves with the variety of creative clutter available, just for you.Brightness uses high-quality ceramics that create the perfect gold and silver statuettes. The fine creations of this collection can complete the luxury aesthetic that you desire. Brightness makes clever use of common and rare fauna to bring an otherworldly and ethereal nature to any space you affix it to. The vases are encrusted with Swarovski crystals and 24 karat gold which are ideal for giving a hint and a touch of magic and exclusivity. You’ll be amazed at the level of detail each masterpiece is fashioned with.Let Muebles Italiano introduce you to your new opulent lifestyle and enjoy your new decor today.","label":[[49,79,"PRODUCT"],[319,325,"PRODUCT"],[851,861,"PRODUCT"]],"Comments":[]}
{"id":1143,"text":"WoodShowing 1–48 of 1317 results-2Pcs Mid-Century Dining Chair$548 More options → -3Pcs Black and White Faux Leather Sofa Set$2,099 More options → -3Pcs Camel and Dark Brown Faux Leather Sofa Set w\/ Coffee Table$2,308 More options → -3Pcs Cream Faux Leather Sofa Set$2,308 More options → -3Pcs Dark Brown Faux Leather Sofa Set$2,132 More options → -3Pcs Dark Chocolate and Cream Faux Leather Sofa Set$2,099 More options → -3Pcs Dark Gray Leather Air Fabric Sofa Set$1,714 More options → -3Pcs Purple Fabric Sofa Set$2,693 More options → -3Pcs Rose Gold Faux Leather Sofa Set$2,693 More options → -3Pcs Taupe Microfiber Leather Sofa Set$2,407 More options → -3Pcs White Microfiber Leather Sofa Set$2,407 More options → -6Pcs Sectional Set in Grey$1,263 More options → -Abrianna Brown Love Seat$757 More options → -Abrianna Brown Sofa$823 More options → -Abrianna Brown Sofa Set$1,438$1,580 More options → -Abrianna Gray Love Seat$757 More options → -Abrianna Gray Sofa$786 More options → -Abrianna Gray Sofa Set$1,404$1,543 More options → -Accent Chair in Indigo$291 More options → -Aislin Espresso Chair$339 More options → -Aislin Espresso Love Seat$416 More options → -Aislin Espresso Ottoman$218 More options → -Alicia Light Brown Love Seat$251 More options → -Alisa Sectional in Ivory$1,472 More options → -Amaris Dark Brown Loveseat$412 More options → -Amaris Dark Brown Recliner$317 More options → -Amaris Dark Brown Sofa$511 More options → -Amaris Dark Brown Sofa SetFrom:$840$923 More options → -Anita Espresso Power Love Seat w\/ Console$918 More options → -Ash Chair$231 More options → -Ash Loveseat$313 More options → -Ash Sofa$379 More options → -Ash Sofa SetFrom:$630$692 More options → -Asma Beige Loveseat$808 More options → -Asma Beige Sofa$1,054 More options → -Asma Beige Sofa Set$1,694$1,862 More options → -Atlantic Chair$231 More options → -Atlantic Loveseat$339 More options → -Atlantic Sofa SetMore options → -Augustina Light Brown Chair$526 More options → -Augustina Light Brown Love Seat$724 More options → -Augustina Light Brown Sofa$801 More options → -Augustina Light Brown Sofa SetFrom:$1,388$1,525 More options → -Azis Gray Fabric Love Seat$874 More options → -Badalona I Beige Love Seat$379 More options → -Badalona I Grey Love Seat$379 More options → -Basix Portico 2Pcs Dining Chair in Off White$547 More options → -Bed Bench in Vintage Cream$786 More options →","label":[[36,65,"PRODUCT"],[88,130,"PRODUCT"],[155,218,"PRODUCT"],[243,275,"PRODUCT"],[300,337,"PRODUCT"],[362,413,"PRODUCT"],[438,480,"PRODUCT"],[505,532,"PRODUCT"],[557,593,"PRODUCT"],[618,656,"PRODUCT"],[681,719,"PRODUCT"],[744,770,"PRODUCT"],[795,819,"PRODUCT"],[842,861,"PRODUCT"],[884,907,"PRODUCT"],[938,961,"PRODUCT"],[984,1002,"PRODUCT"],[1025,1047,"PRODUCT"],[1078,1100,"PRODUCT"],[1123,1144,"PRODUCT"],[1167,1192,"PRODUCT"],[1215,1238,"PRODUCT"],[1261,1289,"PRODUCT"],[1312,1336,"PRODUCT"],[1361,1387,"PRODUCT"],[1410,1436,"PRODUCT"],[1459,1481,"PRODUCT"],[1504,1530,"PRODUCT"],[1562,1603,"PRODUCT"],[1626,1635,"PRODUCT"],[1658,1670,"PRODUCT"],[1693,1701,"PRODUCT"],[1724,1736,"PRODUCT"],[1768,1787,"PRODUCT"],[1810,1825,"PRODUCT"],[1850,1869,"PRODUCT"],[1900,1914,"PRODUCT"],[1937,1954,"PRODUCT"],[1977,1994,"PRODUCT"],[2012,2039,"PRODUCT"],[2062,2093,"PRODUCT"],[2116,2142,"PRODUCT"],[2165,2195,"PRODUCT"],[2231,2257,"PRODUCT"],[2280,2306,"PRODUCT"],[2329,2354,"PRODUCT"],[2377,2421,"PRODUCT"],[2444,2470,"PRODUCT"]],"Comments":[]}
{"id":1144,"text":"Corona Solid Pine Coffee Table2 year warranty availableYour guarantee starts from your date of purchase and is valid for 2 years following this.Our guarantee covers you in the eventuality of any of the following:- Faulty worksmanship during manufacture.- Frame breakage including timber, veneers, stability joints and springs.- Components including handles, catches and hinges, interior fittings, drawer runners, reciprocal table leaf actions and butterfly leaves\/extensions, motors and coffee tables incorporating function\/storage.Any of the following problems will not be covered by our guarantee:Read MoreIn stock, ready for despatchGet it by Wed 22 December 2020In stock, ready for despatchGet it by Wed 22 December 20202 Year Warranty IncludedYour guarantee starts from your date of purchase and is valid for 2 years following this.Our guarantee covers you in the eventuality of any of the following:- Faulty worksmanship during manufacture.- Frame breakage including timber, veneers, stability joints and springs.- Components including handles, catches and hinges, interior fittings, drawer runners, reciprocal table leaf actions and butterfly leaves\/extensions, motors and coffee tables incorporating function\/storage.Any of the following problems will not be covered by our guarantee:Read MoreKlarna AvailableDescriptionDescriptionBuyers notesExpertly crafted from solid pine wood, this coffee table with storage will look superb topped with your latest magazines and your favourite coffee table books.What you need to know- Assembly - Self-assembly is required.- Design features - Traditional style handles & antique wax finish.- Finish\/material - Solid pine & metal handles.- Guarantee - All Laura James furniture comes with a 2-year guarantee, T&Cs apply.Why we loveFor a traditional feeling, the beautifully constructed pine coffee table offers a soft tone and subtle black detailing. Each table will have its own unique finish due to the nature of solid wood providing warmth to the room. Combine with a cream sofa for a bright rustic feel, or enhance the natural tones of this Mexican pine table with brown leather seating.||Main Material |Solid pine |Finish |Wax |Max Weight Capacity |50kg |Drawer Dimensions |Height 11.5cm, Width 28cm, Depth 27cm |Height from floor to underside |43cm |Special Features |Traditional style handles Solid pine |Assembly Required |Yes |Delivery InformationDelivery InformationStandard delivery charges are shown in the table below:What is my delivery cost and date?What happens after I've ordered?You will receive a courier tracking notification 1-2 days before your order is due to arrive at your location (the get it by date featured above).To find out more please see our FAQs.ReturnsWe accept returns within 28 days of delivery, to find out more please see our Returns PolicyDimensions & DetailsDimensions & DetailsCoffee Table DimensionsH45cm W100cm D60cmHeight From Floor To Underside43cmMain MaterialSolid pine with wax finishHandle MaterialMetalProduct Weght15kgMax Weight Capacity50kgDrawer DimensionsH11.5cm W28cm D27cmSpecial FeaturesTraditional style handles with antique wax finishSpare PartsAvailable upon requestSelf Assembly RequiredYesQuick AddCharlie Double Bed Frame And Mattress Set - Black£199.99£99.99In stock, ready for despatchGet it by Wed 22 December 20202 year warranty availableYour guarantee starts from your date of purchase and is valid for 2 years following this.Our guarantee covers you in the eventuality of any of the following:- Faulty worksmanship during manufacture.- Frame breakage including timber, veneers, stability joints and springs.- Components including handles, catches and hinges, interior fittings, drawer runners, reciprocal table leaf actions and butterfly leaves\/extensions, motors and coffee tables incorporating function\/storage.Any of the following problems will not be covered by our guarantee:Read MoreKlarna AvailableYou May Also LikeRecently ViewedDimensions & DetailsCoffee Table DimensionsH45cm W100cm D60cmHeight From Floor To Underside43cmMain MaterialSolid pine with wax finishHandle MaterialMetalProduct Weght15kgMax Weight Capacity50kgDrawer DimensionsH11.5cm W28cm D27cmSpecial FeaturesTraditional style handles with antique wax finishSpare PartsAvailable upon requestSelf Assembly RequiredYes","label":[[0,30,"PRODUCT"],[2122,2140,"PRODUCT"],[2924,2937,"PRODUCT"],[3287,3336,"PRODUCT"],[4069,4081,"PRODUCT"]],"Comments":[]}
{"id":1146,"text":"Marble & terrazzo confetti boardMarble & terrazzo confetti boardRegular price$49.00Regular priceSale price$49.00Unit priceperEye candy for your kitchen.If you are looking for catching decor in your kitchen: you have found it! This unique, handmade board is made of a combination of concrete and marble.Each board is handmade and unique, so difference in color and pattern from image are to be expected. This board is food safe, but not suitable for microwave and dishwasher. We recommend cleaning with a damp cloth.· Dimensions: 12\" x 10\" x 0.6\"· Material: concrete \/ marble· Color: multi color· Remarks: food safe \/ decorative use","label":[[0,32,"PRODUCT"],[33,65,"PRODUCT"]],"Comments":[]}
{"id":1147,"text":"10 pc Venice Teak Deep Seating Set with Coffee Table. Sunbrella CushionsRegular price$9,353.99$7,794.99SaleThe Skinny:10 pc Venice Outdoor Seating Group with Coffee Table. Handcrafted from the finest teak hardwood timber. We only use premium grade to enhance the natural weather resistance properties of teak. Tenon and joinery construction with dowel reinforcement where extra support is needed. 5\" thick Sunbrella seat and back cushions boasting a solid foam core wrapped in fiber and overstuffed back cushions for ultimate comfort are included. Wood is finely sanded to a satin finish. Durability and quality to last for decades.Features:Handcrafted from Top Grade A TeakGenerously ScaledFinely sanded and polished for high end feelNon Marking protective feetSunbrella Cushion with high resiliency foam core wrapped in fiber for comfort","label":[[0,72,"PRODUCT"],[123,175,"PRODUCT"]],"Comments":[]}
{"id":1149,"text":"Ro Armchair-The Ro Easy Chair was designed by Spanish designer Jaime Hayon, and is a very comfortable new style of chair by the Danish brand Fritz Hansen. This wingback chair is perfect for relaxing in, thanks to its high back and soft upholstery. The Ro armchair is made with excellent craftsmanship and out of sustainable materials. The design of the Ro chair is elegant and suited for a classical, contemporary or modern home. A matching foot stool is also available with this chair.Read moreThe armchair comes in a great choice of fabrics and colours, and is also available in a \"Designer Selections\" version in a mix of two fabrics for the shell and the cushions. The legs are made of brushed aluminium or solid wood. -JH1-Aluminium, JH2-WoodenHeight: 113.0 cmDepth: 97.0 cmWidth: 80.0 cmSeat Height: 43.0 cm -Please see above for prices of each individual finish. 3D models for illustration only. Many products feature natural materials such as wood, leather and marble, with differing grain and vein details.","label":[[0,11,"PRODUCT"],[18,30,"PRODUCT"],[254,265,"PRODUCT"],[355,363,"PRODUCT"],[503,511,"PRODUCT"]],"Comments":[]}
{"id":1150,"text":"Grasshopper Storage BinWith quality, style and function in mind our Grass hopper storage bins have enough room to store all of your patio cushions and covers. Made with half round wicker, aluminium frame, dual pistons for soft close and a water resistant inner cover.Dimensions: 60”w x 24”d x 32”h","label":[[0,23,"PRODUCT"]],"Comments":[]}
{"id":1154,"text":"APEN BOOKCASE$329.00 $999.00Adorn your home with the APEN Bookcase, crafted from the finest solid teak wood and handmade with precision. Featuring both a drawer and an open display shelf, this piece offers plenty of storage space while showcasing your favorite reads and collectibles. Elegant and timeless, the APEN Bookcase is the perfect addition to your sophisticated space.*As this product is completely handmade (unlike our other products), we seek your understanding that it is subject to slight imperfections.| Width | 600 | || Depth | 400 | || Height | 1800 | || Material | Solid teak | || Lead time |||| Requires Assembly | No |PRODUCT SPECIFICATIONSDrawerINSPIRATIONS","label":[[0,13,"PRODUCT"],[55,68,"PRODUCT"]],"Comments":[]}
{"id":1157,"text":"ASMUND Outdoor Console Table with 2 Sink SetRegular price$4,199.00$1,399.00SaleAsmund Outdoor Console Table with 2 Sink Set1TF168INX CONSOLE Table 2 SINK Set","label":[[0,28,"PRODUCT"],[84,128,"PRODUCT"]],"Comments":[]}
{"id":1158,"text":"French Riviera Paris 3 Drawer Executive Writing Desk RMY238Minimalist Scandinavia StyleDescription:- light pecan color- Hand-crafted by highly skilled and seasoned craftsmen- Kiln-dried solid wood timber- Contemporary Design- Solid Wood Timber writing desk featuring metal runners and brass handles- Top Drawer (exterior) height: 14cm- Middle Drawer (exterior) height: 14.5cm- Bottom Drawer (exterior) height: 14.5cm- Drawer (exterior) width: 46cmDimensions Overall: 80cm H x 150cm W x 50cm DItem Weight: 40 Kilogram","label":[[0,52,"PRODUCT"]],"Comments":[]}
{"id":1160,"text":"ProductsHigh quality home furnishing & accessoriesBrowse by roomEvery time you shop for furniture at Furniture World Saskatoon, you will find only the best that we can offer.Explore an impressive variety of top quality products and sought-after items from the world’s leading furniture makers.Living RoomThe friendly staff at Furniture World Saskatoon is here to help you create a living room that’s not only comfortable and beautiful but affordable too. Discover products from our trusted manufacturers or browse the full collection of living room furniture below.-Decor-rest 3795 Sofa Chaise Saddle Whiskey$5,199.00Original price was: $5,199.00.$3,899.00Current price is: $3,899.00. -Decor-rest 2068 Malibu Sectional$3,999.00Original price was: $3,999.00.$3,199.00Current price is: $3,199.00. -H2 Oslo Power Recliner$2,099.00Original price was: $2,099.00.$1,699.00Current price is: $1,699.00. -Style In Form Nesting Table Hairpin$429.00Original price was: $429.00.$349.00Current price is: $349.00.BedroomArguably the most important room in your home, your bedroom should be a space you can truly relax. Furnish your bedroom with the most comfortable and functional furniture from Furniture World Saskatoon. Our helpful staff would be happy to guide you through our wide selection of bedroom furniture. Take a look at beds, side tables, and more from our most sought-after manufacturers.-Makowood Scarlett Queen Storage Bed$2,399.00Original price was: $2,399.00.$1,899.00Current price is: $1,899.00. -Makowood Robina Dresser$1,799.00Original price was: $1,799.00.$1,399.00Current price is: $1,399.00. -TH Definity Walnut Night Table$1,499.00Original price was: $1,499.00.$1,199.00Current price is: $1,199.00. -West Bros Serra King Walnut Bed$3,499.00Original price was: $3,499.00.$2,799.00Current price is: $2,799.00.Dining RoomFurniture World Saskatoon can help you furnish a dining room to create memorable moments with your friends and family. Looking for a new dining room set? A bigger table? A budget friendly upgrade with new chairs or bar stools? We have it at Furniture World Saskatoon! Browse our brands or explore the full collection of dining room furniture below.Visit us today!We’d love to show you around our showroom and help you find exactly what you’re looking for.","label":[[574,616,"PRODUCT"],[696,728,"PRODUCT"],[808,830,"PRODUCT"],[1408,1443,"PRODUCT"],[1523,1546,"PRODUCT"],[1626,1656,"PRODUCT"],[1736,1767,"PRODUCT"]],"Comments":[]}
{"id":1161,"text":"-Trapani Dining Chair White w\/Rope – 11PCS ONLY€375.00€265.00 -Nika Dining Chair White Alu w\/Rope – 2PCS ONLY€885.00€530.00 -Varese Dining Chair Diamond – 6PCS ONLYHartman, you will enjoy longer! The Varese chair is manufactured from wicker material with aluminum frame. The wicker material is of high quality, resistant to weather and fadeless.€485.00€340.00 -Tivoli Dining Chair Sunny CreamHartman, you will enjoy longer! The Tivoli chair is manufactured from wicker material with aluminum frame. The wicker material is of high quality, resistant to weather and fadeless.€415.00€290.00 -Barolo Dining Chair Anthracite€195.00€135.00 -Barolo Dining Chair White€195.00€135.00 -Breeze Dining Chair White w\/Teak Armrest – 2PCS ONLYThe frame of the Breeze Dining Chair is made of aluminum, the seat is made of textilene. Both low maintenance materials. This allows this chair to remain outside all year round. This chair is beautiful in combination with the Breeze Dining table because the design matches. The Breeze line has a timeless and sleek appearance. Breeze chair is a nice combination with Aluminum Tables.€580.00€340.00 -Arezzo Lounger Black Alu w\/GREY Rope & Beige Cushions – 4PCS ONLY€1,765.00€1,235.00 -Arezzo Lounger Black Alu w\/GREY Rope & Light Grey Cushions – 2PCS ONLY€1,765.00€1,235.00 -Rosario Lounger Cast Alu Riven Grey w\/Cushion – 3PCS ONLY€875.00€525.00 -Rosario Bench Cast Alu Riven Grey – 3PCS ONLY€650.00€455.00 -Carson Coffee Table R.82cm Black w\/Ceramic Top – 1PC ONLY€955.00€665.00 -Carson Coffee Table R.82cm White w\/Ceramic Top – 1PC ONLY€955.00€665.00 -Carson Coffee Table R.62cm Black w\/Ceramic Top – 1PC ONLY€795.00€550.00 -Biarritz Coffee Table Square Set White w\/HPL Top – 3PCS ONLY€985.00€690.00 -Biarritz Coffee Table Square Set Charcoal w\/HPL Top – 3PCS ONLY€985.00€690.00 -Torano Daybed Desert Sand – 3PCS ONLY€2,350.00€1,410.00 -Tipperary Ext. Table 160\/260x90cm Xerix w\/HPL Top€2,150.00€1,500.00 -Breeze Table 220x100cm White Alu w\/Teak Top – 1PC ONLYThe Breeze Dining Table is made of aluminium and finished with a teak tabletop. Both materials are low-maintenance. This allows you to leave the set outside all year round without any worries. The table coordinates beautifully with the Breeze Dining chair. The Breeze collection has a timeless and sleek appearance.€2,250.00€1,575.00 -Salerno Table 200x100cm All Aluminium Anthracite – 2PCS ONLY€1,150.00€805.00 -Salerno Table 200x100cm All Aluminium White – 3PCS ONLY€1,150.00€805.00 -Arezzo Table R.130cm Black w\/Ceramic Top – 3PCS ONLY€1,250.00€875.00 -Susan Table Oval 240x140cm Xerix w\/Ceramic on Glass Top – 1PC ONLY€2,250.00€1,350.00 -Susan Table Oval 200x120cm Xerix w\/Ceramic on Glass Top – 3PCS ONLY€1,950.00€1,170.00","label":[[2,35,"PRODUCT"],[66,100,"PRODUCT"],[130,157,"PRODUCT"],[369,400,"PRODUCT"],[600,630,"PRODUCT"],[648,673,"PRODUCT"],[691,731,"PRODUCT"],[761,780,"PRODUCT"],[1071,1083,"PRODUCT"],[1111,1125,"PRODUCT"],[1145,1199,"PRODUCT"],[1232,1290,"PRODUCT"],[1324,1369,"PRODUCT"],[1399,1432,"PRODUCT"],[1462,1508,"PRODUCT"],[1537,1583,"PRODUCT"],[1612,1658,"PRODUCT"],[1687,1735,"PRODUCT"],[1765,1817,"PRODUCT"],[1846,1871,"PRODUCT"],[1905,1954,"PRODUCT"],[1976,2019,"PRODUCT"],[2031,2054,"PRODUCT"],[2368,2416,"PRODUCT"],[2448,2491,"PRODUCT"],[2523,2563,"PRODUCT"],[2595,2650,"PRODUCT"],[2683,2738,"PRODUCT"]],"Comments":[]}
{"id":1164,"text":"NaplesNaples Teak Coffee Table 40x60x100 SFS638CT 000 TANaples Teak Coffee Table 40x60x100 SFS638CT 000 TARegular price$299.00 SGDRegular price$899.00 SGDSale price$299.00 SGDUnit price\/perNaples Teak Coffee Table SFS638CT 000 TACoffee Table in mahogany colormade from solid timber.Dimensions:Height: 40cmWidth: 60cmLength: 100cmFree Shipping in Singapore CityFree Pre Assembly of Furniture","label":[[7,31,"PRODUCT"],[58,82,"PRODUCT"],[201,225,"PRODUCT"],[242,254,"PRODUCT"]],"Comments":[]}
{"id":1165,"text":"Searchclose (esc)Close menuHOMECOLLECTIONSSofaCabinetChairOffice FurnitureTableCONTACT USLog inCreate accountClose cartMenuSearchCartDice40x40cm \/ Mustard \/ Yes -$1,980.00 HKD40x40cm \/ Mustard \/ No -$1,880.00 HKD40x40cm \/ Grey \/ Yes -$1,980.00 HKD40x40cm \/ Grey \/ No -$1,880.00 HKD40x40cm \/ Olive Green \/ Yes -$1,980.00 HKD40x40cm \/ Olive Green \/ No -$1,880.00 HKD40x40cm \/ Rose \/ Yes -$1,980.00 HKD40x40cm \/ Rose \/ No -$1,880.00 HKD40x80cm \/ Mustard \/ Yes -$2,680.00 HKD40x80cm \/ Mustard \/ No -$2,580.00 HKD40x80cm \/ Grey \/ Yes -$2,680.00 HKD40x80cm \/ Grey \/ No -$2,580.00 HKD40x80cm \/ Olive Green \/ Yes -$2,680.00 HKD40x80cm \/ Olive Green \/ No -$2,580.00 HKD40x80cm \/ Rose \/ Yes -$2,680.00 HKD40x80cm \/ Rose \/ No -$2,580.00 HKD40x120cm \/ Mustard \/ Yes -$3,080.00 HKD40x120cm \/ Mustard \/ No -$2,980.00 HKD40x120cm \/ Grey \/ Yes -$3,080.00 HKD40x120cm \/ Grey \/ No -$2,980.00 HKD40x120cm \/ Olive Green \/ Yes -$3,080.00 HKD40x120cm \/ Olive Green \/ No -$2,980.00 HKD40x120cm \/ Rose \/ Yes -$3,080.00 HKD40x120cm \/ Rose \/ No -$2,980.00 HKDQuantityRegular price$1,980Add to cartThis item is a recurring or deferred purchase. By continuing, I agree to thecancellation policyand authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted.ShareShare on FacebookTweetTweet on TwitterPin itPin on PinterestHomechoosing a selection results in a full page refresh","label":[[47,51,"PRODUCT"],[52,59,"PRODUCT"],[60,65,"PRODUCT"],[83,88,"PRODUCT"],[150,154,"PRODUCT"]],"Comments":[]}
{"id":1166,"text":"WICKER PlantersWICKER PlantersRegular price$279.00 SGDRegular price$349.00 SGDSale price$279.00 SGDUnit priceper“Discover our trio of natural-toned wicker planters, featuring a robust woven design that tapers gracefully from top to bottom. Perfect for adding a touch of organic elegance to any indoor or outdoor space.”Synthetic wicker planter stand, comes in a set of 3DimensionPlanter 1: Width 45 cm; Depth 45 cm; Height 40 cmPlanter 2: Width 45 cm; Depth 45 cm; Height 60 cmPlanter 3: Width 45 cm; Depth 45 cm; Height 80 cmFree delivery.","label":[[0,15,"PRODUCT"],[16,31,"PRODUCT"],[144,173,"PRODUCT"],[330,360,"PRODUCT"]],"Comments":[]}
{"id":1167,"text":"Introducing the Julie 3 Seater Sofa Bed, crafted with quality and sophistication at an unbeatable price. Optimize your space without compromising on style. With its simple yet elegant design, this sofa bed is the perfect addition to any room.Novena SingaporeReclining Armchairs For Relaxing PrivatelyCaterpillar Recliner ArmchairNovenaIntroducing the Caterpillar Recliner Armchair – a fusion of style and functionality. Crafted with simulated leather, this armchair boasts a 360-deg...View full detailsZayn Recliner Armchair, FabricNovenaMinimalist Look Coupled with Luxurious Reclining ComfortSlim arms and minimalist design make Zayn a perfect fit for modern minimalist homes - all t...View full detailsWatson Electric Recliner Armchair, SlateNovenaSwivel Glider Elec-Recliner Armchair available in Fabric Material, Slate (Grey) colour.Come with Rechargeable Power Bank.Toraz Electric Recliner Armchair, FabricNovenaEnjoy the convenience of the power-lift electric mechanism in the Toraz Electric Recliner Armchair, Fabric. Its motor allows you to easily stand up...View full detailsAnton Rocking Recliner Armchair, FabricNovenaThe Anton Rocking Recliner Armchair is the perfect addition to any home. Its high-quality fabric upholstery and sturdy wooden frame provide a relia...View full detailsDining Chair Best SellersPoline Dining Chair - Fabric - BeigeNovenaIntroducing the Poline Dining Chair - crafted with a stylish beige fabric and sturdy metal legs. Expertly designed with comfort in mind, this chair...View full detailsSasha Dining Chair, Grey - Fabric\/PUNovenaUpgrade your dining experience with the Sasha Dining Chair in Grey. Crafted from high-quality fabric and PU materials, this chair offers both comfo...View full detailsCabin Dining Chair, Synthetic Leather - Vintage BrownNovenaAdditional Information Dimension: L63x D49 x H86.5cm Make it a set with Mason Dining Table.Allan Dining Chair, Synthetic Leather - Ash GreyNovenaStylish and Easy to Maintain Designer Chair Allan Dining Chair features wide seating space supported by matte black metal legs. This sturdy chair...View full detailsCapri Swivel Dining Chair, Fabric - GreyNovenaThe Capri Swivel Dining Chair in elegant grey fabric offers comfortable seating with a modern twist. Its swivel feature allows for easy movement, m...View full detailsEmma 3 Seater Recliner Sofa, Simulated LeatherNovenaSink into the Comforts of Emma Recliner Sofa Our Best-selling Recliner Sofa Boasts Great Comfort and Makes Every Penny Well Spent Additiona...View full detailsHampton II 3 Seater Recliner Sofa, FabricNovenaBest Value Buy This Year Hampton Recliner Sofa marks the Best Value Buy for Recliner Sofas this Year with its Crazy Price and Amazing Comfort. L...View full detailsZayn 3 Seater Recliner Sofa, FabricNovenaMinimalist Look Coupled with Luxurious Reclining ComfortSlim arms and minimalist design make Zayn a perfect fit for modern minimalist homes - all t...View full detailsJadyn 3 Seater Recliner Sofa, Simulated LeatherNovenaModern Design with a Twist of Classic Jadyn Recliner Sofa Gets Ahead of Classic Design Recliner Sofas with its Modern Look. Dimension : Overall...View full detailsSkylar 3 Seater Recliner Sofa, Half LeatherNovenaA Modern Take On Recliner Sofas The sleek design, high back and slim armrests make Skylar a favourite amongst our younger recliner fans. The singl...View full detailsDesigner SofasExplore different styles of sofas customised to suit your home.Customise WardrobeChoose the right compartments for you and couple them with the door design that fits your home style.Modern InclinersZero wall distancing and sleek arms and functionality.DiningMix and match across our large catalog of dining tables and chairs","label":[[16,39,"PRODUCT"],[303,332,"PRODUCT"],[355,384,"PRODUCT"],[712,745,"PRODUCT"],[759,795,"PRODUCT"],[994,1026,"PRODUCT"],[1096,1127,"PRODUCT"],[1142,1177,"PRODUCT"],[1336,1355,"PRODUCT"],[1395,1414,"PRODUCT"],[1547,1565,"PRODUCT"],[1630,1648,"PRODUCT"],[1758,1776,"PRODUCT"],[1910,1928,"PRODUCT"],[2131,2156,"PRODUCT"],[2178,2207,"PRODUCT"],[2346,2373,"PRODUCT"],[2425,2443,"PRODUCT"],[2559,2592,"PRODUCT"],[2772,2799,"PRODUCT"],[2982,3010,"PRODUCT"],[3200,3229,"PRODUCT"]],"Comments":[]}
{"id":1170,"text":"Bean Bag HookDescriptionThese powder-coated stainless hooks are the perfect place to hang your Kyoto XL bean bags when not in use. Simply screw them into a wall or fence, then hang your bean bags to keep them off the ground.Product Features- Easy installation on fences or walls- Ideal for hanging bean bags for space saving and keeping cleanMaterials & Finishes- Powder-coated stainless steelShippingFree shipping New Zealand-wide. Leadtime of 3-10 days depending on location. Lead times on request for larger commercial ordersReturns & ExchangesWe'd like you to be 100% satisfied with the product(s) you've purchased from us. If your purchase is not to your liking, you can return it to us within 14 days for a full refund or an exchange. Full details on returns.","label":[[0,13,"PRODUCT"]],"Comments":[]}
{"id":1172,"text":"Novaluna - Parigi Platform Bed- Made In ItalyNovaluna - Parigi Platform Bed- Made In ItalyRegular price$1,595 USDSale price$1,595 USDUnit price\/perON SALE!Modern tufted headboard with soft arch on the top of the headboard. In this model, we have 2 beds that has under bed storage with the single-movement lift up mechanism. Beds without storage will come with standard orthopedic slats. Avail. to do special order item in your choice of color with about 6-8 months lead time. Designed and 100% MADE IN ITALY.MOD#0063 - platform bed (no foundation needed)Queen 72\"W x 82.28\"L x 46.85\"H \/ fit mattress size 153cm x 203cm \/ 60\"Wx 80\"LKing 79.92\"W x 46.85\"LH x 46.85\"H \/ fit mattress size 193cm x 203cm \/ 76\"W x 80\"Lstock color and sizes:Full size with storage - E309, E308king size - color E0106 Cipra (like butter color), E0107 dark grey, E0101 whiteSTORAGE KIT AVAIL FOR 1 KING SIZE","label":[[0,30,"PRODUCT"],[46,76,"PRODUCT"]],"Comments":[]}
{"id":1173,"text":"Riviera 1900 Hutch Riviera 1900mm Hutch – Curved glass display each end Rimu construction with curved Glass or Rimu Doors, Flocked insert in drawer and 2 x centre doors. Centre glass doors in centre of Hutch standard. Dimensions: 1900 x 465 x 1882 Ask for a PriceDimensions: 1900 x 465 x 1882","label":[[0,39,"PRODUCT"],[111,121,"PRODUCT"]],"Comments":[]}
{"id":1174,"text":"Bean Bag HookDescriptionThese powder-coated stainless hooks are the perfect place to hang your Kyoto XL bean bags when not in use. Simply screw them into a wall or fence, then hang your bean bags to keep them off the ground.Product Features- Easy installation on fences or walls- Ideal for hanging bean bags for space saving and keeping cleanMaterials & Finishes- Powder-coated stainless steelShippingFree shipping worldwide. Leadtime of 7-14 days depending on location. Lead times on request for larger commercial ordersReturns & ExchangesWe'd like you to be 100% satisfied with the product(s) you've purchased from us. If your purchase is not to your liking, you can return it to us within 14 days for a full refund or an exchange. Full details on returns.","label":[[0,13,"PRODUCT"]],"Comments":[]}
{"id":1175,"text":"Albert : Sofa$1,890.00$1,890.00The Albert sofa is a luxurious piece of furniture featuring removable seat, back and side cushions with timber legs. Upholstered in 100% Polyester Velvet with a solid timber frame, no sag springs and high resilient foams.Available in 3, 2 & 1 seater option.Made to order in a range of fabric colours, allow 10-12 weeks for delivery.","label":[[0,13,"PRODUCT"],[38,49,"PRODUCT"]],"Comments":[]}
{"id":1176,"text":"Showing 33–48 of 988 resultsSorted by latest-Sale!$12,799.00 Original price was: $12,799.00.$9,599.00Current price is: $9,599.00.Our Heaven Cabana combines modern innovation with classic design, creating the perfect ambiance for relaxation and entertainment. Built with a contract-grade welded aluminum frame and finished with premium Tiger brand powder coating, the Heaven Cabana is designed for long-lasting outdoor durability. It features a UV-treated, waterproof outdoor acrylic fabric — offering superior protection from the…-Sale!$1,215.00 From: $999.00This solid fiberglass market umbrella is manufactured using the most resilient materials available. The half-inch thick fiberglass ribs allow the frame to bend and flex easily in windy conditions, while the durable aluminum center pole, and maintenance-free resin and stainless-steel parts ensure this umbrella will provide years of worry-free shade. This is the ONLY crank…-Sale!$1,215.00 From: $999.00This solid fiberglass market umbrella is manufactured using the most resilient materials available. The half-inch thick fiberglass ribs allow the frame to bend and flex easily in windy conditions, while the durable aluminum center pole, and maintenance-free resin and stainless-steel parts ensure this umbrella will provide years of worry-free shade. This is the ONLY crank…-Sale!$799.00 Original price was: $799.00.$599.00Current price is: $599.00.weight: 75lbs base diameter: 24″ base height: 0.5″ stem diameter: 1.5″ stem height: 16″ total height: 16.5″ Pair with Frankford’s Monterey 6.5×6.5′ Square 9′ Octagan, 8×10′ Rectangle Market Umbrellas Manufacturer: Frankford Get Inspired. Click here to view the Frankford Catalog.-Sale!$799.00 Original price was: $799.00.$599.00Current price is: $599.00.weight: 75lbs base diameter: 24″ base height: 0.5″ stem diameter: 1.5″ stem height: 16″ total height: 16.5″ Pair with Frankford’s Monterey 6.5×6.5′ Square 9′ Octagan, 8×10′ Rectangle Market Umbrellas Manufacturer: Frankford Get Inspired. Click here to view the Frankford Catalog.-Sale!$2,027.00 From: $1,670.00This solid fiberglass market umbrella is manufactured using the most resilient materials available. The half-inch thick fiberglass ribs allow the frame to bend and flex easily in windy conditions, while the durable aluminum center pole, and maintenance-free resin and stainless-steel parts ensure this umbrella will provide years of worry-free shade. This is the ONLY crank…-Canvas Candy Rainbow Colours in the Rain painting is now on sale! Reg: $439 Now: $279 Dimensions: W40 H55 Floor model item. All items are first come, first serve and final sale. No holds. SOLD AS IS ✔️ Please visit our showroom or call to purchase items.-Leftbank Art Heart to Heart painting with glass epoxy coat is now on sale! Reg: $1,899 Now: $999 Dimensions: W40 H55 Floor model item. All items are first come, first serve and final sale. No holds. SOLD AS IS ✔️ Please visit our showroom or call to purchase items.-Leftbank Art Dream in Colours painting with glass epoxy coat is now on sale! Reg: $1,499 Now: $999 Dimensions: W36 H50 Floor model item. All items are first come, first serve and final sale. No holds. SOLD AS IS ✔️ Please visit our showroom or call to purchase items.-Calia Italia Zip Modular Armless Chair now on sale! Reg: $1,885 Now: $1,299 Dimensions: W32 D38 H35 SH16.5 Floor model item. All items are first come, first serve and final sale. No holds. SOLD AS IS ✔️ Please visit our showroom or call to purchase items.-Gamma Harley Swivel Chair now on sale! Reg: $8,869 Now: $3,499 Dimensions: W31 D31 H33 SH16 Floor model item. All items are first come, first serve and final sale. No holds. SOLD AS IS ✔️ Please visit our showroom or call to purchase items.-Rolf Benz RB50 Sofa with manual backrest adjustment now on sale! Reg: $24,329 Now: $9,999 Dimensions: W91.7 D36.6-43.7 H33 SH16 Floor model item. All items are first come, first serve and final sale. No holds. SOLD AS IS ✔️ Please visit our showroom or call to purchase items.-Rolf Benz 384 Armchair now on sale! Reg: $3,798 Now: $1.299 Dimensions: W29.5 D32 H29 Floor model item. All items are first come, first serve and final sale. No holds. SOLD AS IS ✔️ Please visit our showroom or call to purchase items.-Discipline Tilt Ladder now on sale! Reg: $2,070 Now: $899 Dimensions: W18.5 H75.6 Floor model item. All items are first come, first serve and final sale. No holds. SOLD AS IS ✔️ Please visit our showroom or call to purchase items.-Bontempi Nata Chairs now on sale! Reg: $2,676 Now: $1,599 Dimensions: W19.3 D22.4 H32.7 SH18.9 Floor model item. All items are first come, first serve and final sale. No holds. SOLD AS IS ✔️ Please visit our showroom or call to purchase items.-Calligaris Mag Buffet now on sale! Reg: $5,509 Now: $2,799 Dimensions: W73 D19 H32 Floor model item. All items are first come, first serve and final sale. No holds. SOLD AS IS ✔️ Please visit our showroom or call to purchase items.","label":[[137,150,"PRODUCT"],[578,604,"PRODUCT"],[2110,2136,"PRODUCT"],[2476,2525,"PRODUCT"],[2733,2769,"PRODUCT"],[3001,3039,"PRODUCT"],[3271,3309,"PRODUCT"],[3529,3566,"PRODUCT"],[3772,3791,"PRODUCT"],[4051,4073,"PRODUCT"],[4288,4310,"PRODUCT"],[4521,4541,"PRODUCT"],[4767,4788,"PRODUCT"]],"Comments":[]}
{"id":1179,"text":"$849.00Notify me when this product is available:Desks can either stand alone or grouped together to provide a benching solution.Choose between black or white powder coated steel base.","label":[[50,54,"PRODUCT"]],"Comments":[]}
{"id":1181,"text":"12 years ago my sweet darling Charlene left and took our seven kids with her, I was devastated to say the least.Fast-forward 10 years of pain and no hope, little ol me happens to stumble upon this piece of art. This is the spark I needed to find joy in the little things in life once again.It was like a switch was flipped overnight, I know longer mourned my past life with Charlene. I took this new spark as a sign to head down to the local tavern. There I met a kind man named Bill. He was wonderful and introduced me into the swingers scene. Within days I had compiled an exquisite roster of charming ladies, it seemed that this couch sure was a hit! The only downside was I struggled lasting a satisfactory time due to the dazzling purple eyes of the gorilla staring into mine.To this day I continue to enjoy the comfort of these ladies on the couch, and as a plus the kids all love piling up on it for movie night when they come and visit!I did a lot of research on Jubilee leather sectionals over a year before I pulled the trigger and purchased one. I most worried about the build quality, comfort and possible shipping damage after reading some negative reviews online. With that being said. I received my Bewley white Italian leather sectional (in stock) exactly 30 days including the day I ordered it to the day it was delivered (NV to OH). The ONLY issue I had was the delivery people said they would deliver it between 8 AM to 12 PM and they did not deliver it until 4:40 PM. However, they did a great job bringing in the sectional pieces and were very courteous. Definitely make sure you pay extra to have them bring the pieces in. I unwrapped the pieces and put the pieces together by myself easily. There was no shipping damage. I could not find a single defect anywhere, it was perfect and I was blown away by the build quality and it being stunningly beautiful. It is more beautiful in person than in pictures or video. You will not find a sectional anywhere else like this modern style. This is a high quality sectional. As far as comfort, it is firm being brand new. On a scale of 0 to 10 in terms of comfort, I would say a 5. However, I expected that from reading the reviews, they say the more it wears in over time the more comfortable it will get. It is not uncomfortable, just firm and when you adjust the headrest up it is more comfortable. The build quality is a 10. The white leather is not glove soft but a much more durable leather, so it should last long. Overall, I'm very pleased and get high praise from friends and family for its beauty and aesthetic appeal. I highly recommend this Jubilee Bewley leather sectional from my experience so far.I ordered the chair for me and john pork to chill but tim cheese came and took john pork, then bombardilo crocodilo flew and bombed the chair, my brother got stuck but tralalero tralala saved me and ran away to the forrest but brr brr patapim ran after me and i am stuckso i oredered him with pink fuz for the huzz but yesturday i caught my brother absolutley gooning on it so the gorrila was like heck no aliveanized himself and the roof went kaboomey i swear ro i need a refund and the companys being sued for killing my brother proffeser pork and damaging my 20,000,000,000,000,000,000,000,000,000,000,000,000 dolar house and becasue my monkey is now gooning gone im so sad i think im gonna mew myself to sleepI had only intended to fetch a glass of water. A simple errand, driven by the parched desperation that accompanies a fitful night’s sleep. But what I found in the den on that wretched night has since clung to my mind like a cursed algorithm, looping endlessly in grotesque perpetuity.It was the dead of night, the house swathed in the sort of silence that leaves one straining to hear the phantom chimes of non-existent Discord notifications. My descent down the staircase was cautious, each step cushioned by the thin veneer of carpet laid bare from years of neglect.The den should have been empty. I should have been greeted only by the cold glow of the television, left on by some act of absentmindedness. But as I drew closer, I became aware of a sound—low, guttural, and punctuated by words strung together like errant memes vomited forth from a corrupted AI.“Bingus… Bingus… the drip immaculate…”My father’s voice. But not his voice. No, it was distorted—laced with a mania so profound that I scarcely recognized it. I rounded the corner, throat clenched tight with a horror I could scarcely comprehend.And there he sat. Skeet Johnson, my father. Perched upon that damned Gorilla Chair as if it were some foul throne of delirium.Its form was meant to mimic a silverback gorilla, molded in the act of a triumphant roar. But to my eyes, it appeared as a beast of torment, its exaggerated musculature cradling my father in an embrace far too intimate. The arms of the chair wrapped around him like a lover’s desperate grasp, locking him in a ritual of depravity I could not fathom.“Father?” I croaked, my voice feeble. He scarcely reacted, his eyes glued to some unseen reverie like a YouTube reaction channel feeding on endless, vapid content.“Caught slippin’, eh, son?” he cackled, the sound unnatural and jagged. “This… this is the true grindset. The ultimate rizz.”“What are you talking about?” I whispered, clutching my own arms as if to ward off the chill seeping into my bones. “You look… mad.”“Madness?” he laughed, a laugh so discordant and vile it reminded me of a bass-boosted meme blasted through cheap Bluetooth speakers. “No, son. This is the drip. The forbidden sauce. The way Baby Gronk rizzed up Livvy Dunne, but, like, on a spiritual plane. I’m edging on enlightenment itself.”I stood there, paralyzed, the raw stench of vape clouds and Taco Bell Baja Blast clinging to the air. His eyes were wild, his pupils swollen to inky chasms that swallowed all traces of reason.“Father, you’ve lost yourself!” I screamed, though my voice cracked like a low-quality Vine snippet dredged from the depths of some forgotten meme archive.“I’ve ascended, boy,” he ranted, his hands grasping the gorilla’s foam-muscled arms as though drawing sustenance from them. “The Gorilla Chair, it’s a lifestyle. A state of mind. The primal Goon.”“No… no, this is madness!” I stumbled backward, desperate to flee. My father’s twisted form remained hunched upon the throne, eyes glazed and mouth agape with a joy so monstrous it twisted my stomach into knots.“Go on, Skid. Run,” he sneered, his voice already fading into a deranged mumble. “But know this—the Gorilla Chair calls to us all. It’s inevitable.”I bolted from the den, abandoning my quest for water. Instead, I sought refuge beneath my covers, the darkness of my room a fragile sanctuary against the madness that had overtaken my father.Even now, weeks later, I hear him at night—rambling from the den, his words incomprehensible yet threaded with that same sickly cadence of obsession. And I fear, deep down, that his prophecy may be true.For sometimes, in the shadows of my dreams, I can feel it. The cold, terrible lure of the Gorilla Chair.","label":[[4579,4592,"PRODUCT"],[6563,6576,"PRODUCT"]],"Comments":[]}
{"id":1182,"text":"Shop now, pay in 3 interest-free instalments or in 30 days | What is Klarna?Mirrored FurnitureFurniture CollectionsMirrored Bedside Table » 3 Drawers » Silver Antique Finish » Charleston£245.00 GBPOne of our BESTSELLERS. Grab it while you still can!Carnaby Mid Century Furniture » White Sideboard£199.50 GBP £799.50 GBPNEW ARRIVALS. Chest of drawers with cupboards.Drinking Glasses TypesDrinking Glasses Collections£69.65 GBP £99.50 GBP You save: 30% ( £29.85 GBP )A great choice for your living room or beside a bed, the table's mirrored top and geometric leg design give it a light, airy look that doesn't dominate a space. Perfect for a number of uses ranging from a laptop table to a sofa table.| Size | 60cm H x 25cm W x 40cm D || Weight | 2.8kg || Shape | Rectangle || Material | Metal and mirror || Colour | Silver |Collections: All InVogue Bedsides And Side Tables Art Décor Half price Interior Design Interiors InVogue Bestsellers Mirrored Bedside Tables Mirrored Furniture For Hallway Mirrored Furniture For Living Room Mirrored Furniture Selection Mirrored Furniture Selections Mirrored Side Tables On SaleType: FurnitureCategory: Art Décor bestseller contemporary living room furniture laptop table mirrored selection mirrored side table regular sale side tableGreat little multipurpose table that’s really good quality especially for the price. Very happy with my purchaseOrdered a sofa table to match the rest of the mirrored furniture in my lounge and it matches perfectly. Great quality for the price.The final touch of class that you've always wanted. Bring glamour and elegance to your home with mirrored furniture that look astonishing in any interior.Great little multipurpose table that’s really good quality especially for the price. Very happy with my purchaseOrdered a sofa table to match the rest of the mirrored furniture in my lounge and it matches perfectly. Great quality for the price.","label":[[118,140,"PRODUCT"],[254,283,"PRODUCT"],[339,370,"PRODUCT"],[680,708,"PRODUCT"],[856,872,"PRODUCT"],[877,888,"PRODUCT"],[955,979,"PRODUCT"]],"Comments":[]}
{"id":1183,"text":"Towel \/ Blanket Ladder- European White Oak- 1820 x 640 x 40 (mm)- Ships within 2 weeks (4-6 weeks when out of stock)","label":[[8,22,"PRODUCT"]],"Comments":[]}
{"id":1185,"text":"ShopProductsContractStudioPOSITION ConceptProducts searchShopProductsContractStudioPOSITION ConceptCel CollectionBerrii CollectionPran CollectionPriy CollectionPatala Floor LampRog Wall LampWe use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it.Ok","label":[[125,142,"PRODUCT"],[143,158,"PRODUCT"],[159,174,"PRODUCT"],[175,192,"PRODUCT"],[193,206,"PRODUCT"]],"Comments":[]}
{"id":1188,"text":"White Wood Dining TableOriginal price$409.99-Original price$409.99Original price$409.99$409.99-$409.99Current price$409.99Create a modern industrial minimalist look to your dining space or kitchen area with this white wood dining table.The rectangular top is finished in a stylish glossy white, while the sleek track chrome metal legs with an x base design elevate the look to a whole new level. Ideal for small spaces, eat in kitchens or lofts this dining and task table will continue to be in style for years to come, and can be paired with a variety of modern\/contemporary chair options.Highlights:- Contemporary design for today's dining\/work spaces- Sturdy stylish chrome metal legs- Spacious table top in a glossy white finish- Comfortably seats up to 4 people- Versatile table for a casual or formal dining room, kitchen, or work area- Chairs sold separatelySpecifications:Size \/ Weight: W 36\" \/ D 48\" \/ H 30\" \/ 44 lb.Color: WhiteMaterials: WoodAssembly required: YesStyle: ModernLBS: 50","label":[[0,23,"PRODUCT"]],"Comments":[]}
{"id":1189,"text":"+91 9828818968info@driftingwood.inF248\/A, Road NO. 6 RIICO, Ratangarh, Rajasthan 33102200HomeBEDROOMBedsKing Size BedsQueen Size BedsSingle BedsStorage & AccessoriesBedside TableSideboard CabinetsTv cabinetsTV UnitLamp And LightingLIVING ROOMSofa3+1+1 Sofa SetSeating & ChairsTableNesting TablesCoffee TableDecorsSOFASSofa Sets3 Seater SofaSeatingSofa Cum BedsDINING ROOMDining Tables SetsDining Table 6 SeaterDining Table 4 SeaterDining TablesChairsDining ChairsBar FurnitureSTUDY & OFFICEStudy Table & ChairFolding Study TableStudy\/Office Desk & ChairNEW ARRIVALSCUSTOM FURNITUREDEAL OF THE DAYSign inSearchAccountLogin0wishlist0In CartCategoryBEDROOMLIVING ROOMSOFASDINING ROOMSTUDY & OFFICEHomeBEDROOMBedsKing Size BedsQueen Size BedsSingle BedsStorage & AccessoriesBedside TableSideboard CabinetsTv cabinetsTV UnitLamp And LightingLIVING ROOMSofa3+1+1 Sofa SetSeating & ChairsTableNesting TablesCoffee TableDecorsSOFASSofa Sets3 Seater SofaSeatingSofa Cum BedsDINING ROOMDining Tables SetsDining Table 6 SeaterDining Table 4 SeaterDining TablesChairsDining ChairsBar FurnitureSTUDY & OFFICEStudy Table & ChairFolding Study TableStudy\/Office Desk & ChairNEW ARRIVALSCUSTOM FURNITUREDEAL OF THE DAYMy Cart×Sub-Total :₹ 0Total :₹ 0View CartHomeCategorySort byPositionPrice, low to highPrice, high to lowNo products availableFilter Products ByPrice Range0000 - 999910000 - 3999940000 - 69999Talk to our experts forbest furniture advice+91 7737419124","label":[[260,264,"PRODUCT"],[265,279,"PRODUCT"],[297,302,"PRODUCT"],[318,330,"PRODUCT"],[354,367,"PRODUCT"],[421,442,"PRODUCT"],[443,464,"PRODUCT"],[529,548,"PRODUCT"],[549,568,"PRODUCT"],[569,594,"PRODUCT"],[836,849,"PRODUCT"],[881,888,"PRODUCT"],[924,938,"PRODUCT"],[956,961,"PRODUCT"],[977,989,"PRODUCT"],[1013,1026,"PRODUCT"],[1061,1073,"PRODUCT"],[1080,1101,"PRODUCT"],[1102,1114,"PRODUCT"],[1124,1136,"PRODUCT"],[1138,1143,"PRODUCT"],[1145,1157,"PRODUCT"],[1188,1199,"PRODUCT"],[1202,1207,"PRODUCT"]],"Comments":[]}
{"id":1190,"text":"French Round Back Dining Chair,Save 67%Original Price$1,499.00Current Price$499.00- French Round Back Dining Chair, White FCF688CH-000-RD-QA-WH- Brand > Royal French Furniture- Colour > White- Material Type > Solid Timber, Cotton Fabric, Foam- Measurement Dimension > 54cm W x 57cm D x 104cm H- Assembly > Fully Assembled- Upholstered Seat > Yes- Stackable > No- Foldable > NoFor Shipping to Other Countries and Overseas please kindly email us at frenchfurn@gmail.com","label":[[0,30,"PRODUCT"],[90,120,"PRODUCT"]],"Comments":[]}
{"id":1191,"text":"“Absolutely in love with the fine detailing in these chairs. This Scandinavian modern look is so underrated and the real wood on these chairs makes a huge difference.”Featured CollectionsAmara Dining ChairCrafted from solid wood, this piece showcases a semi-upholstered backrest, blending mid-century elegance with Scandinavian influence for a timeless and refined aesthetic.The Werner Extendable Dining TableCrafted from solid wood and features a sleek, oval design that embodies mid-century elegance with a rich walnut finish.ROOM CONCEPTSThe Kace Dining TableThe Haven Sideboard4.8Based on reviews across all productsTess M.“I am genuinely astounded to discover a high-end product that offers exceptional value for its price. It perfectly aligns with our vision of delivering top-notch design without compromising on quality or affordability.”Ksenia B.“Love these chairs, the quality is certainly there especially at this price typically designed furniture can get a bit pricy if your paying for design only glad the quality matched and exceeded the price point.”Devon B.“The marble and wood quality exceeded my expectations – truly impressive craftsmanship. Delivery was seamless and hassle-free, making the whole experience even better. I highly recommend both the product and the company!”Arvind V.“This bed frame has exceeded all my expectations. The craftsmanship is impeccable, with a sturdy build that gives me peace of mind. The design is very MCM and timeless, making it the perfect centerpiece for my bedroom.”Jaiya G.“Extremely heavy and well-built, this piece exudes quality. The design is minimalist yet perfectly embodies mid-century modern aesthetics. Highly recommend!”Ryder D.“The lift-top mechanism is incredibly easy to operate, making it so convenient for daily use. The construction feels solid and durable, ensuring lasting quality.”Caleb N.","label":[[189,207,"PRODUCT"],[379,413,"PRODUCT"],[548,569,"PRODUCT"],[570,589,"PRODUCT"]],"Comments":[]}
{"id":1192,"text":"This handmade copper coat hook is made using copper pipe and African Sapele hard wood timber.The pictures show 6 individual coat hooks and the price shown is for a single coat hook. Please use the drop down menu to select the required amount when ordering. There are discounts for multiple hangers.Your coat hook(s) will be Polished & Lacquered and will maintain their bright copper colour and reflective shine.DIMENSIONSOverall measurements -H: 200mmD: 100mmW: 70mmCUSTOMISATIONPlease contact us if you would like to explore custom options, or discuss measurements and finishes. Please note that custom measurements and requirements will usually cost more.INSTALLATIONWhere possible try to install the item on a solid masonry wall. For this we recommend to use 2”8’s screws and red plugs using a 5.5mm drill bit to make the fixing holes. For Stud walls (Plasterboard), we recommend you use either an appropriate plasterboard fixing, fix into existing studs\/timber batons or install a suitable sheet of plywood within the wall.ADVICEThe appearance of copper, brass and timber finishes may differ from the images attached. However it will be made using the exact same materials and we will make your order as close to the images as possible. Dimensions stated are approximate and suitable tolerances\/clearance space around this unit should be considered. We test each initial design we make. However we cannot guarantee what the strength of the piece will be. We advise that the item is not placed under heavy loads and not subject to high forms of stress.DELIVERYItems are made to order and dispatched within 1-2 weeks. Tracking IDs will be emailed to you at the point of dispatch to allow you to track your order through to delivery.UK - £10Europe* - £15North America* - £30*If ordering more than one item please get in touch for revised delivery costs.","label":[[5,30,"PRODUCT"],[305,314,"PRODUCT"]],"Comments":[]}
{"id":1194,"text":"- Home- YOYO Gift VoucherYOYO Gift VoucherRelated ProductsVintage NZ Map CoastersVintage NZ Map Coasters$6.00A fun and colourful collection of coasters featuring Vintage NZ Map extracts of New Zealand regions. The coasters are heat resistant, hard wearing and an ideal gift to send by post. Wipe clean only. Sold individually. Material print on coated MDF, cork backed Size 100Dia mm Check out other placemats & coastersRimu Bottle OpenerRimu Bottle Opener$39.00The Rimu Bottle Opener handcrafted from recycled NZ rimu and a genuine NZ nail is a winning combination. It is magnetised with one magnet to attach the opener to the fridge, so you always know where it is; and one magnet to hold the cap once released, so you don’t have to bend down and pick it up off the floor. You shouldn't have any trouble ope...Vintage NZ Map PlacematsVintage NZ Map Placemats$14.00A fun and colourful collection of placemats featuring Vintage NZ Map extracts of New Zealand regions. The placemats are heat resistant, hard wearing and an ideal gift to send by post. Wipe clean only. Sold individually. Material print on coated MDF, cork backed Size 290Dia mm Check out other placemats & coastersWooden Soap KeeperWooden Soap Keeper$15.00Make sure your soaps are looking and feeling their finest. Each handcrafted Wooden Soap Keeper is unique, and will vary in terms of the dimensions, grain, knots and patina from previous life as a floorboard (Rimu only). That's what makes them so special. Care for yours by rinsing with water and leaving to dry in the sun. Material sustainably sou...Dibber Planting ToolDibber Planting Tool$19.00Reintroducing an old fashioned gardening tool that makes the planting of vegetables, bulbs and crops much easier. With grooves that indicate planting depths of 5, 10 and 15cm, simply insert Dibber into the soil to make a hole, rotate to make a larger hole, remove and then plant your various plants or bulbs. Made in New Zealand Material sustainab...Felt Ball Coasters (Set of 4)$32.00These gorgeous Felt Ball Coasters (set of four) are handcrafted in Nepal, using 100% NZ wool and non-toxic dyes, and beautifully tied-up in leather. Machine washable on a wool cycle. Please note, due to the natural handmade nature of this product, colour and diameter can vary slightly. Material 100% NZ wool (hand-felted in Nepal), non-toxic dyes...Te Reo Ceramic CoasterTe Reo Ceramic Coaster$8.00Cork backed, Te Reo Ceramic Coaster featuring simple Te reo Māori expressions. Material ceramic, cork (back) Size 100Dia x 6D mmFelt Dryer Balls (Set of 3)Felt Dryer Balls (Set of 3)$29.00Add these Felt Dryer Balls (set of 3) into your tumble dryer to significantly reduce drying time and save on energy costs. They will absorb moisture and separate your laundry, allowing hot air to circulate more freely. Not only will your laundry dry faster, these Felt Dryer Balls reduce static and naturally soften fabric. Air-dry the balls betwe...Felt Ball Pot StandFelt Ball Pot Stand$49.00This gorgeous Felt Ball Pot Stand is handcrafted in Nepal, using 100% NZ wool and non-toxic dyes. It makes a perfect addition to a table setting, not only protecting surfaces from hot dishes, but also adding a touch of texture to the space. Machine washable on a wool cycle. Please note, due to the natural handmade nature of this product, colour ...Thirsty Dog Drink BottleThirsty Dog Drink Bottle$59.00Thirsty Dog Drink Bottle is an elegant, reusable drinking reservoir tailored for your pooch. You can hydrate any sized dog in style, on demand, anywhere you and your best 'friend' go. Fully leak-proof thanks to a unique water locking valve system, Thirsty Dog Drink Bottle is convenient and easy to use. Simply fill the cup with water from the pre...Jamb Bookends (Set of 2)Jamb Bookends (Set of 2)$89.00Less is More - a simple pair of Jamb bookends (set of 2) will hold your books or vinyl (as is the case with Mr YOYO) in place with unassuming style and effectiveness. Indoors use only. Material powder-coated steel Size 160 x 180 x 110 mm This product can be tailor-made. It may be an option to change the dimensions, colour, material, or upholste...Tiki HookTiki Hook$49.00Looking for somewhere to hang your coat? Look no further than Tiki Hook, a clever twist on the iconic east Polynesian figure - the Tiki is a symbol of good luck. Tiki Hook was inspired by the wonderfully carved figures on the walls of a Waitangi Marae. Material galvanised steel 1.95mm thick; powder-coated for indoor or outdoor use Size 90W x 60D...","label":[[9,26,"PRODUCT"],[27,44,"PRODUCT"],[62,85,"PRODUCT"],[86,109,"PRODUCT"],[169,183,"PRODUCT"],[428,446,"PRODUCT"],[447,465,"PRODUCT"],[477,495,"PRODUCT"],[824,848,"PRODUCT"],[849,873,"PRODUCT"],[935,949,"PRODUCT"],[1195,1213,"PRODUCT"],[1214,1232,"PRODUCT"],[1591,1611,"PRODUCT"],[1612,1632,"PRODUCT"],[1991,2009,"PRODUCT"],[2042,2061,"PRODUCT"],[2379,2401,"PRODUCT"],[2402,2424,"PRODUCT"],[2444,2466,"PRODUCT"],[2974,2993,"PRODUCT"],[2994,3013,"PRODUCT"],[3035,3054,"PRODUCT"],[3372,3396,"PRODUCT"],[3397,3421,"PRODUCT"],[3677,3701,"PRODUCT"],[3780,3793,"PRODUCT"],[3805,3818,"PRODUCT"],[3869,3882,"PRODUCT"],[4187,4196,"PRODUCT"],[4197,4206,"PRODUCT"],[4276,4285,"PRODUCT"],[4376,4385,"PRODUCT"]],"Comments":[]}
{"id":1195,"text":"Nature takes form in the Primavera bed—an intricate composition of leaves and floral curves, hand-finished in soft gold. A Choufani signature and client favorite.Includes headboard, steel bed frame, wooden slatsMattress is sold separatelyDimensions: 205 L x 205 W x 191 H (cm)Color: Antique gold paintMaterial: Wrought IronUAE Orders:Delivery time within 7 working days.GCC Ordes:Delivery time within 14 working days for small goods and 21 working days for furniture.To know more about our shipping policy, click here.","label":[[24,38,"PRODUCT"]],"Comments":[]}
{"id":1197,"text":"(07) 5504 7313 | info@ofo.com.au | Harvey Norman Centre, 29-45 Ashmore Road, BundallGREYSKU: 10928Price: $399.00 $599.0010928What better way to unwind and relax than being suspended in a pod chair. These are great space-saving options for any outdoor area and will instantly relax you once seated as the pod cocoons the body.Designed for covered alfresco\/terrace (not designed to be exposed to the elements)At OFO, we pride ourselves on offering the best value in outdoor furniture on the Gold Coast and in Brisbane. Our prices are highly competitive, especially considering the premium quality and stylish designs we offer. We work hard to keep our prices affordable so our customers can create their dream outdoor living spaces without breaking the bank.With one of the highest customer ratings of any outdoor furniture store in the region, you can shop with confidence knowing you're getting an incredible combination of quality, style and value. Our large selection means you'll find the perfect pieces for your space at prices that fit your budget.While we can't claim to always have the absolute lowest prices on every item, we do aim to provide the best overall value in the industry when you factor in our great designs, top-notch materials and construction, and helpful, friendly service. We encourage you to compare our offerings to other retailers - we're confident you'll find that OFO delivers an unbeatable mix of quality, style and affordability.So if you're looking for high-end outdoor furniture at down-to-earth prices, you've come to the right place. With OFO's always incredible pricing, you can transform your backyard into a beautiful oasis at a cost that will make you smile. Visit our showroom or shop online today and see the OFO difference for yourself!*Call us to confirm that we're displaying this item right now.Have a Question? Call Us (07) 5504 7313Okay, so you've probably checked out a few of our products online by now. Just like thisHanging Pod Chair - Outdoor Hanging Chair. You've probably seen photos of our stunning outdoor furniture designs (we took these happy snaps on the Goldy btw). You may have even watched a few of our videos. Let me tell you, our products look just as good in real life #nofilter.So pop into our Gold Coast store, or give us a call.Come in store or just read our reviews to get a feel for the quality of our furniture. People have been raving about our furniture for years and we've racked up a heck of a lot of 5 star reviews all over the interwebs.Totally instagrammable Outdoor Furniture. If it's in stock on our website, you can pick it up within 24 hours or have it delivered within a couple of days*Want to get some delivery dates for your stunning new Hanging Pod Chair - Outdoor Hanging Chair?We're a family-owned and run business. And we love what we do. We're passionate about helping people like you to create the outdoor space of their dreams. You won't get pushy salesmen here. You'll get honest advice and great service - even after you purchase.Want the Hanging Pod Chair - Outdoor Hanging Chair? If it's listed as in stock, you can get it within days, not weeks. Yep, you read that correctly.","label":[[191,201,"PRODUCT"],[2740,2757,"PRODUCT"],[2760,2781,"PRODUCT"],[3052,3069,"PRODUCT"],[3072,3093,"PRODUCT"]],"Comments":[]}
{"id":1199,"text":"NEXT DAY SHIPPINGBUY NOW & PAY LATER100-DAY MONEY BACK GUARANTEEWhat You Need To Know?You are sure to find a fiberglass bar table elsewhere on the market but don't be fooled by the look! Our tables have subtle yet clever details that really add to their quality and value, meaning our tables are stronger and better performing.Chip & Scratch resistant finishGlossy white solid fiberglass top is coated with transparent polyester sealant to prevent chipping & scratching.Perfect combination of function and formA velvet floor protection pad is attached to the bottom of the base to prevent the floor from scratching.THE FINER DETAILSPRODUCT DESCRIPTIONInspired by the original design the tulip bar table is one of the most popular, and certainly one of the most beautiful pieces in our mid-century collection. The table features a round solid fiberglass top and a lacquered metal base. Its compact size has space for up to 3 to 4 stools.Construction: The solid fiberglass top is 1.5\" thick and heavy, giving balance to the unique table base. True to the original design the metal base is a perfect combination of function and form. Both fiberglass top and metal base are coated with a scratch and chip-resistant finish. A velvet floor protection pad is attached to the bottom of the base to prevent the floor from scratching.PRODUCT DETAILS- Product Dimensions: 32\"L x 32\"W x 43.3\"H in- Table Base Bottom: 23\"W in- Table Top Thickness: 1.5\" in- Weight: 95 lbs- Material: Fiberglass, Metal- Commercial Grade: Yes- Assembly: Light assembly required- Warranty: 1 Year","label":[[332,363,"PRODUCT"]],"Comments":[]}
{"id":1201,"text":"Natural Geo Jasmine Modern Wavy Abstract Gray\/Black Area RugNatural Geo Jasmine Modern Wavy Abstract Gray\/Black Area RugJust the right amount of abstract to add a stylish vibe to your room without overpowering. Several shades of appealing colors in modern and abstract designs bring a splash of newness to your home. The machine-woven technique offers durability, making it well suited for both low and high traffic areas. Woven of high quality polypropylene, this area rug will continue to look dazzling over the years. The soft feel of the fibers is incredibly comfortable underfoot and embraces a cozy home feeling.- Decorative modern & abstract design, ideal for any room- Machine woven with high quality polypropylene- Soft to the touch & comfortable medium pile height- Finishes your living space beautifully without overpowering- Ideal pile density to withstand foot traffic & easy to cleanCare InstructionsRegular care is essential to the longevity of your rug. Regular vacuuming is recommended without the use of beater bars to avoid threads being pulled. Spills should be absorbed with a dry cloth, then spot cleaned with mild soap and water. It’s normal for loose ends to show up from time to time with any area rug, however it’s important to snip them with a scissor immediately - pulling on loose ends by hand is harmful to the strength of your rug. Rug tolerances can vary by +\/- 3 inches in relation to the advertised size. A non-skid pad is recommended to prevent slippage. Since rugs are rolled for shipping, occasionally they may crease during transit. All creases will disappear within 2 weeks after the rug is laid out flat. Reverse rolling will help flatten out creases promptly.Collection: JasmineDesign: JAS-200AStyle: Modern & AbstractPattern: WavyColors: Gray\/Black\/Ivory\/CreamConstruction: Machine WovenMaterial: 100% PolypropyleneBacking: PlainPile Type: MediumPile Height: 0.45\"Use: IndoorOrigin: Turkey","label":[[0,60,"PRODUCT"],[61,121,"PRODUCT"]],"Comments":[]}
{"id":1203,"text":"Hamptons Style Gift Card$50.00 AUDShopping for someone else but not sure what to give them? Give them the gift of choice with a Hamptons Style gift card.Gift cards are delivered by email and contain instructions to redeem them at checkout. Our gift cards have no additional processing fees.","label":[[0,24,"PRODUCT"],[130,154,"PRODUCT"]],"Comments":[]}
{"id":1205,"text":"Wilhelm Renz Metamorphic Coffee TableFREE SHIPPING to the mainland UK!!! 🚚WILHELM RENZ METAMORPHIC COFFEE TABLEFantastic mid century design from quality German manufacturer. Unknown designer but many famous designers have been employed by Wilhelm Renz over the years. Features two small extensible plates inside the normal tabletop which can be extended from either side. Teak or possibly maple construction. Rare item.DIMENSIONSWidth: 140 cmDepth: 50 cmHeight: 54 cmI would be happy to provide any other measurements, just drop me a line.CONDITION REPORTExcellent vintage condition. There are a few minor marks and faint scratches to the top and legs consistent with age. The pull out sections run well. There is a small bit of damage to one corner of one leaf (pictured). There are some very faint ring marks to the green leaf but nothing too serious. There are no wobbles or loose joints. The metal \"WR\" badge is present. Overall the table has survived very well and is in great, usable condition. Ready for a new home.FREE SHIPPING to the mainland UK!!! 🚚UK delivery times are usually around 1 - 2 weeks depending on location.**Unfortunately my FREE SHIPPING is only available to mainland England, Wales, and parts of Scotland. Some remote areas, Islands, the Scottish highlands and Islands, Northern Ireland etc will require a surcharge. Please contact me for details.Your item will be fully wrapped and protected and transported using my trusted and insured A-to-B furniture couriers. I do not use standard postal services. It will be a one man delivery service and assistance with unloading heavy\/bulky items will be required. A two man delivery could be arranged, contact me for details. Ground floor only unless by previous arrangement. If you have any specific delivery requirements or if I can assist with anything else then drop me a line and I will always help if I can.COLLECTIONIt is also possible for you to collect the item from Worthing, West Sussex (BN14). You can also arrange your own courier if you prefer.INTERNATIONAL SHIPPINGI may also be able to ship overseas, please contact me for a quote.","label":[[0,37,"PRODUCT"],[77,114,"PRODUCT"]],"Comments":[]}
{"id":1210,"text":"Weekender Beach Chairs (with head rest)Meet our Byron 'Weekender' that perfect rattan fold up chair that you can take to the beach or picnics\/parks, camping, bbq's.Light weight, made of natural rattan, with three adjustable reclines to suit your mood.White and Black and White version made from Poly Weave.base 45 x45cmBack rest height 72cm- Care InstructionsOur furniture collections have been hand crafted using a natural material, each piece will have specific care instructions depending on the material of the product you have chosen,i.e. Teak \/ Rattan \/ Bamboo.Using the details in the description please see our Furniture Care Instructions for full details on how to keep your item looking its best!Each piece is unique so variations in colour, markings and finish will occur.Care InstructionsOur furniture collections have been hand crafted using a natural material, each piece will have specific care instructions depending on the material of the product you have chosen,i.e. Teak \/ Rattan \/ Bamboo.Using the details in the description please see our Furniture Care Instructions for full details on how to keep your item looking its best!Each piece is unique so variations in colour, markings and finish will occur.","label":[[0,22,"PRODUCT"]],"Comments":[]}
{"id":1211,"text":"Mexican Hammock£75.00These Mexican style hammocks are made from hundreds of cotton strings that are woven together to give you a soft bed that feels as though you are floating on air.Despite their delicate appearance, a Mayan type hammock like this is extremely stretchy and strong - this size is a technically a single size but it will fit two adults and it is wide enough to lie totally across it (instead of lengthways). With a little bit of care, they should last for years of happy swinging.A Mexican hammock is a stunning addition to any home, indoors or in the garden. It can be hung on trees, posts, pergolas, hooks in the walls and stands, to name but a few...Capacity: 200kgSize: 190cm (w) x 200cm (l)Weight: 1kgSpace (approx): 140-200cm (h) x 300-400cm (l)Includes cotton carry bag (18x22x12cm)FREE UK SHIPPING (2-3 business days)","label":[[0,15,"PRODUCT"]],"Comments":[]}
{"id":1212,"text":"Vintage Industrial Wooden Bar Stool","label":[[0,31,"PRODUCT"]],"Comments":[]}
{"id":1213,"text":"Handcrafted Solid Oak Dining Table with Extension Leaf","label":[[0,45,"PRODUCT"]],"Comments":[]}
{"id":1214,"text":"Scandinavian Leather Recliner Chair in Cognac Brown","label":[[0,42,"PRODUCT"]],"Comments":[]}
{"id":1215,"text":"Modern Glass Top Coffee Table with Chrome Base","label":[[0,38,"PRODUCT"]],"Comments":[]}
{"id":1216,"text":"Rustic Farmhouse Console Table with Distressed Finish","label":[[0,42,"PRODUCT"]],"Comments":[]}
{"id":1217,"text":"Mid-Century Modern Teak Sideboard with Brass Handles","label":[[0,44,"PRODUCT"]],"Comments":[]}
{"id":1218,"text":"Adjustable Height Office Chair with Lumbar Support","label":[[0,42,"PRODUCT"]],"Comments":[]}
{"id":1219,"text":"Wicker Patio Dining Set with Cushions","label":[[0,33,"PRODUCT"]],"Comments":[]}
{"id":1220,"text":"Minimalist Wall-Mounted Floating Shelves","label":[[0,36,"PRODUCT"]],"Comments":[]}
{"id":1221,"text":"Art Deco Velvet Sofa in Emerald Green","label":[[0,31,"PRODUCT"]],"Comments":[]}
{"id":1222,"text":"Convertible Sleeper Sofa with Storage","label":[[0,35,"PRODUCT"]],"Comments":[]}
{"id":1223,"text":"Handwoven Jute Area Rug 8x10 Feet","label":[[0,29,"PRODUCT"]],"Comments":[]}
{"id":1224,"text":"Industrial Pipe Bookshelf with Wooden Shelves","label":[[0,39,"PRODUCT"]],"Comments":[]}
{"id":1225,"text":"Vintage Style Arched Floor Lamp","label":[[0,30,"PRODUCT"]],"Comments":[]}
{"id":1226,"text":"Marble Top End Table with Gold Base","label":[[0,30,"PRODUCT"]],"Comments":[]}
{"id":1227,"text":"Customizable Closet Organizer System","label":[[0,34,"PRODUCT"]],"Comments":[]}
{"id":1228,"text":"Tufted Leather Chesterfield Sofa","label":[[0,30,"PRODUCT"]],"Comments":[]}
{"id":1229,"text":"Foldable Wooden TV Tray Table","label":[[0,30,"PRODUCT"]],"Comments":[]}
{"id":1230,"text":"Handmade Ceramic Table Lamp","label":[[0,26,"PRODUCT"]],"Comments":[]}
{"id":1231,"text":"Outdoor Wicker Sectional with Coffee Table","label":[[0,38,"PRODUCT"]],"Comments":[]}
{"id":1232,"text":"Antique Brass Bed Frame with Upholstered Headboard","label":[[0,44,"PRODUCT"]],"Comments":[]}
{"id":1233,"text":"Modern Floating TV Stand with LED Lighting","label":[[0,38,"PRODUCT"]],"Comments":[]}
{"id":1234,"text":"Hand-Knotted Persian Style Rug","label":[[0,29,"PRODUCT"]],"Comments":[]}
{"id":1235,"text":"Adjustable Standing Desk with Memory Settings","label":[[0,40,"PRODUCT"]],"Comments":[]}
{"id":1236,"text":"Rattan Hanging Egg Chair with Cushion","label":[[0,35,"PRODUCT"]],"Comments":[]}
{"id":1237,"text":"Vintage Inspired Bar Cart with Glass Shelves","label":[[0,39,"PRODUCT"]],"Comments":[]}
{"id":1238,"text":"Contemporary Concrete Dining Table","label":[[0,32,"PRODUCT"]],"Comments":[]}
{"id":1239,"text":"Wall-Mounted Vanity with Integrated Sink","label":[[0,36,"PRODUCT"]],"Comments":[]}
{"id":1240,"text":"Leather Executive Office Chair","label":[[0,28,"PRODUCT"]],"Comments":[]}
{"id":1241,"text":"The Oslo Dining Table features a beautiful solid walnut top with sleek powder-coated steel legs. Available in three sizes to accommodate 4-10 people. The table comes with a 10-year warranty on materials and craftsmanship.","label":[[4,19,"PRODUCT"],[80,102,"PRODUCT"]],"Comments":[]}
{"id":1242,"text":"Our bestselling Harmony Bed Frame is crafted from sustainable oak with an upholstered headboard in your choice of fabric. The frame includes built-in USB charging ports and under-bed storage drawers. King, Queen and Double sizes available.","label":[[15,30,"PRODUCT"],[60,78,"PRODUCT"],[181,194,"PRODUCT"]],"Comments":[]}
{"id":1243,"text":"The Metro Sofa Collection includes a 3-seater sofa, 2-seater loveseat and armchair. Upholstered in premium top-grain leather with high-density foam cushions. The modular design allows for multiple configuration options in your living space.","label":[[4,24,"PRODUCT"],[28,49,"PRODUCT"],[53,71,"PRODUCT"],[130,153,"PRODUCT"]],"Comments":[]}
{"id":1244,"text":"This industrial-style lighting collection features the Edison Pendant Light, Wall Sconce and Table Lamp. Made from hand-blown glass and blackened steel. Each piece is handcrafted and slightly unique. Compatible with smart home systems.","label":[[32,51,"PRODUCT"],[55,68,"PRODUCT"],[72,84,"PRODUCT"],[180,204,"PRODUCT"]],"Comments":[]}
{"id":1245,"text":"The Coastal Outdoor Collection includes the Adirondack Chair, Side Table and Lounge Chair. Made from weather-resistant teak with marine-grade stainless steel hardware. Perfect for poolside, patio or beach house use.","label":[[4,28,"PRODUCT"],[32,50,"PRODUCT"],[54,70,"PRODUCT"],[150,174,"PRODUCT"]],"Comments":[]}
{"id":1246,"text":"Bamboo Bathroom Storage Shelf","label":[[0,27,"PRODUCT"]],"Comments":[]}
{"id":1247,"text":"Smart LED Mirror with Touch Control","label":[[0,30,"PRODUCT"]],"Comments":[]}
{"id":1248,"text":"Vintage Record Player Stand","label":[[0,24,"PRODUCT"]],"Comments":[]}
{"id":1249,"text":"Inflatable Lounger for Camping","label":[[0,26,"PRODUCT"]],"Comments":[]}
{"id":1250,"text":"Hand-Forged Iron Wine Rack","label":[[0,25,"PRODUCT"]],"Comments":[]}
{"id":1251,"text":"The Nordic Collection includes our bestselling Fjord Dining Chair, Mountain Coffee Table and Glacier Sideboard. Crafted from sustainable Scandinavian pine with minimalist design.","label":[[4,22,"PRODUCT"],[53,73,"PRODUCT"],[77,99,"PRODUCT"],[103,122,"PRODUCT"]],"Comments":[]}
{"id":1252,"text":"Organic Cotton Hammock with Spreader Bar","label":[[0,37,"PRODUCT"]],"Comments":[]}
{"id":1253,"text":"Wall-Mounted Cat Shelves","label":[[0,21,"PRODUCT"]],"Comments":[]}
{"id":1254,"text":"Antique Brass Telescope Floor Lamp","label":[[0,32,"PRODUCT"]],"Comments":[]}
{"id":1255,"text":"Hydroponic Indoor Herb Garden Kit","label":[[0,32,"PRODUCT"]],"Comments":[]}
{"id":1256,"text":"The Architect's Desk features a tempered glass top with steel frame and integrated cable management. Available in black or white finish.","label":[[4,21,"PRODUCT"],[60,85,"PRODUCT"]],"Comments":[]}
{"id":1257,"text":"Handmade Moroccan Leather Pouf","label":[[0,28,"PRODUCT"]],"Comments":[]}
{"id":1258,"text":"Retro Smeg Style Mini Fridge","label":[[0,24,"PRODUCT"]],"Comments":[]}
{"id":1259,"text":"Foldable Ping Pong Table","label":[[0,22,"PRODUCT"]],"Comments":[]}
{"id":1260,"text":"Our Outdoor Sectional Set includes the Paloma Sofa, Luna Coffee Table and Stella Side Tables. Made from weather-resistant synthetic rattan with UV-resistant cushions.","label":[[21,44,"PRODUCT"],[48,65,"PRODUCT"],[69,89,"PRODUCT"],[93,113,"PRODUCT"]],"Comments":[]}
{"id":1261,"text":"Japanese Tatami Floor Mattress","label":[[0,29,"PRODUCT"]],"Comments":[]}
{"id":1262,"text":"Crystal Chandelier with LED Lights","label":[[0,31,"PRODUCT"]],"Comments":[]}
{"id":1263,"text":"Vintage Suitcase Side Table","label":[[0,26,"PRODUCT"]],"Comments":[]}
{"id":1264,"text":"The Nomad Collection features foldable furniture perfect for small spaces, including the Voyager Table, Trekker Chair and Explorer Shelf.","label":[[4,21,"PRODUCT"],[72,87,"PRODUCT"],[91,105,"PRODUCT"],[109,125,"PRODUCT"]],"Comments":[]}
{"id":1265,"text":"Geometric Terrarium with Succulents","label":[[0,34,"PRODUCT"]],"Comments":[]}
{"id":1266,"text":"Industrial Pipe Wardrobe Rack","label":[[0,29,"PRODUCT"]],"Comments":[]}
{"id":1267,"text":"Hand-Painted Ceramic Tableware Set","label":[[0,33,"PRODUCT"]],"Comments":[]}
{"id":1268,"text":"The Cloud Collection includes ultra-soft bedding made from 100% organic bamboo fibers, featuring the Dream Duvet, Pillow and Sheet Set.","label":[[4,20,"PRODUCT"],[83,95,"PRODUCT"],[99,107,"PRODUCT"],[111,123,"PRODUCT"]],"Comments":[]}
{"id":1269,"text":"Wall-Mounted Bike Storage Rack","label":[[0,28,"PRODUCT"]],"Comments":[]}
{"id":1270,"text":"Mid-Century Modern Credenza","label":[[0,25,"PRODUCT"]],"Comments":[]}
{"id":1271,"text":"The Smart Home Bundle includes the Echo Light, Nest Thermostat and Ring Doorbell - everything you need to start your smart home setup.","label":[[4,20,"PRODUCT"],[25,38,"PRODUCT"],[42,58,"PRODUCT"],[62,77,"PRODUCT"]],"Comments":[]}
{"id":1272,"text":"Handwoven Seagrass Storage Baskets","label":[[0,32,"PRODUCT"]],"Comments":[]}
{"id":1273,"text":"Adjustable Laptop Bed Tray","label":[[0,27,"PRODUCT"]],"Comments":[]}
{"id":1274,"text":"Vintage Pharmacy Floor Lamp","label":[[0,27,"PRODUCT"]],"Comments":[]}
{"id":1275,"text":"The Chef's Kitchen Island features a stainless steel top, built-in wine rack and locking casters for mobility. Available in three sizes.","label":[[4,24,"PRODUCT"],[28,53,"PRODUCT"],[57,85,"PRODUCT"]],"Comments":[]}
{"id": 1276,"text": "The Metropolitan Office Collection features three ergonomic masterpieces: the Executive Swivel Chair with lumbar support, the Zenith Height-Adjustable Desk with built-in wireless charging, and the Vision Task Lamp with smart light temperature control. All pieces feature a premium brushed aluminum and Italian leather construction.","label": [[4, 35, "PRODUCT"],[80, 106, "PRODUCT"],[110, 153, "PRODUCT"],[157, 190, "PRODUCT"],[294, 317, "PRODUCT"]],"Comments": []}
{"id": 1277,"text": "Our Artisan Kitchen Island combines functionality with rustic charm. The 60-inch wide surface features reclaimed teak wood with live edge detailing, supported by powder-coated iron legs. Includes: 1) Built-in wine rack for 12 bottles 2) Two large storage drawers with soft-close mechanisms 3) Overhead hanging rack for pots and pans 4) Adjustable stainless steel shelving.","label": [[5, 25, "PRODUCT"],[189, 211, "PRODUCT"],[215, 253, "PRODUCT"],[257, 291, "PRODUCT"],[295, 327, "PRODUCT"]],"Comments": []}
{"id": 1278,"text": "The Scandinavian Bedroom Bundle includes: 1) Nordique Platform Bed (queen or king) with integrated nightstands 2) Malmö Dresser with 8 soft-close drawers 3) Fjord Wardrobe with mirrored sliding doors 4) Linen bedding set with pillowcases. All pieces are FSC-certified solid oak with matte black hardware. Available in natural, whitewash, or dark walnut finishes.","label": [[4, 32, "PRODUCT"],[61, 83, "PRODUCT"],[87, 114, "PRODUCT"],[118, 144, "PRODUCT"],[148, 166, "PRODUCT"],[273, 283, "PRODUCT"],[287, 297, "PRODUCT"],[301, 313, "PRODUCT"]],"Comments": []}
{"id": 1279,"text": "For outdoor entertaining, consider our Patio Master Set: 1) 7-piece rattan dining set with weather-resistant cushions 2) Solar-powered LED string lights (24 ft) 3) Ceramic outdoor heater 4) Teak serving cart with removable cutting board. The dining table features a tempered glass top and extends from 55\" to 79\" with included leaf.","label": [[32, 50, "PRODUCT"],[54, 94, "PRODUCT"],[98, 134, "PRODUCT"],[138, 162, "PRODUCT"],[166, 198, "PRODUCT"],[254, 270, "PRODUCT"]],"Comments": []}
{"id": 1280,"text": "The Minimalist Workspace Package contains: 1) Float Wall-Mounted Desk (55\" or 70\") 2) Aeron-inspired Ergo Chair 3) Cable Management System 4) Bamboo Desk Organizer Set. The desk features a solid walnut veneer top with hidden steel brackets that support up to 200 lbs. Chair includes adjustable armrests and breathable mesh back.","label": [[4, 32, "PRODUCT"],[56, 80, "PRODUCT"],[84, 104, "PRODUCT"],[108, 133, "PRODUCT"],[137, 162, "PRODUCT"],[220, 240, "PRODUCT"],[244, 277, "PRODUCT"]],"Comments": []}
{"id": 1281,"text": "Transform your bathroom with our Spa Collection: 1) Freestanding Soaking Tub (60\" acrylic) 2) Rainfall Shower System with handheld wand 3) Teak Bath Caddy 4) Heated Towel Rack (24\") 5) Natural Stone Vessel Sink. All plumbing fixtures available in brushed nickel, oil-rubbed bronze, or matte black finishes.","label": [[30, 45, "PRODUCT"],[49, 86, "PRODUCT"],[90, 106, "PRODUCT"],[110, 132, "PRODUCT"],[136, 161, "PRODUCT"],[203, 220, "PRODUCT"],[224, 243, "PRODUCT"],[247, 259, "PRODUCT"]],"Comments": []}
{"id": 1282,"text": "Our Smart Nursery System includes: 1) Convertible Crib (transforms to toddler bed) 2) Wi-Fi Enabled Baby Monitor 3) Glider Recliner with USB charging 4) Modular Storage Unit 5) Dimmable Night Light Projector. The crib meets all JPMA safety standards and comes in white, gray, or natural wood finishes.","label": [[5, 24, "PRODUCT"],[28, 70, "PRODUCT"],[74, 110, "PRODUCT"],[114, 134, "PRODUCT"],[138, 164, "PRODUCT"],[222, 237, "PRODUCT"],[241, 251, "PRODUCT"],[255, 270, "PRODUCT"]],"Comments": []}
{"id": 1283,"text": "The Entertainer's Bar Package features: 1) 72\" Quartz Countertop Bar 2) Backlit Glass Display Shelving 3) Under-counter Beverage Cooler 4) 4 Swivel Bar Stools 5) Professional Cocktail Tool Set. The bar unit includes lockable storage for liquor bottles, integrated stemware racks, and a built-in ice bucket holder.","label": [[4, 30, "PRODUCT"],[34, 60, "PRODUCT"],[64, 93, "PRODUCT"],[97, 118, "PRODUCT"],[122, 151, "PRODUCT"],[209, 233, "PRODUCT"],[237, 264, "PRODUCT"],[268, 296, "PRODUCT"]],"Comments": []}
{"id": 1284,"text": "For small space living, the Transform Furniture Series offers: 1) Murphy Bed with integrated desk 2) Expandable Dining Table (seats 4-8) 3) Nesting Coffee Tables 4) Stackable Dining Chairs. All pieces feature a lightweight yet durable bamboo construction with space-saving designs. The Murphy bed includes a memory foam mattress.","label": [[32, 55, "PRODUCT"],[59, 91, "PRODUCT"],[95, 118, "PRODUCT"],[122, 144, "PRODUCT"],[148, 169, "PRODUCT"],[237, 251, "PRODUCT"],[255, 285, "PRODUCT"]],"Comments": []}
{"id": 1285,"text": "The Industrial Loft Lighting Collection comprises: 1) Edison Bulb Chandelier (36\" diameter) 2) Pipe Wall Sconces (sold individually) 3) Steel Pendant Lights (various sizes) 4) Vintage-style Floor Lamp. All fixtures use LED-compatible sockets and come with dimmer switches. Finish options include matte black, aged brass, and gunmetal.","label": [[4, 38, "PRODUCT"],[42, 74, "PRODUCT"],[78, 107, "PRODUCT"],[111, 138, "PRODUCT"],[142, 165, "PRODUCT"],[248, 260, "PRODUCT"],[264, 276, "PRODUCT"],[280, 291, "PRODUCT"]],"Comments": []}
{"id":1286,"text":"The Heritage Bookcase Collection features three timeless pieces: 1) The Scholar Standing Bookcase with adjustable shelves 2) The Archive Glass-Door Cabinet 3) The Librarian's Ladder on rolling casters. Crafted from solid cherry wood with hand-rubbed oil finish.","label":[[4,32,"PRODUCT"],[71,106,"PRODUCT"],[110,138,"PRODUCT"],[142,171,"PRODUCT"],[215,228,"PRODUCT"]],"Comments":[]}
{"id":1287,"text":"Professional Chef's Bundle includes: 1) 8-inch Damascus Steel Chef Knife 2) Bamboo Cutting Board with juice groove 3) Magnetic Knife Strip 4) Pepper Mill Set. The knife features a Pakkawood handle and comes with leather sheath.","label":[[25,43,"PRODUCT"],[47,86,"PRODUCT"],[90,115,"PRODUCT"],[119,136,"PRODUCT"],[140,155,"PRODUCT"],[224,238,"PRODUCT"]],"Comments":[]}
{"id":1288,"text":"Our Smart Garden System comprises: 1) Self-Watering Planter Box (3 sizes) 2) Solar-Powered Grow Lights 3) Soil Moisture Sensor 4) Companion Planting Guide. The planters feature recycled plastic construction with drainage layers.","label":[[19,37,"PRODUCT"],[41,78,"PRODUCT"],[82,106,"PRODUCT"],[110,136,"PRODUCT"],[180,205,"PRODUCT"]],"Comments":[]}
{"id":1289,"text":"The Nomad Camping Kit contains: 1) Compact Folding Tent (4-person) 2) Inflatable Sleeping Pad 3) Down-Filled Sleeping Bag (-10°C rating) 4) Collapsible Camp Stove. The tent features aluminum poles and waterproof rainfly.","label":[[4,22,"PRODUCT"],[26,56,"PRODUCT"],[60,89,"PRODUCT"],[93,124,"PRODUCT"],[128,153,"PRODUCT"],[207,221,"PRODUCT"]],"Comments":[]}
{"id":1290,"text":"Luxury Bath Collection includes: 1) Rainfall Showerhead with handheld 2) Freestanding Soaker Tub 3) Heated Towel Rack 4) Vanity Mirror with LED lighting. Available in brushed gold, matte black or chrome finishes.","label":[[21,39,"PRODUCT"],[43,83,"PRODUCT"],[87,107,"PRODUCT"],[111,136,"PRODUCT"],[140,171,"PRODUCT"],[175,187,"PRODUCT"],[191,202,"PRODUCT"]],"Comments":[]}
{"id":1291,"text":"The Baker's Pantry Set features: 1) Marble Pastry Board 2) Rolling Pin with thickness rings 3) Stainless Steel Measuring Cups 4) Silicone Spatula Set. Board includes measuring guide and non-slip base.","label":[[4,25,"PRODUCT"],[29,63,"PRODUCT"],[67,101,"PRODUCT"],[105,126,"PRODUCT"],[130,153,"PRODUCT"]],"Comments":[]}
{"id":1292,"text":"Modern Home Office Package: 1) Electric Standing Desk (48-72\") 2) Ergonomic Mesh Chair 3) Dual Monitor Arm 4) Under-Desk Cable Tray. Desk features programmable height memory and anti-collision system.","label":[[23,43,"PRODUCT"],[47,81,"PRODUCT"],[85,106,"PRODUCT"],[110,129,"PRODUCT"],[133,158,"PRODUCT"],[212,231,"PRODUCT"]],"Comments":[]}
{"id":1293,"text":"The Mixologist's Bar Set includes: 1) Cocktail Shaker Set (18/10 steel) 2) Double Jigger with precise measurements 3) Hawthorne Strainer 4) Muddler 5) Citrus Peeler. Presented in leather-wrapped case.","label":[[4,28,"PRODUCT"],[32,70,"PRODUCT"],[74,112,"PRODUCT"],[116,133,"PRODUCT"],[137,152,"PRODUCT"],[156,174,"PRODUCT"]],"Comments":[]}
{"id":1294,"text":"Outdoor Adventure Gear: 1) Folding Kayak (12ft) 2) Adjustable Paddle 3) Dry Bag (20L) 4) Portable Fish Finder. Kayak features UV-resistant PVC material and weighs only 28lbs.","label":[[25,43,"PRODUCT"],[47,77,"PRODUCT"],[81,98,"PRODUCT"],[102,123,"PRODUCT"],[127,153,"PRODUCT"]],"Comments":[]}
{"id":1295,"text":"The Artisan's Tool Collection comprises: 1) Japanese Pull Saw 2) Chisel Set (6 pieces) 3) Sharpening Stone Kit 4) Dovetail Marking Gauge. Tools feature octagonal hickory handles and carbon steel blades.","label":[[4,30,"PRODUCT"],[34,56,"PRODUCT"],[60,83,"PRODUCT"],[87,113,"PRODUCT"],[117,150,"PRODUCT"]],"Comments":[]}
{"id":1296,"text":"Smart Home Starter Kit: 1) Wi-Fi Thermostat 2) Smart Plug (4-pack) 3) Motion Sensor 4) Video Doorbell. Compatible with Alexa and Google Home. Thermostat features learning algorithm.","label":[[23,41,"PRODUCT"],[45,68,"PRODUCT"],[72,89,"PRODUCT"],[93,111,"PRODUCT"],[115,154,"PRODUCT"]],"Comments":[]}
{"id":1297,"text":"The Gardener's Essentials: 1) Telescoping Pruning Shears 2) Kneeling Pad with handle 3) Hori Hori Knife 4) Waterproof Garden Tote. Shears feature carbon steel blades and locking mechanism.","label":[[4,25,"PRODUCT"],[29,61,"PRODUCT"],[65,82,"PRODUCT"],[86,108,"PRODUCT"],[112,139,"PRODUCT"]],"Comments":[]}
{"id":1298,"text":"Premium Coffee Station: 1) Espresso Machine with grinder 2) Milk Frother 3) Tamper Set 4) Knock Box. Machine features 15-bar pressure and dual heating system.","label":[[23,40,"PRODUCT"],[44,83,"PRODUCT"],[87,103,"PRODUCT"],[107,120,"PRODUCT"],[124,137,"PRODUCT"],[181,198,"PRODUCT"]],"Comments":[]}
{"id":1299,"text":"The Writer's Desk Set includes: 1) Leather Writing Pad 2) Fountain Pen with gold nib 3) Inkwell Set (3 colors) 4) Paperweight. Pen features hand-tuned iridium point.","label":[[4,24,"PRODUCT"],[28,54,"PRODUCT"],[58,89,"PRODUCT"],[93,113,"PRODUCT"],[117,137,"PRODUCT"]],"Comments":[]}
{"id":1300,"text":"Yoga Studio Essentials: 1) Non-Slip Mat (6mm) 2) Cork Blocks (2-pack) 3) Stretch Strap 4) Bolster Pillow. Mat features alignment markers and moisture-wicking surface.","label":[[25,43,"PRODUCT"],[47,73,"PRODUCT"],[77,93,"PRODUCT"],[97,114,"PRODUCT"],[118,140,"PRODUCT"]],"Comments":[]}
{"id":1301,"text":"The Vintage Audio Collection: 1) Tube Amplifier 2) Bookshelf Speakers 3) Turntable with cartridge 4) Headphone Stand. Amplifier features hand-wound transformers.","label":[[4,28,"PRODUCT"],[32,54,"PRODUCT"],[58,89,"PRODUCT"],[93,112,"PRODUCT"],[116,144,"PRODUCT"]],"Comments":[]}
{"id":1302,"text":"Bike Commuter Package: 1) Waterproof Pannier Bag 2) Helmet with MIPS 3) Bike Light Set 4) Repair Kit. Bag features reflective details and 25L capacity.","label":[[24,42,"PRODUCT"],[46,71,"PRODUCT"],[75,93,"PRODUCT"],[97,112,"PRODUCT"],[116,145,"PRODUCT"]],"Comments":[]}
{"id":1303,"text":"The Baker's Oven Kit contains: 1) Pizza Stone 2) Bread Cloche 3) Lame Set 4) Proofing Baskets. Stone features cordierite construction for even heat distribution.","label":[[4,20,"PRODUCT"],[24,40,"PRODUCT"],[44,56,"PRODUCT"],[60,80,"PRODUCT"],[84,124,"PRODUCT"]],"Comments":[]}
{"id":1304,"text":"Home Brewing Starter Set: 1) Glass Carboy (5gal) 2) Airlock 3) Hydrometer 4) Bottling Wand. Includes complete step-by-step instruction manual.","label":[[26,44,"PRODUCT"],[48,65,"PRODUCT"],[69,83,"PRODUCT"],[87,104,"PRODUCT"],[108,152,"PRODUCT"]],"Comments":[]}
{"id":1305,"text":"The Art Studio Bundle features: 1) French Easel 2) Brush Set (12 pieces) 3) Palette Knives 4) Canvas Carrier. Easel converts to field box with storage.","label":[[4,26,"PRODUCT"],[30,54,"PRODUCT"],[58,77,"PRODUCT"],[81,98,"PRODUCT"],[102,130,"PRODUCT"]],"Comments":[]}
{"id": 2000, "text": "Hand-stitched and assembled with care, the Solstice Mirror speaks volumes about your sense of style.", "label": [[43, 58, "PRODUCT"]], "Comments": []}
{"id": 2001, "text": "The Aurora Floor Lamp is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 21, "PRODUCT"]], "Comments": []}
{"id": 2002, "text": "With a compact form and elegant finish, the Echo Nightstand is ideal for smaller spaces that need a style boost.", "label": [[44, 59, "PRODUCT"]], "Comments": []}
{"id": 2003, "text": "Elevate your home’s aesthetic with the Artemis Armchair, featuring a minimalist design and exceptional craftsmanship.", "label": [[39, 55, "PRODUCT"]], "Comments": []}
{"id": 2004, "text": "Bring luxury into your everyday with the Cambridge Sofa, perfect for bedrooms, living rooms, and more.", "label": [[41, 55, "PRODUCT"]], "Comments": []}
{"id": 2005, "text": "Add both functionality and flair with the Savannah Bed Frame—a must-have for modern homes.", "label": [[42, 60, "PRODUCT"]], "Comments": []}
{"id": 2006, "text": "With a compact form and elegant finish, the Echo Nightstand is ideal for smaller spaces that need a style boost.", "label": [[44, 59, "PRODUCT"]], "Comments": []}
{"id": 2007, "text": "Hand-stitched and assembled with care, the Atlas Dresser speaks volumes about your sense of style.", "label": [[43, 56, "PRODUCT"]], "Comments": []}
{"id": 2008, "text": "Add both functionality and flair with the Lyra Recliner—a must-have for modern homes.", "label": [[42, 55, "PRODUCT"]], "Comments": []}
{"id": 2009, "text": "The Echo Nightstand is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 19, "PRODUCT"]], "Comments": []}
{"id": 2010, "text": "The Nova Ceiling Fan is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 20, "PRODUCT"]], "Comments": []}
{"id": 2011, "text": "The Milo Bookshelf is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 18, "PRODUCT"]], "Comments": []}
{"id": 2012, "text": "Whether you're redecorating or starting fresh, the Zephyr Bar Stool adds a timeless touch to your interior.", "label": [[51, 67, "PRODUCT"]], "Comments": []}
{"id": 2013, "text": "Hand-stitched and assembled with care, the Aurora Floor Lamp speaks volumes about your sense of style.", "label": [[43, 60, "PRODUCT"]], "Comments": []}
{"id": 2014, "text": "Crafted with precision, the Chloe Bedside Table combines durability and beauty in a way that few pieces can match.", "label": [[28, 47, "PRODUCT"]], "Comments": []}
{"id": 2015, "text": "Whether you're redecorating or starting fresh, the Vega Mattress adds a timeless touch to your interior.", "label": [[51, 64, "PRODUCT"]], "Comments": []}
{"id": 2016, "text": "Elevate your home’s aesthetic with the Aurora Floor Lamp, featuring a minimalist design and exceptional craftsmanship.", "label": [[39, 56, "PRODUCT"]], "Comments": []}
{"id": 2017, "text": "Hand-stitched and assembled with care, the Savannah Bed Frame speaks volumes about your sense of style.", "label": [[43, 61, "PRODUCT"]], "Comments": []}
{"id": 2018, "text": "Hand-stitched and assembled with care, the Solstice Mirror speaks volumes about your sense of style.", "label": [[43, 58, "PRODUCT"]], "Comments": []}
{"id": 2019, "text": "Whether you're redecorating or starting fresh, the Artemis Armchair adds a timeless touch to your interior.", "label": [[51, 67, "PRODUCT"]], "Comments": []}
{"id": 2020, "text": "With a compact form and elegant finish, the Cambridge Sofa is ideal for smaller spaces that need a style boost.", "label": [[44, 58, "PRODUCT"]], "Comments": []}
{"id": 2021, "text": "Elevate your home’s aesthetic with the Artemis Armchair, featuring a minimalist design and exceptional craftsmanship.", "label": [[39, 55, "PRODUCT"]], "Comments": []}
{"id": 2022, "text": "Crafted with precision, the Cambridge Sofa combines durability and beauty in a way that few pieces can match.", "label": [[28, 42, "PRODUCT"]], "Comments": []}
{"id": 2023, "text": "Experience unparalleled comfort with our Luna Dining Table, crafted from the finest fabrics and engineered for optimal support.", "label": [[41, 58, "PRODUCT"]], "Comments": []}
{"id": 2024, "text": "Crafted with precision, the Aurora Floor Lamp combines durability and beauty in a way that few pieces can match.", "label": [[28, 45, "PRODUCT"]], "Comments": []}
{"id": 2025, "text": "Add both functionality and flair with the Orion LED Desk Light—a must-have for modern homes.", "label": [[42, 62, "PRODUCT"]], "Comments": []}
{"id": 2026, "text": "Bring luxury into your everyday with the Orion LED Desk Light, perfect for bedrooms, living rooms, and more.", "label": [[41, 61, "PRODUCT"]], "Comments": []}
{"id": 2027, "text": "Hand-stitched and assembled with care, the Chloe Bedside Table speaks volumes about your sense of style.", "label": [[43, 62, "PRODUCT"]], "Comments": []}
{"id": 2028, "text": "Add both functionality and flair with the Orion LED Desk Light—a must-have for modern homes.", "label": [[42, 62, "PRODUCT"]], "Comments": []}
{"id": 2029, "text": "Crafted with precision, the Cambridge Sofa combines durability and beauty in a way that few pieces can match.", "label": [[28, 42, "PRODUCT"]], "Comments": []}
{"id": 2030, "text": "Experience unparalleled comfort with our Orion LED Desk Light, crafted from the finest fabrics and engineered for optimal support.", "label": [[41, 61, "PRODUCT"]], "Comments": []}
{"id": 2031, "text": "The Echo Nightstand is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 19, "PRODUCT"]], "Comments": []}
{"id": 2032, "text": "Designed to meet the highest standards, the Echo Nightstand delivers on both performance and aesthetics.", "label": [[44, 59, "PRODUCT"]], "Comments": []}
{"id": 2033, "text": "Crafted with precision, the Zephyr Bar Stool combines durability and beauty in a way that few pieces can match.", "label": [[28, 44, "PRODUCT"]], "Comments": []}
{"id": 2034, "text": "Elevate your home’s aesthetic with the Vega Mattress, featuring a minimalist design and exceptional craftsmanship.", "label": [[39, 52, "PRODUCT"]], "Comments": []}
{"id": 2035, "text": "Bring luxury into your everyday with the Atlas Dresser, perfect for bedrooms, living rooms, and more.", "label": [[41, 54, "PRODUCT"]], "Comments": []}
{"id": 2036, "text": "Hand-stitched and assembled with care, the Aurora Floor Lamp speaks volumes about your sense of style.", "label": [[43, 60, "PRODUCT"]], "Comments": []}
{"id": 2037, "text": "Add both functionality and flair with the Savannah Bed Frame—a must-have for modern homes.", "label": [[42, 60, "PRODUCT"]], "Comments": []}
{"id": 2038, "text": "Bring luxury into your everyday with the Savannah Bed Frame, perfect for bedrooms, living rooms, and more.", "label": [[41, 59, "PRODUCT"]], "Comments": []}
{"id": 2039, "text": "Bring luxury into your everyday with the Chloe Bedside Table, perfect for bedrooms, living rooms, and more.", "label": [[41, 60, "PRODUCT"]], "Comments": []}
{"id": 2040, "text": "With a compact form and elegant finish, the Solstice Mirror is ideal for smaller spaces that need a style boost.", "label": [[44, 59, "PRODUCT"]], "Comments": []}
{"id": 2041, "text": "The Cambridge Sofa is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 18, "PRODUCT"]], "Comments": []}
{"id": 2042, "text": "Experience unparalleled comfort with our Vega Mattress, crafted from the finest fabrics and engineered for optimal support.", "label": [[41, 54, "PRODUCT"]], "Comments": []}
{"id": 2043, "text": "Experience unparalleled comfort with our Atlas Dresser, crafted from the finest fabrics and engineered for optimal support.", "label": [[41, 54, "PRODUCT"]], "Comments": []}
{"id": 2044, "text": "Designed to meet the highest standards, the Luna Dining Table delivers on both performance and aesthetics.", "label": [[44, 61, "PRODUCT"]], "Comments": []}
{"id": 2045, "text": "With a compact form and elegant finish, the Nexus TV Stand is ideal for smaller spaces that need a style boost.", "label": [[44, 58, "PRODUCT"]], "Comments": []}
{"id": 2046, "text": "Whether you're redecorating or starting fresh, the Vega Mattress adds a timeless touch to your interior.", "label": [[51, 64, "PRODUCT"]], "Comments": []}
{"id": 2047, "text": "Experience unparalleled comfort with our Luna Dining Table, crafted from the finest fabrics and engineered for optimal support.", "label": [[41, 58, "PRODUCT"]], "Comments": []}
{"id": 2048, "text": "Experience unparalleled comfort with our Echo Nightstand, crafted from the finest fabrics and engineered for optimal support.", "label": [[41, 56, "PRODUCT"]], "Comments": []}
{"id": 2049, "text": "Elevate your home’s aesthetic with the Milo Bookshelf, featuring a minimalist design and exceptional craftsmanship.", "label": [[39, 53, "PRODUCT"]], "Comments": []}
{"id": 2050, "text": "Elevate your home’s aesthetic with the Aurora Floor Lamp, featuring a minimalist design and exceptional craftsmanship.", "label": [[39, 56, "PRODUCT"]], "Comments": []}
{"id": 2051, "text": "The Chloe Bedside Table is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 23, "PRODUCT"]], "Comments": []}
{"id": 2052, "text": "Crafted with precision, the Nova Ceiling Fan combines durability and beauty in a way that few pieces can match.", "label": [[28, 44, "PRODUCT"]], "Comments": []}
{"id": 2053, "text": "Add both functionality and flair with the Aurora Floor Lamp—a must-have for modern homes.", "label": [[42, 59, "PRODUCT"]], "Comments": []}
{"id": 2054, "text": "Bring luxury into your everyday with the Savannah Bed Frame, perfect for bedrooms, living rooms, and more.", "label": [[41, 59, "PRODUCT"]], "Comments": []}
{"id": 2055, "text": "The Solstice Mirror is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 19, "PRODUCT"]], "Comments": []}
{"id": 2056, "text": "Designed to meet the highest standards, the Echo Nightstand delivers on both performance and aesthetics.", "label": [[44, 59, "PRODUCT"]], "Comments": []}
{"id": 2057, "text": "Experience unparalleled comfort with our Chloe Bedside Table, crafted from the finest fabrics and engineered for optimal support.", "label": [[41, 60, "PRODUCT"]], "Comments": []}
{"id": 2058, "text": "Bring luxury into your everyday with the Savannah Bed Frame, perfect for bedrooms, living rooms, and more.", "label": [[41, 59, "PRODUCT"]], "Comments": []}
{"id": 2059, "text": "Bring luxury into your everyday with the Lyra Recliner, perfect for bedrooms, living rooms, and more.", "label": [[41, 54, "PRODUCT"]], "Comments": []}
{"id": 2060, "text": "The Savannah Bed Frame is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 22, "PRODUCT"]], "Comments": []}
{"id": 2061, "text": "Experience unparalleled comfort with our Solstice Mirror, crafted from the finest fabrics and engineered for optimal support.", "label": [[41, 56, "PRODUCT"]], "Comments": []}
{"id": 2062, "text": "Crafted with precision, the Chloe Bedside Table combines durability and beauty in a way that few pieces can match.", "label": [[28, 47, "PRODUCT"]], "Comments": []}
{"id": 2063, "text": "With a compact form and elegant finish, the Zephyr Bar Stool is ideal for smaller spaces that need a style boost.", "label": [[44, 60, "PRODUCT"]], "Comments": []}
{"id": 2064, "text": "Bring luxury into your everyday with the Artemis Armchair, perfect for bedrooms, living rooms, and more.", "label": [[41, 57, "PRODUCT"]], "Comments": []}
{"id": 2065, "text": "Designed to meet the highest standards, the Milo Bookshelf delivers on both performance and aesthetics.", "label": [[44, 58, "PRODUCT"]], "Comments": []}
{"id": 2066, "text": "With a compact form and elegant finish, the Luna Dining Table is ideal for smaller spaces that need a style boost.", "label": [[44, 61, "PRODUCT"]], "Comments": []}
{"id": 2067, "text": "The Orion LED Desk Light is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 24, "PRODUCT"]], "Comments": []}
{"id": 2068, "text": "Hand-stitched and assembled with care, the Luna Dining Table speaks volumes about your sense of style.", "label": [[43, 60, "PRODUCT"]], "Comments": []}
{"id": 2069, "text": "Bring luxury into your everyday with the Luna Dining Table, perfect for bedrooms, living rooms, and more.", "label": [[41, 58, "PRODUCT"]], "Comments": []}
{"id": 2070, "text": "Whether you're redecorating or starting fresh, the Chloe Bedside Table adds a timeless touch to your interior.", "label": [[51, 70, "PRODUCT"]], "Comments": []}
{"id": 2071, "text": "Elevate your home’s aesthetic with the Atlas Dresser, featuring a minimalist design and exceptional craftsmanship.", "label": [[39, 52, "PRODUCT"]], "Comments": []}
{"id": 2072, "text": "The Lyra Recliner is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 17, "PRODUCT"]], "Comments": []}
{"id": 2073, "text": "The Cambridge Sofa is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 18, "PRODUCT"]], "Comments": []}
{"id": 2074, "text": "Bring luxury into your everyday with the Savannah Bed Frame, perfect for bedrooms, living rooms, and more.", "label": [[41, 59, "PRODUCT"]], "Comments": []}
{"id": 2075, "text": "The Luna Dining Table is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 21, "PRODUCT"]], "Comments": []}
{"id": 2076, "text": "Designed to meet the highest standards, the Zephyr Bar Stool delivers on both performance and aesthetics.", "label": [[44, 60, "PRODUCT"]], "Comments": []}
{"id": 2077, "text": "Elevate your home’s aesthetic with the Nova Ceiling Fan, featuring a minimalist design and exceptional craftsmanship.", "label": [[39, 55, "PRODUCT"]], "Comments": []}
{"id": 2078, "text": "Hand-stitched and assembled with care, the Nova Ceiling Fan speaks volumes about your sense of style.", "label": [[43, 59, "PRODUCT"]], "Comments": []}
{"id": 2079, "text": "With a compact form and elegant finish, the Atlas Dresser is ideal for smaller spaces that need a style boost.", "label": [[44, 57, "PRODUCT"]], "Comments": []}
{"id": 2080, "text": "Elevate your home’s aesthetic with the Solstice Mirror, featuring a minimalist design and exceptional craftsmanship.", "label": [[39, 54, "PRODUCT"]], "Comments": []}
{"id": 2081, "text": "Whether you're redecorating or starting fresh, the Lyra Recliner adds a timeless touch to your interior.", "label": [[51, 64, "PRODUCT"]], "Comments": []}
{"id": 2082, "text": "Crafted with precision, the Artemis Armchair combines durability and beauty in a way that few pieces can match.", "label": [[28, 44, "PRODUCT"]], "Comments": []}
{"id": 2083, "text": "Experience unparalleled comfort with our Lyra Recliner, crafted from the finest fabrics and engineered for optimal support.", "label": [[41, 54, "PRODUCT"]], "Comments": []}
{"id": 2084, "text": "Hand-stitched and assembled with care, the Artemis Armchair speaks volumes about your sense of style.", "label": [[43, 59, "PRODUCT"]], "Comments": []}
{"id": 2085, "text": "Crafted with precision, the Zephyr Bar Stool combines durability and beauty in a way that few pieces can match.", "label": [[28, 44, "PRODUCT"]], "Comments": []}
{"id": 2086, "text": "Designed to meet the highest standards, the Solstice Mirror delivers on both performance and aesthetics.", "label": [[44, 59, "PRODUCT"]], "Comments": []}
{"id": 2087, "text": "Bring luxury into your everyday with the Artemis Armchair, perfect for bedrooms, living rooms, and more.", "label": [[41, 57, "PRODUCT"]], "Comments": []}
{"id": 2088, "text": "Crafted with precision, the Cambridge Sofa combines durability and beauty in a way that few pieces can match.", "label": [[28, 42, "PRODUCT"]], "Comments": []}
{"id": 2089, "text": "Elevate your home’s aesthetic with the Nexus TV Stand, featuring a minimalist design and exceptional craftsmanship.", "label": [[39, 53, "PRODUCT"]], "Comments": []}
{"id": 2090, "text": "Bring luxury into your everyday with the Milo Bookshelf, perfect for bedrooms, living rooms, and more.", "label": [[41, 55, "PRODUCT"]], "Comments": []}
{"id": 2091, "text": "Elevate your home’s aesthetic with the Cambridge Sofa, featuring a minimalist design and exceptional craftsmanship.", "label": [[39, 53, "PRODUCT"]], "Comments": []}
{"id": 2092, "text": "Experience unparalleled comfort with our Nexus TV Stand, crafted from the finest fabrics and engineered for optimal support.", "label": [[41, 55, "PRODUCT"]], "Comments": []}
{"id": 2093, "text": "Add both functionality and flair with the Chloe Bedside Table—a must-have for modern homes.", "label": [[42, 61, "PRODUCT"]], "Comments": []}
{"id": 2094, "text": "The Zephyr Bar Stool is designed to bring modern elegance into any space. With its sleek lines and high-quality materials, it's both functional and stylish.", "label": [[4, 20, "PRODUCT"]], "Comments": []}
{"id": 2095, "text": "Bring luxury into your everyday with the Aurora Floor Lamp, perfect for bedrooms, living rooms, and more.", "label": [[41, 58, "PRODUCT"]], "Comments": []}
{"id": 2096, "text": "Add both functionality and flair with the Savannah Bed Frame—a must-have for modern homes.", "label": [[42, 60, "PRODUCT"]], "Comments": []}
{"id": 2097, "text": "Designed to meet the highest standards, the Solstice Mirror delivers on both performance and aesthetics.", "label": [[44, 59, "PRODUCT"]], "Comments": []}
{"id": 2098, "text": "Experience unparalleled comfort with our Lyra Recliner, crafted from the finest fabrics and engineered for optimal support.", "label": [[41, 54, "PRODUCT"]], "Comments": []}
{"id": 2099, "text": "Add both functionality and flair with the Luna Dining Table—a must-have for modern homes.", "label": [[42, 59, "PRODUCT"]], "Comments": []}
{"id": 3000, "text": "Introducing the Nico Bunk Bed, a masterclass in modern craftsmanship. Every detail has been thoughtfully designed, from the sleek contours to the premium finish. This piece works perfectly in contemporary interiors and adds an air of understated elegance. Pair the Nico Bunk Bed with a neutral color palette to highlight its unique silhouette.\n\nOur designers recommend combining the Nico Bunk Bed with softer accessories such as textured throws and plush cushions. Not only does this elevate your comfort, but it also creates a warm and inviting atmosphere. The Nico Bunk Bed has been a bestseller among our customers seeking both function and form.\n\nBacked by our satisfaction guarantee, the Nico Bunk Bed is sure to become a cornerstone of your home decor. It’s easy to assemble, requires minimal maintenance, and is built to last through years of daily use.", "label": [[16, 29, "PRODUCT"], [265, 278, "PRODUCT"], [383, 396, "PRODUCT"], [562, 575, "PRODUCT"], [693, 706, "PRODUCT"]], "Comments": []}
{"id":1306,"text":"Classic Living Room Set includes: 1) Chesterfield Sofa with tufted upholstery 2) Ottoman with storage 3) Side Tables (pair) 4) Floor Lamp. Sofa features hand-carved mahogany legs and premium leather.","label":[[22,40,"PRODUCT"],[44,88,"PRODUCT"],[92,118,"PRODUCT"],[122,140,"PRODUCT"],[144,159,"PRODUCT"],[213,236,"PRODUCT"]],"Comments":[]}
{"id":1307,"text":"Executive Office Collection: 1) L-shaped Desk with file drawers 2) High-back Leather Chair 3) Bookcase with glass doors 4) Credenza. Desk features cable management system and walnut veneer.","label":[[23,43,"PRODUCT"],[47,85,"PRODUCT"],[89,114,"PRODUCT"],[118,144,"PRODUCT"],[148,159,"PRODUCT"],[213,235,"PRODUCT"]],"Comments":[]}
{"id":1308,"text":"Modern Bedroom Suite comprises: 1) Platform Bed with headboard 2) Nightstands (matching pair) 3) Dresser with mirror 4) Wardrobe. Bed features built-in USB charging ports and LED lighting.","label":[[22,40,"PRODUCT"],[44,78,"PRODUCT"],[82,111,"PRODUCT"],[115,137,"PRODUCT"],[141,153,"PRODUCT"],[207,230,"PRODUCT"]],"Comments":[]}
{"id":1309,"text":"The Dining Collection features: 1) Extendable Table (seats 6-10) 2) Upholstered Chairs (set of 6) 3) Buffet Server 4) China Cabinet. Table includes two 18\" leaves and tempered glass protector.","label":[[4,24,"PRODUCT"],[28,68,"PRODUCT"],[72,103,"PRODUCT"],[107,126,"PRODUCT"],[130,147,"PRODUCT"],[201,233,"PRODUCT"]],"Comments":[]}
{"id":1310,"text":"Outdoor Patio Set contains: 1) Sectional Sofa with cushions 2) Coffee Table 3) Side Tables 4) Weatherproof Rug. All furniture features rust-resistant aluminum frame and UV-resistant fabric.","label":[[24,42,"PRODUCT"],[46,80,"PRODUCT"],[84,101,"PRODUCT"],[105,120,"PRODUCT"],[124,144,"PRODUCT"],[198,236,"PRODUCT"]],"Comments":[]}
{"id":1311,"text":"Kids' Bedroom Package: 1) Twin Loft Bed with desk 2) Storage Drawers 3) Bookshelf 4) Task Chair. Bed features safety rails and ladder with anti-slip steps.","label":[[24,42,"PRODUCT"],[46,74,"PRODUCT"],[78,98,"PRODUCT"],[102,117,"PRODUCT"],[121,142,"PRODUCT"]],"Comments":[]}
{"id":1312,"text":"Luxury Walk-in Closet System includes: 1) Adjustable Shelving 2) Pull-out Tie Rack 3) Jewelry Drawer 4) Full-length Mirror. System features soft-close drawers and LED lighting.","label":[[28,46,"PRODUCT"],[50,74,"PRODUCT"],[78,97,"PRODUCT"],[101,122,"PRODUCT"],[126,156,"PRODUCT"]],"Comments":[]}
{"id":1313,"text":"Home Theater Seating Set: 1) Reclining Loveseat 2) Power Recliners (pair) 3) Console with cup holders 4) Acoustic Panels. Seats feature USB charging ports and built-in storage.","label":[[27,45,"PRODUCT"],[49,76,"PRODUCT"],[80,105,"PRODUCT"],[109,134,"PRODUCT"],[138,158,"PRODUCT"],[212,242,"PRODUCT"]],"Comments":[]}
{"id":1314,"text":"The Study Collection comprises: 1) Writing Desk with drawers 2) Library Chair 3) Filing Cabinet 4) Reading Lamp. Desk features leather inlay and vintage brass hardware.","label":[[4,24,"PRODUCT"],[28,60,"PRODUCT"],[64,83,"PRODUCT"],[87,107,"PRODUCT"],[111,129,"PRODUCT"],[183,215,"PRODUCT"]],"Comments":[]}
{"id":1315,"text":"Industrial Loft Furniture: 1) Metal-framed Bed 2) Pipe Shelf Unit 3) Edison Bulb Chandelier 4) Reclaimed Wood Coffee Table. All pieces feature distressed finishes and visible hardware.","label":[[25,43,"PRODUCT"],[47,72,"PRODUCT"],[76,102,"PRODUCT"],[106,133,"PRODUCT"],[137,170,"PRODUCT"]],"Comments":[]}
{"id":1316,"text":"Scandinavian Dining Set: 1) Expandable Teak Table 2) Wishbone Chairs (set of 4) 3) Sideboard 4) Pendant Light. Table features butterfly leaf extension mechanism.","label":[[25,43,"PRODUCT"],[47,77,"PRODUCT"],[81,108,"PRODUCT"],[112,126,"PRODUCT"],[130,148,"PRODUCT"],[202,242,"PRODUCT"]],"Comments":[]}
{"id":1317,"text":"Home Bar Collection includes: 1) Backlit Bar Cabinet 2) Counter-height Stools (set of 3) 3) Wine Rack 4) Ice Bucket. Cabinet features tempered glass shelves and lockable storage.","label":[[23,41,"PRODUCT"],[45,83,"PRODUCT"],[87,120,"PRODUCT"],[124,138,"PRODUCT"],[142,157,"PRODUCT"],[211,244,"PRODUCT"]],"Comments":[]}
{"id":1318,"text":"Nursery Furniture Set: 1) Convertible Crib 2) Changing Table 3) Glider Rocker 4) Storage Dresser. Crib transitions to toddler bed and full-size bed.","label":[[23,41,"PRODUCT"],[45,65,"PRODUCT"],[69,87,"PRODUCT"],[91,109,"PRODUCT"],[113,137,"PRODUCT"]],"Comments":[]}
{"id":1319,"text":"Rustic Bedroom Collection: 1) Four-poster Bed 2) Armoire 3) Vanity with stool 4) Blanket Chest. All pieces feature hand-distressed pine construction.","label":[[25,43,"PRODUCT"],[47,62,"PRODUCT"],[66,87,"PRODUCT"],[91,114,"PRODUCT"],[118,136,"PRODUCT"],[190,224,"PRODUCT"]],"Comments":[]}
{"id":1320,"text":"Home Office Storage Solutions: 1) Lateral File Cabinet 2) Mobile Pedestal 3) Overhead Storage Unit 4) Magazine Rack. All pieces feature key-locking drawers and smooth-glide rollers.","label":[[31,49,"PRODUCT"],[53,74,"PRODUCT"],[78,103,"PRODUCT"],[107,127,"PRODUCT"],[131,155,"PRODUCT"]],"Comments":[]}
{"id": 4000, "text": "Our Floating Wall Shelf is designed with both elegance and functionality in mind. Crafted from premium materials, it seamlessly integrates into any living space. With its hand-carved detailing, the Floating Wall Shelf becomes a focal point of your room.\n\nCustomers appreciate the Floating Wall Shelf for its durability and modern aesthetic. Whether placed in a cozy nook or a spacious loft, it elevates the ambiance effortlessly. Pair the Floating Wall Shelf with our Faux Fur Rug for a complete look that exudes style.\n\nAssembly is straightforward, and care is minimal—just occasional dusting will suffice. The Floating Wall Shelf is available in several finishes to match your décor preferences. Experience unmatched comfort and visual harmony with this standout piece.", "label": [[4, 23, "PRODUCT"], [198, 217, "PRODUCT"], [280, 299, "PRODUCT"], [439, 458, "PRODUCT"], [612, 631, "PRODUCT"]], "Comments": []}
{"id": 4001, "text": "Our Corner Writing Desk is designed with both elegance and functionality in mind. Crafted from premium materials, it seamlessly integrates into any living space. With its hand-carved detailing, the Corner Writing Desk becomes a focal point of your room.\n\nCustomers appreciate the Corner Writing Desk for its durability and modern aesthetic. Whether placed in a cozy nook or a spacious loft, it elevates the ambiance effortlessly. Pair the Corner Writing Desk with our Wall Art Canvas Trio for a complete look that exudes style.\n\nAssembly is straightforward, and care is minimal—just occasional dusting will suffice. The Corner Writing Desk is available in several finishes to match your décor preferences. Experience unmatched comfort and visual harmony with this standout piece.", "label": [[4, 23, "PRODUCT"], [198, 217, "PRODUCT"], [280, 299, "PRODUCT"], [439, 458, "PRODUCT"], [620, 639, "PRODUCT"]], "Comments": []}
{"id": 4002, "text": "Our Chaise Lounge is designed with both elegance and functionality in mind. Crafted from premium materials, it seamlessly integrates into any living space. With its multi-layered cushioning, the Chaise Lounge becomes a focal point of your room.\n\nCustomers appreciate the Chaise Lounge for its durability and modern aesthetic. Whether placed in a cozy nook or a spacious loft, it elevates the ambiance effortlessly. Pair the Chaise Lounge with our Ceramic Vase Collection for a complete look that exudes style.\n\nAssembly is straightforward, and care is minimal—just occasional dusting will suffice. The Chaise Lounge is available in several finishes to match your décor preferences. Experience unmatched comfort and visual harmony with this standout piece.", "label": [[4, 17, "PRODUCT"], [195, 208, "PRODUCT"], [271, 284, "PRODUCT"], [424, 437, "PRODUCT"], [602, 615, "PRODUCT"]], "Comments": []}
{"id": 4010,"text":"Transform your entryway with the Walnut Shoe Storage Bench. Designed with a hidden compartment and cushioned top, this bench combines style and utility. Perfect for small spaces, it helps reduce clutter while providing a comfortable spot to put on shoes.","label":[[33,58,"PRODUCT"],[72,91,"PRODUCT"],[119,124,"PRODUCT"],[169,174,"PRODUCT"]],"Comments":[]}
{"id":4011,"text":"\"I've never loved a piece of furniture as much as the Crescent Lounge Chair!\" said one reviewer. With its deep seat and curved backrest, this chair is ideal for long reading sessions. Available in velvet or boucle.","label":[[54,76,"PRODUCT"],[120,125,"PRODUCT"]],"Comments":[]}
{"id":4012,"text":"Package contents:\n1. Modular TV Console with adjustable shelving\n2. Cable Management Tray (mounted under top shelf)\n3. Assembly hardware and instructions\nNote: All components are FSC certified and made from reclaimed oak.","label":[[20,45,"PRODUCT"],[51,76,"PRODUCT"],[81,118,"PRODUCT"]],"Comments":[]}
{"id":4013,"text":"Looking for a minimalist touch? Our Glass-Top Coffee Table features clean lines and tempered glass supported by powder-coated steel legs. It fits seamlessly into Scandinavian and industrial interiors.","label":[[32,55,"PRODUCT"],[91,96,"PRODUCT"]],"Comments":[]}
{"id":4014,"text":"Maintenance Guide for the Reclaimed Pine Dining Table:\n- Wipe with dry cloth\n- Avoid direct sunlight\n- Use coasters to prevent ring marks\nThis dining table, finished in matte lacquer, brings rustic charm to contemporary homes.","label":[[27,57,"PRODUCT"],[140,153,"PRODUCT"]],"Comments":[]}
{"id":4015,"text":"Our 5-Piece Patio Conversation Set includes two club chairs, a loveseat, and a coffee table with a tempered glass top. Ideal for relaxing outdoors, it features weather-resistant wicker and removable cushions.","label":[[4,37,"PRODUCT"],[93,106,"PRODUCT"]],"Comments":[]}
{"id":4016,"text":"BACK IN STOCK — The popular Ladder Bookshelf returns in oak and espresso finishes! Customers love its minimal footprint and clean aesthetic. Add it to your workspace or bedroom corner for vertical storage.","label":[[21,39,"PRODUCT"]],"Comments":[]}
{"id": 4017, "text": "Design Spotlight: The Swivel Bar Stool makes a statement with its bold silhouette and natural wood grain. Styled here with a Rattan Storage Basket, it blends form and function beautifully.", "label": [[22, 38, "PRODUCT"]], "Comments": []}
{"id": 4018, "text": "Quick Tip: Place a Ceramic Vase Collection beneath your Chaise Lounge to protect hardwood floors and add a pop of color. Works well in compact apartments and urban lofts alike.", "label": [[56, 69, "PRODUCT"]], "Comments": []}
{"id": 4019, "text": "Quick Tip: Place a Boho Throw Blanket beneath your Minimalist TV Console to protect hardwood floors and add a pop of color. Works well in compact apartments and urban lofts alike.", "label": [[51, 72, "PRODUCT"]], "Comments": []}
{"id": 4020, "text": "Quick Tip: Place a Boho Throw Blanket beneath your Velvet Tufted Ottoman to protect hardwood floors and add a pop of color. Works well in compact apartments and urban lofts alike.", "label": [[51, 72, "PRODUCT"]], "Comments": []}
{"id": 4021, "text": "Adjustable Standing Desk — built for modern homes. Featuring soft-close drawers and a modular layout, it's ideal for dynamic spaces. Match it with a Wall Art Canvas Trio to complete the look.", "label": [[0, 24, "PRODUCT"]], "Comments": []}
{"id": 4022, "text": "Design Spotlight: The Minimalist TV Console makes a statement with its bold silhouette and natural wood grain. Styled here with a Rattan Storage Basket, it blends form and function beautifully.", "label": [[22, 43, "PRODUCT"]], "Comments": []}
{"id": 4023, "text": "Customer Review:\n\"I was hesitant at first, but the Scandinavian Dining Set exceeded my expectations. The texture, the finish—everything is perfect. I paired it with the Wall Art Canvas Trio, and they look stunning together.\"", "label": [[51, 74, "PRODUCT"]], "Comments": []}
{"id": 4024, "text": "Mid-Century Accent Chair — built for modern homes. Featuring soft-close drawers and a modular layout, it's ideal for dynamic spaces. Match it with a Linen Curtain Set to complete the look.", "label": [[0, 24, "PRODUCT"]], "Comments": []}
{"id": 4025, "text": "What's included:\n- Velvet Tufted Ottoman\n- Instruction manual\n- Tools for assembly\n- Matching Rattan Storage Basket\nShips in 2 boxes. Estimated assembly time: 35 minutes.", "label": [[19, 40, "PRODUCT"]], "Comments": []}
{"id": 4026, "text": "Customer Review:\n\"I was hesitant at first, but the Minimalist TV Console exceeded my expectations. The texture, the finish—everything is perfect. I paired it with the Wall Art Canvas Trio, and they look stunning together.\"", "label": [[51, 72, "PRODUCT"]], "Comments": []}
